yaVDR07_documentation.org
# -*- mode: org; -*-
* Settings for Export :noexport:
:DOCUMENT_OPTIONS:
#+LANGUAGE: de
#+TITLE: Ansible Playbooks für yaVDR
#+Author: Alexander Grothe (seahawk1986)
#+Email: seahawk1986@gmx.de
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+SETUPFILE: org-html-themes/org/theme-readtheorg-local.setup
#+OPTIONS: ^:nil
#+MACRO: YAVDR_VERSION 0.7
#+OPTIONS: auto-id:f toc:4
# Local Variables:
# org-src-preserve-indentation: t
# End:
#+PROPERTY: header-args :mkdirp yes :padline no :comments link
#+STARTUP: latexpreview
#+EXPORT_LATEX_CLASS: koma-article
#+LATEX_HEADER: \usepackage[ngerman]{babel}
#+LATEX_CLASS_OPTIONS: [a4paper,ngerman,koma,DIV=15,10pt,captions=tableheading,parskip=full]
# #+LATEX_HEADER: \usepackage[BCOR=8.25mm]{typearea}
#+LATEX_HEADER: \RequirePackage[ngerman=ngerman-x-latest]{hyphsubst}
#+LATEX_HEADER: \usepackage{microtype}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{listingsutf8}
# #+LATEX_HEADER: \usepackage{librebaskerville}
# #+LATEX_HEADER: \usepackage[bitstream-charter]{mathdesign}
#+LATEX_HEADER: \usepackage{DejaVuSerif}
#+LATEX_HEADER: \usepackage[defaultsans]{droidsans}
#+LATEX_HEADER: \usepackage[defaultmono]{droidsansmono}
#+LATEX_HEADER: \usepackage[unicode,pdfencoding=auto,breaklinks=true,colorlinks=true,linktoc=all]{hyperref}
#+LATEX_HEADER: \usepackage{inconsolata}

#+LaTeX_HEADER: \usepackage{paralist}
#+LaTeX_HEADER: \let\itemize\compactitem
#+LaTeX_HEADER: \let\description\compactdesc
#+LaTeX_HEADER: \let\enumerate\compactenum
#+LATEX_HEADER: \usepackage[margin=3.0cm]{geometry}
#+LATEX_HEADER: \usepackage[ngerman]{babel}
#+LATEX_HEADER: \usepackage{palatino}
#+LATEX_HEADER: \usepackage{inconsolata}
# #+LATEX_HEADER: \renewcommand*\ttdefault{pcr}
#+LATEX_HEADER: \usepackage{rotating}
#+LATEX_HEADER: \usepackage{paralist}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage[locale=DE,seperr,repeatunits=true,trapambigerr=false,tophrase={{ bis }}]{siunitx}
#+LATEX_HEADER: \usemintedstyle{lovelace}
#+LATEX_HEADER: \lstset{basicstyle=\ttfamily, columns=fullflexible, frame=single, breaklines=true, postbreak=\mbox{\textcolor{red}{$\hookrightarrow$}\space},
#+LATEX_HEADER:         xleftmargin=17pt,
#+LATEX_HEADER:         framexleftmargin=17pt,
#+LATEX_HEADER:         framexrightmargin=5pt,
#+LATEX_HEADER:         framexbottommargin=4pt,
#+LATEX_HEADER:         breakatwhitespace=true,
#+LATEX_HEADER: }
#+LATEX: \defaultfontfeatures{Ligatures=TeX}
#+LATEX: \renewcommand\arraystretch{1.5}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \let\OldTexttt\texttt
#+LATEX_HEADER: \renewcommand{\texttt}[1]{\OldTexttt{\path{#1}}}
#+LATEX_HEADER: \setlength\emergencystretch{1em}
# #+LATEX_HEADER_EXTRA:
#+begin_src elisp
(setq org-latex-toc-command "\\tableofcontents \\clearpage")
#+end_src

#+RESULTS:
: \tableofcontents \clearpage

#+BEGIN_SRC latex
\newcommand*\justify{%
  \fontdimen2\font=0.4em% interword space
  \fontdimen3\font=0.2em% interword stretch
  \fontdimen4\font=0.1em% interword shrink
  \fontdimen7\font=0.1em% extra space
  \hyphenchar\font=`\-% allowing hyphenation
}

\renewcommand{\texttt}[1]{%
  \begingroup
  \ttfamily
  \begingroup\lccode`~=`/\lowercase{\endgroup\def~}{/\discretionary{}{}{}}%
  \begingroup\lccode`~=`[\lowercase{\endgroup\def~}{[\discretionary{}{}{}}%
  \begingroup\lccode`~=`.\lowercase{\endgroup\def~}{.\discretionary{}{}{}}%
  \catcode`/=\active\catcode`[=\active\catcode`.=\active
  \justify\scantokens{#1\noexpand}%
  \endgroup
}
#+END_SRC

#+EXCLUDE_TAGS: noexport
:END:

* TOC :TOC:noexport:
- [[#einleitung][Einleitung]]
  - [[#lizenz][Lizenz]]
  - [[#vorwort][Vorwort]]
  - [[#zur-syntax][Zur Syntax]]
- [[#installation][Installation]]
  - [[#systemvoraussetzungen][Systemvoraussetzungen]]
  - [[#installation-des-basissystems][Installation des Basissystems]]
  - [[#installation-von-yavdr-mit-ansible][Installation von yaVDR mit Ansible]]
  - [[#erste-schritte-nach-der-installation][Erste Schritte nach der Installation]]
- [[#grundlegendes-zum-system][Grundlegendes zum System]]
  - [[#ssh][SSH]]
  - [[#mit-erhöhten-rechten-arbeiten][Mit erhöhten Rechten Arbeiten]]
  - [[#editoren][Editoren]]
  - [[#paketverwaltung][Paketverwaltung]]
  - [[#dienste][Dienste]]
  - [[#logdateien][Logdateien]]
  - [[#audioausgabe][Audioausgabe]]
- [[#fernbedienungen][Fernbedienungen]]
  - [[#vereinheitlichtes-schema-für-tastennamen][Vereinheitlichtes Schema für Tastennamen]]
  - [[#ir-keytable][ir-keytable]]
  - [[#lircd2uinput][lircd2uinput]]
  - [[#eventlircd][eventlircd]]
  - [[#lircd][lircd]]
  - [[#tools-zum-debuggen-von-tastendrücken][Tools zum Debuggen von Tastendrücken]]
- [[#netzwerkdienste][Netzwerkdienste]]
  - [[#netzwerkfreigaben][Netzwerkfreigaben]]
  - [[#nfs][NFS]]
  - [[#samba][Samba]]
- [[#ausgabe-mit-xorg][Ausgabe mit Xorg]]
  - [[#zugriff-auf-die-systemd-user-session][Zugriff auf die Systemd User Session]]
  - [[#yavdr-frontend][yavdr-frontend]]
  - [[#programme-starten][Programme starten]]
  - [[#mehrere-bildschirme][Mehrere Bildschirme]]
- [[#vdr][VDR]]
  - [[#bedienung-des-vdr][Bedienung des VDR]]
  - [[#unterstützte-ausgabeplugins][Unterstützte Ausgabeplugins]]
  - [[#konfiguration-des-vdr][Konfiguration des VDR]]
- [[#kodi][KODI]]
- [[#vdr-epg-daemon][vdr-epg-daemon]]
  - [[#häufige-probleme][Häufige Probleme]]
- [[#sundtek-treiber][Sundtek Treiber]]
  - [[#start-des-vdr-verzögern-bis-alle-tuner-initialisiert-wurden][Start des VDR verzögern, bis alle Tuner initialisiert wurden]]
  - [[#sundtek-tuner-automatisch-zur-laufzeit-des-vdr-einbinden-lassen][Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen]]

* Einleitung
:PROPERTIES:
:CUSTOM_ID: einleitung
:UNNUMBERED: t
:END:
** Lizenz
:PROPERTIES:
:CUSTOM_ID: lizenz
:UNNUMBERED: t
:END:
Dieses Dokument steht unter der [[http://www.gnu.org/licenses/fdl-1.3.txt][GNU FDL]]
