yaVDR07_documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2021-10-01 Fr 18:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ansible Playbooks für yaVDR</title>
<meta name="author" content="Alexander Grothe (seahawk1986)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ansible Playbooks für yaVDR</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Inhaltsverzeichnis</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#einleitung">Einleitung</a>
<ul>
<li><a href="#lizenz">Lizenz</a></li>
<li><a href="#vorwort">Vorwort</a></li>
<li><a href="#zur-syntax">Zur Syntax</a></li>
</ul>
</li>
<li><a href="#installation">1. Installation</a>
<ul>
<li><a href="#system-requirements">1.1. Systemvoraussetzungen</a>
<ul>
<li><a href="#org1ba245c">1.1.1. für die Nutzung als HTPC</a></li>
<li><a href="#org55f5a14">1.1.2. Nutzung als Server</a></li>
</ul>
</li>
<li><a href="#ubuntu-installation">1.2. Installation des Basissystems</a>
<ul>
<li><a href="#iso-download">1.2.1. Download des Ubuntu Server ISO</a></li>
<li><a href="#ubuntu-server-install">1.2.2. <span class="todo TODO">TODO</span> Installation von Ubuntu Server</a></li>
</ul>
</li>
<li><a href="#ansible-installation">1.3. Installation von yaVDR mit Ansible</a>
<ul>
<li><a href="#playbook-git">1.3.1. Herunterladen von yavdr-ansible</a></li>
<li><a href="#org8858fbc">1.3.2. Anpassen der Vorkonfiguration</a></li>
<li><a href="#install-scripts">1.3.3. Ausführen der Installationsskripte</a></li>
</ul>
</li>
<li><a href="#first-steps">1.4. Erste Schritte nach der Installation</a>
<ul>
<li><a href="#channel-list">1.4.1. Kanalliste hinterlegen</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#system-basics">2. Grundlegendes zum System</a>
<ul>
<li><a href="#ssh">2.1. SSH</a></li>
<li><a href="#root-permissions">2.2. Mit erhöhten Rechten Arbeiten</a></li>
<li><a href="#editors">2.3. Editoren</a></li>
<li><a href="#package-management">2.4. Paketverwaltung</a>
<ul>
<li><a href="#apt-updates">2.4.1. Updates Einspielen</a></li>
<li><a href="#orgd25d991">2.4.2. Entfernen ungenutzter Pakete und alter Kernel</a></li>
</ul>
</li>
<li><a href="#systemd-services">2.5. Dienste</a>
<ul>
<li><a href="#systemctl">2.5.1. systemctl</a></li>
</ul>
</li>
<li><a href="#logfiles">2.6. Logdateien</a></li>
<li><a href="#audio-output">2.7. Audioausgabe</a>
<ul>
<li><a href="#org415ea7f">2.7.1. Pulseaudio vorübergehend deaktivieren</a></li>
<li><a href="#pulse-disable-permanently">2.7.2. Pulseaudio komplett deaktivieren</a></li>
<li><a href="#pulse-force-alsa">2.7.3. Pulseaudio Nutzung von Alsa-Gerät erzwingen</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#remotes">3. Fernbedienungen</a>
<ul>
<li><a href="#yavdr-namespace">3.1. Vereinheitlichtes Schema für Tastennamen</a></li>
<li><a href="#ir-keytable">3.2. ir-keytable</a>
<ul>
<li><a href="#ir-keytable-customization">3.2.1. Anpassen der Tastenbelegung für rc-core Empfänger</a></li>
</ul>
</li>
<li><a href="#lircd2uinput">3.3. lircd2uinput</a></li>
<li><a href="#eventlircd">3.4. eventlircd</a>
<ul>
<li><a href="#eventlircd-specialities">3.4.1. Besonderheiten für eventlircd</a></li>
</ul>
</li>
<li><a href="#lircd">3.5. lircd</a></li>
<li><a href="#debug-remote">3.6. Tools zum Debuggen von Tastendrücken</a>
<ul>
<li><a href="#evtest">3.6.1. evtest</a></li>
<li><a href="#ir-keytable-test">3.6.2. ir-keytable</a></li>
<li><a href="#irw">3.6.3. irw</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#network-services">4. Netzwerkdienste</a>
<ul>
<li><a href="#network-shares">4.1. Netzwerkfreigaben</a>
<ul>
<li><a href="#avahi-linker">4.1.1. avahi-linker</a></li>
</ul>
</li>
<li><a href="#nfs-server">4.2. NFS</a></li>
<li><a href="#samba-server">4.3. Samba</a></li>
</ul>
</li>
<li><a href="#xorg-output">5. Ausgabe mit Xorg</a>
<ul>
<li><a href="#org436730f">5.1. Zugriff auf die Systemd User Session</a>
<ul>
<li><a href="#systemctl-user-session">5.1.1. Einzelne Befehl mit passenden Rechten und Umgebungsvariablen absetzen:</a></li>
<li><a href="#tmux-user-session">5.1.2. Zugriff mit tmux</a></li>
</ul>
</li>
<li><a href="#yavdr-frontend">5.2. yavdr-frontend</a>
<ul>
<li><a href="#org784507a">5.2.1. Verhalten beim Start</a></li>
</ul>
</li>
<li><a href="#start-programs">5.3. Programme starten</a>
<ul>
<li><a href="#orgfb5fd36">5.3.1. desktop-Plugin</a></li>
<li><a href="#frontend-dbus-send">5.3.2. frontend-dbus-send</a></li>
</ul>
</li>
<li><a href="#dual-screen">5.4. Mehrere Bildschirme</a>
<ul>
<li><a href="#osd2web-dualscreen">5.4.1. osd2web auf zweitem Monitor</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#vdr">6. VDR</a>
<ul>
<li><a href="#vdr-controls">6.1. Bedienung des VDR</a></li>
<li><a href="#vdr-output-plugins">6.2. Unterstützte Ausgabeplugins</a>
<ul>
<li><a href="#org1491957">6.2.1. Bekannte Probleme bei den Ausgabeplugins:</a></li>
</ul>
</li>
<li><a href="#vdr-configuration">6.3. Konfiguration des VDR</a>
<ul>
<li><a href="#vdr-environment-variables">6.3.1. Umgebungsvariablen</a></li>
<li><a href="#vdr-start-arguments">6.3.2. Startargumente</a></li>
<li><a href="#vdr-shutdown">6.3.3. Shutdown</a></li>
<li><a href="#vdr-common-problems">6.3.4. Häufige Problemstellungen</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd4f108">7. KODI</a>
<ul>
<li>
<ul>
<li><a href="#orgd353696">7.0.1. Fernsehen mit VNSI</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#epgd">8. vdr-epg-daemon</a>
<ul>
<li><a href="#org69d52ee">8.1. Häufige Probleme</a>
<ul>
<li><a href="#org087c8e5">8.1.1. epgd startet nicht</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sundtek-drivers">9. Sundtek Treiber</a>
<ul>
<li><a href="#sundtek-delay-vdr-start">9.1. Start des VDR verzögern, bis alle Tuner initialisiert wurden</a></li>
<li><a href="#sundtek-dynamic-includes">9.2. Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-einleitung" class="outline-2">
<h2 id="einleitung">Einleitung</h2>
<div class="outline-text-2" id="text-einleitung">
</div>
<div id="outline-container-lizenz" class="outline-3">
<h3 id="lizenz">Lizenz</h3>
<div class="outline-text-3" id="text-lizenz">
<p>
Dieses Dokument steht unter der <a href="http://www.gnu.org/licenses/fdl-1.3.txt">GNU FDL</a>
</p>
</div>
</div>
