yaVDR07_documentation.org
** Vorwort
:PROPERTIES:
:CUSTOM_ID: vorwort
:UNNUMBERED: t
:END:
yaVDR (yet another VDR) ist eine für die Nutzung des [[http://www.tvdr.de/][Video Disk Recorder]] von Klaus Schmidinger angepasste Distribution auf der Basis von Ubuntu Linux, das mit Paketen aus eigenen Paketquellen erweitert wird, um die Nutzung aktueller Versionen des VDR, von KODI und anderer erforderlicher Pakete zu ermöglichen.

Der VDR ist dafür ausgelegt, digitales Fernsehen über die gängigen Empfangswege (DVB-S2, DVB-T(2), DVB-C) zu empfangen, aufzuzeichnen, zu schneiden und wiederzugeben. Mit mit dem [[http://www.vdr-wiki.de/wiki/index.php/Pvrinput-plugin][pvrinput-Plugin]] und einer passenden Hauppauge-TV Karte mit MPEG2-Hardware\-encoder ist der Empfang von analog-TV möglich.
Mit KODI ist außerdem ein mächtiges MediaCenter integriert, das es ermöglicht einen PC mit yaVDR als [[https://de.wikipedia.org/wiki/Home_Theater_Personal_Computer][HTPC]] zu nutzen.
Um eine lange Versorgung mit sicherheitsrelevanten Updates zu ermöglichen, baut yaVDR nach Möglichkeit auf [[https://wiki.ubuntuusers.de/Long_Term_Support/][LTS Versionen von Ubuntu]] auf.

Bei der Installation wird unterstützte Hardware automatisch erkannt und die notwendigen Pakete installiert und vorkonfiguriert, um dem Nutzer eine schnelle Inbetriebnahme des Systems zu ermöglichen. Da dieser Teil der Installation als Ansible-Playbook realisiert ist, kann die Vorkonfiguration bequem erweitert und angepasst werden.

Diese Dokumentation soll die Installation, Konfiguration und Bedienung eines yaVDR Systems erklären und dem Nutzer dabei helfen, sich mit den Besonderheiten vertraut zu machen, die eine yaVDR-Installation von einer normalen Ubuntu-Installation unterscheiden.
Es ist bewusst keine Einführung in die Grundlagen der Bedienung von (Ubuntu) Linux.
Daher wird dem Neueinsteiger empfohlen sich mit Hilfe von entsprechender Literatur oder Online-Quellen wie dem sehr umfangreichen [[http://wiki.ubuntuusers.de][Ubuntu Users Wiki]] einzulesen. Die [[https://freedesktop.org/wiki/Software/systemd/][Dokumentation für systemd]] kann hilfreich sein, um die Funktionsweise der von yavdr-ansible eingerichteten Dienste nachvollziehen zu können.
Auch für den VDR und für KODI kann an dieser Stelle nicht jedes Detail erklärt werden - gute Anlaufstellen für weiterführende Informationen sind das [[http://vdr-wiki.de/][VDR-Wiki]] und das [[http://kodi.wiki/view/Main_Page][KODI-Wiki]].
Wann immer die Beschreibung von Befehlen, Funktionen oder Abläufen den Rahmen dieser Dokumentation sprengen würde, wird daher auf weiterführendes Material verlinkt. Auch Doppelungen werden nach Möglichkeit vermieden und stattdessen auf die entsprechende Stelle in der Dokumentation verlinkt.
** Zur Syntax
:PROPERTIES:
:CUSTOM_ID: zur-syntax
:UNNUMBERED: t
:END:
Befehle, die man in der Shell ausführen kann, sehen so aus:
#+BEGIN_EXAMPLE
$ echo "Hallo, Welt!"
Hallo, Welt!
$ sudo -i  # erlange eine root-Shell
# whoami
root
#+END_EXAMPLE
Ein ~$~ ist dabei der Prompt für einen normalen Nutzer (wie er bei der Installation angelegt wurde) und ein ~#~ der Prompt für den Benutzer *root*. Der Prompt wird nicht mit eingegeben, um einen Befehl auszuführen. In dem Fall würde man also ~echo "Hallo, Welt!"~ eingeben. Die Ausgaben des Befehl erscheinen vor dem nächsten Prompt (in dem Fall in Zeile 2 und 5)

Code im Dokument wird nach Möglichkeit mit Syntax-Highlighting dargestellt, also z.B.:
#+BEGIN_SRC python
#!/usr/bin/env python3
print("Hallo, Welt")
#+END_SRC
* Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:
** Systemvoraussetzungen
:PROPERTIES:
:CUSTOM_ID: system-requirements
:END:
- Eine von Ubuntu unterstützte x86-kompatible CPU (muss aktuell mindestens i686 kompatibel sein). Falls von der CPU unterstützt, wird eine 64-Bit Installation empfohlen.  32-Bit Installationen wurden nicht getestet.
- Für die Root-Partition (~/~) werden mindestens 8 GB empfohlen, bei einer großen Mediensammlung mit KODI mindestens 32 GB. Eine SSD für die Systempartition kann die Boot-Zeit spürbar verringern.
- Eine swap-Partition wird bei mehr als 2 GB Arbeitsspeicher nicht zwingend benötigt. Sie sollte mindestens so groß wie der Arbeitsspeicher sein, um den Ruhezustand nutzen zu können.
- Der Mountpoint für ~/srv~ sollte eine eigene Partition bekommen. Da für Aufnahmen von SD-TV bis zu ca. 3 GB/s und für HD-TV bis zu 9 GB pro Stunde an Daten geschrieben werden können, sollte sie ausreichend dimensioniert werden. Falls Aufnahmen und andere Medien gesammelt werden, ist eine Platte mit einer Größe von mehr als einem Terabyte sinnvoll.
*** für die Nutzung als HTPC
yaVDR {{{YAVDR_VERSION}}} ist für die Nutzung mit VDPAU-fähigen NVidia-Grafikkarten und Intel IGPs ausgelegt. Für eine experimentelle Unterstützung für Grafikkarten von AMD werden Tester mit geeigneter Hardware gesucht.
*** Nutzung als Server
Ab yaVDR {{{YAVDR_VERSION}}} besteht die Möglichkeit auf die Installation der GUI-Komponenten zu verzichten und es als Backend-Server zu betreiben.
In dem Fall wird keine Grafikkarte für die hardwarebeschleunigte Ausgabe benötigt. In Verbindung mit einem Sat>IP Server könnte man den Server in einer Virtuellen Maschine betreiben.
** Installation des Basissystems
:PROPERTIES:
:CUSTOM_ID: ubuntu-installation
:END:
Da es in der Vergangenheit immer wieder Kompatibilitätsprobleme durch die angepassten yaVDR Installation-Images gab, gehen wir bei yaVDR {{{YAVDR_VERSION}}} einen anderen Weg:

Zunächst wird eine Ubuntu Server Installation (wichtig: bei Ubuntu 18.04 die ISOs für den alternative Ubuntu Server Installer nutzen, damit Bootsplash, X-Server und Abhängigkeiten zu bestehenden Netzwerkverbindungen korrekt funktionieren und nicht durch das cloud-init Paket aus dem Tritt gebracht werden) durchgeführt, bei der der Nutzer beliebige Point-Releases (und damit neuere Kernel) wählen kann. Danach besteht die Möglichkeit zusätzliche Treiber zu installieren und die Netzwerkverbindung zu konfigurieren.

Nachdem die Grundinstallation abgeschlossen wurde, wird mit Hilfe von [[https://docs.ansible.com/ansible/latest/index.html][Ansible]] das System als yaVDR-Installation konfiguriert. Der interessierte Nutzer hat die Möglichkeit die Installationsskripte selbst anzupassen - damit wird es deutlich leichter zusätzliche Paketquellen einzubinden und das System reproduzierbar auf die eigenen Bedürfnisse angepasst vorkonfigurieren zu lassen.

