yaVDR07_documentation.html
<div id="outline-container-vorwort" class="outline-3">
<h3 id="vorwort">Vorwort</h3>
<div class="outline-text-3" id="text-vorwort">
<p>
yaVDR (yet another VDR) ist eine für die Nutzung des <a href="http://www.tvdr.de/">Video Disk Recorder</a> von Klaus Schmidinger angepasste Distribution auf der Basis von Ubuntu Linux, das mit Paketen aus eigenen Paketquellen erweitert wird, um die Nutzung aktueller Versionen des VDR, von KODI und anderer erforderlicher Pakete zu ermöglichen.
</p>

<p>
Der VDR ist dafür ausgelegt, digitales Fernsehen über die gängigen Empfangswege (DVB-S2, DVB-T(2), DVB-C) zu empfangen, aufzuzeichnen, zu schneiden und wiederzugeben. Mit mit dem <a href="http://www.vdr-wiki.de/wiki/index.php/Pvrinput-plugin">pvrinput-Plugin</a> und einer passenden Hauppauge-TV Karte mit MPEG2-Hardware&#x00ad;encoder ist der Empfang von analog-TV möglich.
Mit KODI ist außerdem ein mächtiges MediaCenter integriert, das es ermöglicht einen PC mit yaVDR als <a href="https://de.wikipedia.org/wiki/Home_Theater_Personal_Computer">HTPC</a> zu nutzen.
Um eine lange Versorgung mit sicherheitsrelevanten Updates zu ermöglichen, baut yaVDR nach Möglichkeit auf <a href="https://wiki.ubuntuusers.de/Long_Term_Support/">LTS Versionen von Ubuntu</a> auf.
</p>

<p>
Bei der Installation wird unterstützte Hardware automatisch erkannt und die notwendigen Pakete installiert und vorkonfiguriert, um dem Nutzer eine schnelle Inbetriebnahme des Systems zu ermöglichen. Da dieser Teil der Installation als Ansible-Playbook realisiert ist, kann die Vorkonfiguration bequem erweitert und angepasst werden.
</p>

<p>
Diese Dokumentation soll die Installation, Konfiguration und Bedienung eines yaVDR Systems erklären und dem Nutzer dabei helfen, sich mit den Besonderheiten vertraut zu machen, die eine yaVDR-Installation von einer normalen Ubuntu-Installation unterscheiden.
Es ist bewusst keine Einführung in die Grundlagen der Bedienung von (Ubuntu) Linux.
Daher wird dem Neueinsteiger empfohlen sich mit Hilfe von entsprechender Literatur oder Online-Quellen wie dem sehr umfangreichen <a href="http://wiki.ubuntuusers.de">Ubuntu Users Wiki</a> einzulesen. Die <a href="https://freedesktop.org/wiki/Software/systemd/">Dokumentation für systemd</a> kann hilfreich sein, um die Funktionsweise der von yavdr-ansible eingerichteten Dienste nachvollziehen zu können.
Auch für den VDR und für KODI kann an dieser Stelle nicht jedes Detail erklärt werden - gute Anlaufstellen für weiterführende Informationen sind das <a href="http://vdr-wiki.de/">VDR-Wiki</a> und das <a href="http://kodi.wiki/view/Main_Page">KODI-Wiki</a>.
Wann immer die Beschreibung von Befehlen, Funktionen oder Abläufen den Rahmen dieser Dokumentation sprengen würde, wird daher auf weiterführendes Material verlinkt. Auch Doppelungen werden nach Möglichkeit vermieden und stattdessen auf die entsprechende Stelle in der Dokumentation verlinkt.
</p>
</div>
</div>
<div id="outline-container-zur-syntax" class="outline-3">
<h3 id="zur-syntax">Zur Syntax</h3>
<div class="outline-text-3" id="text-zur-syntax">
<p>
Befehle, die man in der Shell ausführen kann, sehen so aus:
</p>
<pre class="example" id="orgb2a2620">
$ echo "Hallo, Welt!"
Hallo, Welt!
$ sudo -i  # erlange eine root-Shell
# whoami
root
</pre>
<p>
Ein <code>$</code> ist dabei der Prompt für einen normalen Nutzer (wie er bei der Installation angelegt wurde) und ein <code>#</code> der Prompt für den Benutzer <b>root</b>. Der Prompt wird nicht mit eingegeben, um einen Befehl auszuführen. In dem Fall würde man also <code>echo "Hallo, Welt!"</code> eingeben. Die Ausgaben des Befehl erscheinen vor dem nächsten Prompt (in dem Fall in Zeile 2 und 5)
</p>

<p>
Code im Dokument wird nach Möglichkeit mit Syntax-Highlighting dargestellt, also z.B.:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/env python3</span>
<span class="org-keyword">print</span>(<span class="org-string">"Hallo, Welt"</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-installation" class="outline-2">
<h2 id="installation"><span class="section-number-2">1.</span> Installation</h2>
<div class="outline-text-2" id="text-installation">
</div>
<div id="outline-container-system-requirements" class="outline-3">
<h3 id="system-requirements"><span class="section-number-3">1.1.</span> Systemvoraussetzungen</h3>
<div class="outline-text-3" id="text-system-requirements">
<ul class="org-ul">
<li>Eine von Ubuntu unterstützte x86-kompatible CPU (muss aktuell mindestens i686 kompatibel sein). Falls von der CPU unterstützt, wird eine 64-Bit Installation empfohlen.  32-Bit Installationen wurden nicht getestet.</li>
<li>Für die Root-Partition (<code>/</code>) werden mindestens 8 GB empfohlen, bei einer großen Mediensammlung mit KODI mindestens 32 GB. Eine SSD für die Systempartition kann die Boot-Zeit spürbar verringern.</li>
<li>Eine swap-Partition wird bei mehr als 2 GB Arbeitsspeicher nicht zwingend benötigt. Sie sollte mindestens so groß wie der Arbeitsspeicher sein, um den Ruhezustand nutzen zu können.</li>
<li>Der Mountpoint für <code>/srv</code> sollte eine eigene Partition bekommen. Da für Aufnahmen von SD-TV bis zu ca. 3 GB/s und für HD-TV bis zu 9 GB pro Stunde an Daten geschrieben werden können, sollte sie ausreichend dimensioniert werden. Falls Aufnahmen und andere Medien gesammelt werden, ist eine Platte mit einer Größe von mehr als einem Terabyte sinnvoll.</li>
</ul>
</div>
<div id="outline-container-org1ba245c" class="outline-4">
<h4 id="org1ba245c"><span class="section-number-4">1.1.1.</span> für die Nutzung als HTPC</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
yaVDR 0.7 ist für die Nutzung mit VDPAU-fähigen NVidia-Grafikkarten und Intel IGPs ausgelegt. Für eine experimentelle Unterstützung für Grafikkarten von AMD werden Tester mit geeigneter Hardware gesucht.
</p>
</div>
</div>
<div id="outline-container-org55f5a14" class="outline-4">
<h4 id="org55f5a14"><span class="section-number-4">1.1.2.</span> Nutzung als Server</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Ab yaVDR 0.7 besteht die Möglichkeit auf die Installation der GUI-Komponenten zu verzichten und es als Backend-Server zu betreiben.
In dem Fall wird keine Grafikkarte für die hardwarebeschleunigte Ausgabe benötigt. In Verbindung mit einem Sat&gt;IP Server könnte man den Server in einer Virtuellen Maschine betreiben.
</p>
</div>
</div>
</div>
<div id="outline-container-ubuntu-installation" class="outline-3">
<h3 id="ubuntu-installation"><span class="section-number-3">1.2.</span> Installation des Basissystems</h3>
<div class="outline-text-3" id="text-ubuntu-installation">
<p>
Da es in der Vergangenheit immer wieder Kompatibilitätsprobleme durch die angepassten yaVDR Installation-Images gab, gehen wir bei yaVDR 0.7 einen anderen Weg:
</p>

<p>
Zunächst wird eine Ubuntu Server Installation (wichtig: bei Ubuntu 18.04 die ISOs für den alternative Ubuntu Server Installer nutzen, damit Bootsplash, X-Server und Abhängigkeiten zu bestehenden Netzwerkverbindungen korrekt funktionieren und nicht durch das cloud-init Paket aus dem Tritt gebracht werden) durchgeführt, bei der der Nutzer beliebige Point-Releases (und damit neuere Kernel) wählen kann. Danach besteht die Möglichkeit zusätzliche Treiber zu installieren und die Netzwerkverbindung zu konfigurieren.
</p>

<p>
Nachdem die Grundinstallation abgeschlossen wurde, wird mit Hilfe von <a href="https://docs.ansible.com/ansible/latest/index.html">Ansible</a> das System als yaVDR-Installation konfiguriert. Der interessierte Nutzer hat die Möglichkeit die Installationsskripte selbst anzupassen - damit wird es deutlich leichter zusätzliche Paketquellen einzubinden und das System reproduzierbar auf die eigenen Bedürfnisse angepasst vorkonfigurieren zu lassen.
</p>
</div>
