yaVDR07_documentation.org
*** Download des Ubuntu Server ISO
:PROPERTIES:
:CUSTOM_ID: iso-download
:END:
Das Installations-ISO für den Ubuntu Server 20.04 kann von der offiziellen Ubuntu-Webseite heruntergeladen werden: https://releases.ubuntu.com/20.04/ 

Das ISO lässt sich auf eine DVD brennen (für normale CD-Rohlinge ist das Image zu groß) oder mit einem Tool wie [[https://wiki.ubuntuusers.de/dd/#Live-USB-Stick-erstellen][dd]] auf einen USB-Stick schreiben. Ein Netboot ist ebenfalls möglich:  https://discourse.ubuntu.com/t/netbooting-the-live-server-installer/14510

Ubuntu Server 18.04 wird mit Einschränkungen unterstützt (es sollte dabei unbedingt der klassische Installer genutzt werden) und spiegelt im Wesentlichen einen früheren Entwicklungsstand wieder.
*** TODO Installation von Ubuntu Server
:PROPERTIES:
:CUSTOM_ID: ubuntu-server-install
:END:

** Installation von yaVDR mit Ansible
:PROPERTIES:
:CUSTOM_ID: ansible-installation
:END:
*** Herunterladen von yavdr-ansible
:PROPERTIES:
:CUSTOM_ID: playbook-git
:END:
Die Ansible-Playbook-Sammlung für yaVDR kann so heruntergeladen werden:
#+BEGIN_src text
$ sudo apt install git
$ git clone https://github.com/yavdr/yavdr-ansible
$ cd yavdr-ansible
#+END_src

Die Dateien für Ubuntu 20.04 befinden sich im Zweig =focal=, der automatisch aktiv sein sollte (kann man z.B. mit =git status= überprüfen), die Dateien für Ubuntu 18.04 befinden sich im Branch =bionic=. Um gezielt zu dem Branch zu wechseln kann man den Befehl =git checkout bionic= nutzen.

Um später den aktuellsten Stand für den aktuell aktiven Branch aus den Repository zu holen, kann man den Befehl ~git pull~ nutzen.
*** Anpassen der Vorkonfiguration
Interessierte Nutzer haben die Möglichkeit die von yavdr-ansible umgesetzte Systemkonfiguration auf die eigenen Vorlieben und Gegebenheiten anzupassen.

Nicht benötigte Rollen können im Playbook (~yavdr07.yml~ bzw. ~yavdr07-headless.yml~) auskommentiert werden und Rollen, die keine automatische Hardwareerkennung nutzen (wie z.B. ~serial-ir~ und ~epgd)~ können bei Bedarf aktiviert werden.

Um in ~group_vars/all~ definierte Variablen anzupassen, sollte man eine Datei ~host_vars/localhost~ anlegen und darin die gewünschten Anpassungen vornehmen. Die in dieser Datei definierten Variablen übersteuern die Vorgabewerte aus dem Playbook und der ~group_vars/all~.

**** genutzte PPAs
Statt der in der =groups_vars/all= vorgegebenen PPAs können beliebige Paketquellen genutzt werden (solange diese die benötigten Pakete enthalten).

Standardmäßig werden die PPAs  ~ppa:yavdr/experimentai-main~, ~ppa:yavdr/experimental-vdr~ sowie ~ppa:yavdr/experimental-kodi~ genutzt:
#+begin_src yaml
branch: experimental
ppa_owner: 'ppa:yavdr'
# add the following PPAs
repositories:
  - '{{ ppa_owner }}/{{branch}}-main'
  - '{{ ppa_owner }}/{{branch}}-vdr'
  - '{{ ppa_owner }}/{{branch}}-kodi'
#+end_src

Möchte man stattdessen z.B. ein PPA für den VDR 2.4.5 mit Patches für das dynamite-Plugin nutzen, könnte man in einer ~host_vars/localhost~ z.B. folgende Änderung vornehmen:
#+begin_src yaml
repositories:
  - '{{ ppa_owner }}/{{branch}}-main'
  - 'ppa:seahawk1986-hotmail/vdr-2.4.5-patches'
  - '{{ ppa_owner }}/{{branch}}-kodi'
#+end_src

Wichtig: Das Playbook entfernt einmal hinzugefügte Paketquellen nicht automatisch - man muss also immer dafür sorgen, dass nur die gewünschten Paketquellen aktiv sind. Das Entfernen von PPAs und den daraus installierten Paketen (ggf. mit Downgrade auf ältere Paketversionen) ist z.B. mit dem Tool [[https://wiki.ubuntuusers.de/Paketquellen_freischalten/PPA/#PPA-Purgehttps://wiki.ubuntuusers.de/Paketquellen_freischalten/PPA/#PPA-Purge][ppa-purge]] möglich.

**** Sprache und Zeitzone
Da der Live-Installer für Ubuntu Server 20.04 die Locale- und Zeitzoneneinstellungen nicht mehr automatisch setzt, läuft ein frisch installiertes System in der Zeitzone UTC und mit der Locale =en_US.UTF-8=. Das Playbook setzt standardmäßig die Zeitzone =Europe/Berlin= und die Standard-Locale =de_DE.UTF-8=.

Diese Einstellungen können über die folgenden Variablen in der ==host_vars/localhost= angepasst werden - in der Voreinstellung sieht das so aus:
#+begin_src yaml
timezone: 'Europe/Berlin'
default_locale: 'de_DE.UTF-8'
generate_locales:  # see entries in /etc/locale.gen
  - 'de_DE.UTF-8 UTF-8'
  - 'en_US.UTF-8 UTF-8'
language_packs:
  - language-pack-de
  - language-pack-en
#+end_src
**** Spezielle Rollen
:PROPERTIES:
:CUSTOM_ID: special-roles
:END:
***** serial-ir
:PROPERTIES:
:CUSTOM_ID: serial-ir-role
:END:
Für serielle Empfänger (wie z.B. beim Atric V5) sollte im Playbook die Rolle ~serial-ir~ einkommentiert werden. Standardmäßig wird die erste serielle Schnittstelle genutzt (~/dev/ttyS0~ aka COM1). Ist der Empfänger an der zweiten seriellen Schnittstelle angeschlossen, muss in der ~host_vars/localhost~ die Variable ~serial_ir_device~ entsprechend angepasst werden:
#+begin_src yaml
serial_ir_device: ttyS1
#+end_src
***** epgd
:PROPERTIES:
:CUSTOM_ID: epgd-role
:END:
Wird diese Rolle im Playbook einkommentiert, richtet yavdr-ansible den vdr-epgd-daemon inkl. MariaDB-Datenbank ein und installiert das ~vdr-plugin-epg2vdr~.
