yaVDR07_documentation.html

<div id="outline-container-iso-download" class="outline-4">
<h4 id="iso-download"><span class="section-number-4">1.2.1.</span> Download des Ubuntu Server ISO</h4>
<div class="outline-text-4" id="text-iso-download">
<p>
Das Installations-ISO für den Ubuntu Server 20.04 kann von der offiziellen Ubuntu-Webseite heruntergeladen werden: <a href="https://releases.ubuntu.com/20.04/">https://releases.ubuntu.com/20.04/</a> 
</p>

<p>
Das ISO lässt sich auf eine DVD brennen (für normale CD-Rohlinge ist das Image zu groß) oder mit einem Tool wie <a href="https://wiki.ubuntuusers.de/dd/#Live-USB-Stick-erstellen">dd</a> auf einen USB-Stick schreiben. Ein Netboot ist ebenfalls möglich:  <a href="https://discourse.ubuntu.com/t/netbooting-the-live-server-installer/14510">https://discourse.ubuntu.com/t/netbooting-the-live-server-installer/14510</a>
</p>

<p>
Ubuntu Server 18.04 wird mit Einschränkungen unterstützt (es sollte dabei unbedingt der klassische Installer genutzt werden) und spiegelt im Wesentlichen einen früheren Entwicklungsstand wieder.
</p>
</div>
</div>
<div id="outline-container-ubuntu-server-install" class="outline-4">
<h4 id="ubuntu-server-install"><span class="section-number-4">1.2.2.</span> <span class="todo TODO">TODO</span> Installation von Ubuntu Server</h4>
<div class="outline-text-4" id="text-ubuntu-server-install">
</div>
</div>
</div>

<div id="outline-container-ansible-installation" class="outline-3">
<h3 id="ansible-installation"><span class="section-number-3">1.3.</span> Installation von yaVDR mit Ansible</h3>
<div class="outline-text-3" id="text-ansible-installation">
</div>
<div id="outline-container-playbook-git" class="outline-4">
<h4 id="playbook-git"><span class="section-number-4">1.3.1.</span> Herunterladen von yavdr-ansible</h4>
<div class="outline-text-4" id="text-playbook-git">
<p>
Die Ansible-Playbook-Sammlung für yaVDR kann so heruntergeladen werden:
</p>
<div class="org-src-container">
<pre class="src src-text">$ sudo apt install git
$ git clone https://github.com/yavdr/yavdr-ansible
$ cd yavdr-ansible
</pre>
</div>

<p>
Die Dateien für Ubuntu 20.04 befinden sich im Zweig <code>focal</code>, der automatisch aktiv sein sollte (kann man z.B. mit <code>git status</code> überprüfen), die Dateien für Ubuntu 18.04 befinden sich im Branch <code>bionic</code>. Um gezielt zu dem Branch zu wechseln kann man den Befehl <code>git checkout bionic</code> nutzen.
</p>

<p>
Um später den aktuellsten Stand für den aktuell aktiven Branch aus den Repository zu holen, kann man den Befehl <code>git pull</code> nutzen.
</p>
</div>
</div>
<div id="outline-container-org8858fbc" class="outline-4">
<h4 id="org8858fbc"><span class="section-number-4">1.3.2.</span> Anpassen der Vorkonfiguration</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Interessierte Nutzer haben die Möglichkeit die von yavdr-ansible umgesetzte Systemkonfiguration auf die eigenen Vorlieben und Gegebenheiten anzupassen.
</p>

<p>
Nicht benötigte Rollen können im Playbook (<code>yavdr07.yml</code> bzw. <code>yavdr07-headless.yml</code>) auskommentiert werden und Rollen, die keine automatische Hardwareerkennung nutzen (wie z.B. <code>serial-ir</code> und <code>epgd)</code> können bei Bedarf aktiviert werden.
</p>

<p>
Um in <code>group_vars/all</code> definierte Variablen anzupassen, sollte man eine Datei <code>host_vars/localhost</code> anlegen und darin die gewünschten Anpassungen vornehmen. Die in dieser Datei definierten Variablen übersteuern die Vorgabewerte aus dem Playbook und der <code>group_vars/all</code>.
</p>
</div>

<ol class="org-ol">
<li><a id="org550d0f1"></a>genutzte PPAs<br />
<div class="outline-text-5" id="text-1-3-2-1">
<p>
Statt der in der <code>groups_vars/all</code> vorgegebenen PPAs können beliebige Paketquellen genutzt werden (solange diese die benötigten Pakete enthalten).
</p>

<p>
Standardmäßig werden die PPAs  <code>ppa:yavdr/experimentai-main</code>, <code>ppa:yavdr/experimental-vdr</code> sowie <code>ppa:yavdr/experimental-kodi</code> genutzt:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">branch</span>: experimental
<span class="org-variable-name">ppa_owner</span>: <span class="org-string">'ppa:yavdr'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">add the following PPAs</span>
<span class="org-variable-name">repositories</span>:
  - <span class="org-string">'</span><span class="org-builtin">{{</span><span class="org-function-name"> ppa_owner </span><span class="org-builtin">}}</span><span class="org-string">/</span><span class="org-builtin">{{</span><span class="org-function-name">branch</span><span class="org-builtin">}}</span><span class="org-string">-main'</span>
  - <span class="org-string">'</span><span class="org-builtin">{{</span><span class="org-function-name"> ppa_owner </span><span class="org-builtin">}}</span><span class="org-string">/</span><span class="org-builtin">{{</span><span class="org-function-name">branch</span><span class="org-builtin">}}</span><span class="org-string">-vdr'</span>
  - <span class="org-string">'</span><span class="org-builtin">{{</span><span class="org-function-name"> ppa_owner </span><span class="org-builtin">}}</span><span class="org-string">/</span><span class="org-builtin">{{</span><span class="org-function-name">branch</span><span class="org-builtin">}}</span><span class="org-string">-kodi'</span>
</pre>
</div>

<p>
Möchte man stattdessen z.B. ein PPA für den VDR 2.4.5 mit Patches für das dynamite-Plugin nutzen, könnte man in einer <code>host_vars/localhost</code> z.B. folgende Änderung vornehmen:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">repositories</span>:
  - <span class="org-string">'</span><span class="org-builtin">{{</span><span class="org-function-name"> ppa_owner </span><span class="org-builtin">}}</span><span class="org-string">/</span><span class="org-builtin">{{</span><span class="org-function-name">branch</span><span class="org-builtin">}}</span><span class="org-string">-main'</span>
  - <span class="org-string">'ppa:seahawk1986-hotmail/vdr-2.4.5-patches'</span>
  - <span class="org-string">'</span><span class="org-builtin">{{</span><span class="org-function-name"> ppa_owner </span><span class="org-builtin">}}</span><span class="org-string">/</span><span class="org-builtin">{{</span><span class="org-function-name">branch</span><span class="org-builtin">}}</span><span class="org-string">-kodi'</span>
</pre>
</div>

<p>
Wichtig: Das Playbook entfernt einmal hinzugefügte Paketquellen nicht automatisch - man muss also immer dafür sorgen, dass nur die gewünschten Paketquellen aktiv sind. Das Entfernen von PPAs und den daraus installierten Paketen (ggf. mit Downgrade auf ältere Paketversionen) ist z.B. mit dem Tool <a href="https://wiki.ubuntuusers.de/Paketquellen_freischalten/PPA/#PPA-Purgehttps://wiki.ubuntuusers.de/Paketquellen_freischalten/PPA/%23PPA-Purge">ppa-purge</a> möglich.
</p>
</div>
</li>

<li><a id="org1fe262f"></a>Sprache und Zeitzone<br />
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Da der Live-Installer für Ubuntu Server 20.04 die Locale- und Zeitzoneneinstellungen nicht mehr automatisch setzt, läuft ein frisch installiertes System in der Zeitzone UTC und mit der Locale <code>en_US.UTF-8</code>. Das Playbook setzt standardmäßig die Zeitzone <code>Europe/Berlin</code> und die Standard-Locale <code>de_DE.UTF-8</code>.
</p>

<p>
Diese Einstellungen können über die folgenden Variablen in der <code>=host_vars/localhost</code> angepasst werden - in der Voreinstellung sieht das so aus:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">timezone</span>: <span class="org-string">'Europe/Berlin'</span>
<span class="org-variable-name">default_locale</span>: <span class="org-string">'de_DE.UTF-8'</span>
<span class="org-variable-name">generate_locales</span>:  <span class="org-comment-delimiter"># </span><span class="org-comment">see entries in /etc/locale.gen</span>
  - <span class="org-string">'de_DE.UTF-8 UTF-8'</span>
  - <span class="org-string">'en_US.UTF-8 UTF-8'</span>
<span class="org-variable-name">language_packs</span>:
  - language-pack-de
  - language-pack-en
</pre>
</div>
</div>
</li>
<li><a id="special-roles"></a>Spezielle Rollen<br />
<div class="outline-text-5" id="text-special-roles">
</div>
<ol class="org-ol">
<li><a id="serial-ir-role"></a>serial-ir<br />
<div class="outline-text-6" id="text-serial-ir-role">
<p>
Für serielle Empfänger (wie z.B. beim Atric V5) sollte im Playbook die Rolle <code>serial-ir</code> einkommentiert werden. Standardmäßig wird die erste serielle Schnittstelle genutzt (<code>/dev/ttyS0</code> aka COM1). Ist der Empfänger an der zweiten seriellen Schnittstelle angeschlossen, muss in der <code>host_vars/localhost</code> die Variable <code>serial_ir_device</code> entsprechend angepasst werden:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">serial_ir_device</span>: ttyS1
</pre>
</div>
</div>
</li>
<li><a id="epgd-role"></a>epgd<br />
<div class="outline-text-6" id="text-epgd-role">
<p>
Wird diese Rolle im Playbook einkommentiert, richtet yavdr-ansible den vdr-epgd-daemon inkl. MariaDB-Datenbank ein und installiert das <code>vdr-plugin-epg2vdr</code>.
</p>
</div>
</li>
