yaVDR07_documentation.org
***** install-sundtek
:PROPERTIES:
:CUSTOM_ID: install-sundtek-role
:END:

Für Sundtek-Tuner sollte im Playbook die Rolle =install-sundtek= einkommentiert werden. Diese Rolle richtet die Sundtek-Treiber und eine ~sundtek.service~ ein.

Über die Konfiguration in der =host_vars/localhost= kann festgelegt werden, ob die Treiber auch installiert werden sollen, wenn kein lokal angeschlossener Stick erkannt wurde (=sundtek.force_install=) und ob der Start des VDR verzögert werden soll bis
 - lokal angeschlossene Sundtek-Tuner initialisiert wurden (=sundtek.wait_for_devices=) - falls das nicht auf =true= gesetzt wird, werden die Pakete =vdr-plugin-sundtek= und =vdr-plugin-dynamite= installiert
 - das Netzwerk verfügbar ist (=sundtek.wait_for_network=)

#+begin_src yaml
sundtek:
  force_install: false
  wait_for_devices: true
  wait_for_network: false
#+end_src

**** Templates
:PROPERTIES:
:CUSTOM_ID: jinja2-templates
:END:
Gegenüber früheren yaVDR-Versionen kommt eine neue Template-Engine ([[http://jinja.palletsprojects.com/][jinja2]]) zum Einsatz. Templates werden beim Ausführen der im Playbook konfigurierten Rollen expandiert.
*** Ausführen der Installationsskripte
:PROPERTIES:
:CUSTOM_ID: install-scripts
:END:
Um yaVDR mit dem vorgegebenen Playbook einzurichten, ruft man danach folgenden Befehl auf:
#+BEGIN_EXAMPLE
$ sudo -H ./install-yavdr.sh
#+END_EXAMPLE
Will man nur eine Server-Installation ohne GUI, ruft man dieses Skript auf:
#+BEGIN_EXAMPLE
$ sudo -H ./install-yavdr-headless.sh
#+END_EXAMPLE

** Erste Schritte nach der Installation
:PROPERTIES:
:CUSTOM_ID: first-steps
:END:
*** Kanalliste hinterlegen
:PROPERTIES:
:CUSTOM_ID: channel-list
:END:
Damit der VDR Sender empfangen kann, benötigt er eine =/var/lib/vdr/channels.conf= (diese Datei sollte dem Nutzer und der Gruppe =vdr= gehören).

Bevor man Änderungen an der Kanalliste vornimmt oder eine Kanalsuche mit einem Programm wie w_scan, t2scan usw. startet, muss der VDR gestoppt werden:
#+begin_example
systemctl stop vdr
#+end_example

Um an eine Kanalliste zu kommen, gibt es mehrere Möglichkeiten:
**** Kanallisten aus der channelpedia
:PROPERTIES:
:CUSTOM_ID: channel-list-channelpedia
:END:
Die [[https://channelpedia.yavdr.com/gen/][Channelpedia]] bietet eine Sammlung von Kanallisten für die gängigen Satellitenpositionen, Kabelnetze und den terrestrischen Empfang.
**** Kanalsuche mit w_scan
:PROPERTIES:
:CUSTOM_ID: channel-search-w-scan
:END:
[[https://wiki.ubuntuusers.de/w_scan/][w_scan]] erlaubt die Kanalsuche mit Tunern für DVB-S(2), DVB-C und DVB-T. Für DVB-T2 funktioniert das nachfolgend beschriebene t2scan besser.

#+CAPTION: Beispiel für die Kanalsuche für DVB-C in Deutschland
#+begin_example
$ sudo w_scan -c de -f c > channels.conf
#+end_example
**** Kanalsuche mit t2scan
:PROPERTIES:
:CUSTOM_ID: channel-search-t2scan
:END:
[[https://github.com/mighty-p/t2scan][t2scan]] ist speziell dafür ausgelegt nach DVB-T(2) Kanälen zu suchen.

#+CAPTION: Beispielaufruf von t2scan
#+begin_example
$ sudo t2scan > channels.conf
#+end_example
* Grundlegendes zum System
:PROPERTIES:
:CUSTOM_ID: system-basics
:END:

Dieser Abschnitt ist insbesondere für Leser gedacht, die noch nicht besonders viel Erfahrung damit haben ein Linux-System über eine Shell zu administrieren.
** SSH
:PROPERTIES:
:CUSTOM_ID: ssh
:END:

yavdr-ansible installiert einen SSH-Server, der es erlaubt sich von einem anderen Rechner aus auf dem System einzuloggen. Weiterführende Informationen gibt es im [[https://wiki.ubuntuusers.de/SSH/][Wiki-Artikel zu SSH]].

** Mit erhöhten Rechten Arbeiten
:PROPERTIES:
:CUSTOM_ID: root-permissions
:END:
Bei Ubuntu ist der Login für den Benutzer ~root~ standardmäßig deaktiviert (man kann das ändern, indem man für ~root~ ein Passwort vergibt, für den Zugriff über SSH als ~root~ muss außerdem die Konfiguration des SSH-Server angepasst werden). Man kann als Mitglied in der Gruppe ~sudo~ (der bei der Installation angelegte Nutzer ist standardmäßig Mitglied in dieser Gruppe) mit dem gleichnamigen Befehl erhöhte Rechte erlangen: https://wiki.ubuntuusers.de/sudo/
** Editoren
:PROPERTIES:
:CUSTOM_ID: editors
:END:
Um Dateien bearbeiten zu können, sollte man mit einem [[https://wiki.ubuntuusers.de/Editor/#Kommandozeile][Editor]] umgehen können. Für Einsteiger bietet sich das vorinstallierte [[https://wiki.ubuntuusers.de/Nano/][nano]] an. Das Programm [[https://wiki.ubuntuusers.de/mit_Root-Rechten_arbeiten/#sudoedit][sudoedit]] kann genutzt werden, um Dateien mit root-Rechten zu bearbeiten.
** Paketverwaltung
:PROPERTIES:
:CUSTOM_ID: package-management
:END:
Ubuntu nutzt ~apt~ für die Paketverwaltung. Im Ubuntu Users Wiki findet sich alles wissenswerte [[https://wiki.ubuntuusers.de/Paketverwaltung/][zum Thema Paketverwaltung]].

Die am häufigsten genutzten Befehle sind:
#+begin_EXAMPLE
# Paketquellen neu einlesen
sudo apt update
# alle Pakete aktualisieren
sudo apt full-upgrade
# ein einzelnes Paket installieren
sudo apt install vdr-plugin-live
# mehrere Pakete installieren
sudo apt install vdr-plugin-epgsearch vdr-plugin-streamdev-server
# Pakete entfernen
sudo apt remove PAKETNAME [PAKETNAME_2 ..]
# PPA hinzufügen
sudo add-apt-repository ppa:seahawk1986-hotmail/vdr-2.4.0
#+end_EXAMPLE
*** Updates Einspielen
:PROPERTIES:
:CUSTOM_ID: apt-updates
:END:
Neben den Sicherheitsupdates, die für Ubuntu ausgeliefert werden (z.B. für Samba, Firefox, SSH usw.), versuchen wir yaVDR ständig zu verbessern und veröffentlichen daher häufiger Updates für VDR- und KODI-Pakete, Plugins, Addons, Skripte und Templates.

Gerade bevor man darüber nachdenkt eine Support-Anfrage im Forum (http://www.vdr-portal.de/) zu stellen, sollte man überprüfen, ob der Fehler auch nach dem Einspielen der aktuellen Updates und einem anschließenden Neustart noch auftritt. Dieses Vorgehen reduziert auch den Support-Aufwand für das yaVDR-Team.

Man kann Updates entweder über Ansible anstoßen oder sie von Hand so einspielen:
#+BEGIN_EXAMPLE
$ sudo apt update && sudo apt full-upgrade
#+END_EXAMPLE
Alternativ kann auch apt-get genutzt werden:
#+BEGIN_EXAMPLE
$ sudo apt-get update && sudo apt-get dist-upgrade
#+END_EXAMPLE

Wenn apt nachfragt, ob Konfigurationsdateien überschrieben werden sollen, empfiehlt es sich zunächst die Unterschiede anzeigen zu lassen und dann zu entscheiden, ob ein händisches Zusammenführen oder das Beibehalten der aktuellen Konfiguration (oder in seltenen Fällen die Übernahme der neuen Datei) sinnvoll ist.

Wenn die Updates über Ansible erfolgen, werden die Konfigurationsdateien automatisch auf den in den Ansible-Rollen vorgesehenen Stand gebracht.
