yaVDR07_documentation.html
<li><a id="install-sundtek-role"></a>install-sundtek<br />
<div class="outline-text-6" id="text-install-sundtek-role">
<p>
Für Sundtek-Tuner sollte im Playbook die Rolle <code>install-sundtek</code> einkommentiert werden. Diese Rolle richtet die Sundtek-Treiber und eine <code>sundtek.service</code> ein.
</p>

<p>
Über die Konfiguration in der <code>host_vars/localhost</code> kann festgelegt werden, ob die Treiber auch installiert werden sollen, wenn kein lokal angeschlossener Stick erkannt wurde (<code>sundtek.force_install</code>) und ob der Start des VDR verzögert werden soll bis
</p>
<ul class="org-ul">
<li>lokal angeschlossene Sundtek-Tuner initialisiert wurden (<code>sundtek.wait_for_devices</code>) - falls das nicht auf <code>true</code> gesetzt wird, werden die Pakete <code>vdr-plugin-sundtek</code> und <code>vdr-plugin-dynamite</code> installiert</li>
<li>das Netzwerk verfügbar ist (<code>sundtek.wait_for_network</code>)</li>
</ul>

<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">sundtek</span>:
  <span class="org-variable-name">force_install</span>: <span class="org-constant">false</span>
  <span class="org-variable-name">wait_for_devices</span>: <span class="org-constant">true</span>
  <span class="org-variable-name">wait_for_network</span>: <span class="org-constant">false</span>
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="jinja2-templates"></a>Templates<br />
<div class="outline-text-5" id="text-jinja2-templates">
<p>
Gegenüber früheren yaVDR-Versionen kommt eine neue Template-Engine (<a href="http://jinja.palletsprojects.com/">jinja2</a>) zum Einsatz. Templates werden beim Ausführen der im Playbook konfigurierten Rollen expandiert.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-install-scripts" class="outline-4">
<h4 id="install-scripts"><span class="section-number-4">1.3.3.</span> Ausführen der Installationsskripte</h4>
<div class="outline-text-4" id="text-install-scripts">
<p>
Um yaVDR mit dem vorgegebenen Playbook einzurichten, ruft man danach folgenden Befehl auf:
</p>
<pre class="example" id="orga3a19a0">
$ sudo -H ./install-yavdr.sh
</pre>
<p>
Will man nur eine Server-Installation ohne GUI, ruft man dieses Skript auf:
</p>
<pre class="example" id="orgb16e09d">
$ sudo -H ./install-yavdr-headless.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-first-steps" class="outline-3">
<h3 id="first-steps"><span class="section-number-3">1.4.</span> Erste Schritte nach der Installation</h3>
<div class="outline-text-3" id="text-first-steps">
</div>
<div id="outline-container-channel-list" class="outline-4">
<h4 id="channel-list"><span class="section-number-4">1.4.1.</span> Kanalliste hinterlegen</h4>
<div class="outline-text-4" id="text-channel-list">
<p>
Damit der VDR Sender empfangen kann, benötigt er eine <code>/var/lib/vdr/channels.conf</code> (diese Datei sollte dem Nutzer und der Gruppe <code>vdr</code> gehören).
</p>

<p>
Bevor man Änderungen an der Kanalliste vornimmt oder eine Kanalsuche mit einem Programm wie w_scan, t2scan usw. startet, muss der VDR gestoppt werden:
</p>
<pre class="example" id="org1b36855">
systemctl stop vdr
</pre>

<p>
Um an eine Kanalliste zu kommen, gibt es mehrere Möglichkeiten:
</p>
</div>
<ol class="org-ol">
<li><a id="channel-list-channelpedia"></a>Kanallisten aus der channelpedia<br />
<div class="outline-text-5" id="text-channel-list-channelpedia">
<p>
Die <a href="https://channelpedia.yavdr.com/gen/">Channelpedia</a> bietet eine Sammlung von Kanallisten für die gängigen Satellitenpositionen, Kabelnetze und den terrestrischen Empfang.
</p>
</div>
</li>
<li><a id="channel-search-w-scan"></a>Kanalsuche mit w_scan<br />
<div class="outline-text-5" id="text-channel-search-w-scan">
<p>
<a href="https://wiki.ubuntuusers.de/w_scan/">w_scan</a> erlaubt die Kanalsuche mit Tunern für DVB-S(2), DVB-C und DVB-T. Für DVB-T2 funktioniert das nachfolgend beschriebene t2scan besser.
</p>

<pre class="example" id="orgc70b23e">
$ sudo w_scan -c de -f c &gt; channels.conf
</pre>
</div>
</li>
<li><a id="channel-search-t2scan"></a>Kanalsuche mit t2scan<br />
<div class="outline-text-5" id="text-channel-search-t2scan">
<p>
<a href="https://github.com/mighty-p/t2scan">t2scan</a> ist speziell dafür ausgelegt nach DVB-T(2) Kanälen zu suchen.
</p>

<pre class="example" id="org256731c">
$ sudo t2scan &gt; channels.conf
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-system-basics" class="outline-2">
<h2 id="system-basics"><span class="section-number-2">2.</span> Grundlegendes zum System</h2>
<div class="outline-text-2" id="text-system-basics">
<p>
Dieser Abschnitt ist insbesondere für Leser gedacht, die noch nicht besonders viel Erfahrung damit haben ein Linux-System über eine Shell zu administrieren.
</p>
</div>
<div id="outline-container-ssh" class="outline-3">
<h3 id="ssh"><span class="section-number-3">2.1.</span> SSH</h3>
<div class="outline-text-3" id="text-ssh">
<p>
yavdr-ansible installiert einen SSH-Server, der es erlaubt sich von einem anderen Rechner aus auf dem System einzuloggen. Weiterführende Informationen gibt es im <a href="https://wiki.ubuntuusers.de/SSH/">Wiki-Artikel zu SSH</a>.
</p>
</div>
</div>

<div id="outline-container-root-permissions" class="outline-3">
<h3 id="root-permissions"><span class="section-number-3">2.2.</span> Mit erhöhten Rechten Arbeiten</h3>
<div class="outline-text-3" id="text-root-permissions">
<p>
Bei Ubuntu ist der Login für den Benutzer <code>root</code> standardmäßig deaktiviert (man kann das ändern, indem man für <code>root</code> ein Passwort vergibt, für den Zugriff über SSH als <code>root</code> muss außerdem die Konfiguration des SSH-Server angepasst werden). Man kann als Mitglied in der Gruppe <code>sudo</code> (der bei der Installation angelegte Nutzer ist standardmäßig Mitglied in dieser Gruppe) mit dem gleichnamigen Befehl erhöhte Rechte erlangen: <a href="https://wiki.ubuntuusers.de/sudo/">https://wiki.ubuntuusers.de/sudo/</a>
</p>
</div>
</div>
<div id="outline-container-editors" class="outline-3">
<h3 id="editors"><span class="section-number-3">2.3.</span> Editoren</h3>
<div class="outline-text-3" id="text-editors">
<p>
Um Dateien bearbeiten zu können, sollte man mit einem <a href="https://wiki.ubuntuusers.de/Editor/#Kommandozeile">Editor</a> umgehen können. Für Einsteiger bietet sich das vorinstallierte <a href="https://wiki.ubuntuusers.de/Nano/">nano</a> an. Das Programm <a href="https://wiki.ubuntuusers.de/mit_Root-Rechten_arbeiten/#sudoedit">sudoedit</a> kann genutzt werden, um Dateien mit root-Rechten zu bearbeiten.
</p>
</div>
</div>
<div id="outline-container-package-management" class="outline-3">
<h3 id="package-management"><span class="section-number-3">2.4.</span> Paketverwaltung</h3>
<div class="outline-text-3" id="text-package-management">
<p>
Ubuntu nutzt <code>apt</code> für die Paketverwaltung. Im Ubuntu Users Wiki findet sich alles wissenswerte <a href="https://wiki.ubuntuusers.de/Paketverwaltung/">zum Thema Paketverwaltung</a>.
</p>

<p>
Die am häufigsten genutzten Befehle sind:
</p>
<pre class="example" id="orge209884">
# Paketquellen neu einlesen
sudo apt update
# alle Pakete aktualisieren
sudo apt full-upgrade
# ein einzelnes Paket installieren
sudo apt install vdr-plugin-live
# mehrere Pakete installieren
sudo apt install vdr-plugin-epgsearch vdr-plugin-streamdev-server
# Pakete entfernen
sudo apt remove PAKETNAME [PAKETNAME_2 ..]
# PPA hinzufügen
sudo add-apt-repository ppa:seahawk1986-hotmail/vdr-2.4.0
</pre>
</div>
<div id="outline-container-apt-updates" class="outline-4">
<h4 id="apt-updates"><span class="section-number-4">2.4.1.</span> Updates Einspielen</h4>
<div class="outline-text-4" id="text-apt-updates">
<p>
Neben den Sicherheitsupdates, die für Ubuntu ausgeliefert werden (z.B. für Samba, Firefox, SSH usw.), versuchen wir yaVDR ständig zu verbessern und veröffentlichen daher häufiger Updates für VDR- und KODI-Pakete, Plugins, Addons, Skripte und Templates.
</p>

<p>
Gerade bevor man darüber nachdenkt eine Support-Anfrage im Forum (<a href="http://www.vdr-portal.de/">http://www.vdr-portal.de/</a>) zu stellen, sollte man überprüfen, ob der Fehler auch nach dem Einspielen der aktuellen Updates und einem anschließenden Neustart noch auftritt. Dieses Vorgehen reduziert auch den Support-Aufwand für das yaVDR-Team.
</p>

<p>
Man kann Updates entweder über Ansible anstoßen oder sie von Hand so einspielen:
</p>
<pre class="example" id="orgd93e3a3">
$ sudo apt update &amp;&amp; sudo apt full-upgrade
</pre>
<p>
Alternativ kann auch apt-get genutzt werden:
</p>
<pre class="example" id="org68d2634">
$ sudo apt-get update &amp;&amp; sudo apt-get dist-upgrade
</pre>

<p>
Wenn apt nachfragt, ob Konfigurationsdateien überschrieben werden sollen, empfiehlt es sich zunächst die Unterschiede anzeigen zu lassen und dann zu entscheiden, ob ein händisches Zusammenführen oder das Beibehalten der aktuellen Konfiguration (oder in seltenen Fällen die Übernahme der neuen Datei) sinnvoll ist.
</p>

<p>
Wenn die Updates über Ansible erfolgen, werden die Konfigurationsdateien automatisch auf den in den Ansible-Rollen vorgesehenen Stand gebracht.
</p>
</div>
</div>
