yaVDR07_documentation.org
*** Entfernen ungenutzter Pakete und alter Kernel
Um nicht mehr benötigte Pakete und Kernel-Versionen zu entfernen, kann dieser Befehl genutzt werden (Ubuntu behält dabei die drei aktuellsten Kernel-Pakete):
#+BEGIN_EXAMPLE
$ sudo apt autoremove --purge
#+END_EXAMPLE
** Dienste
:PROPERTIES:
:CUSTOM_ID: systemd-services
:END:
Seit Ubuntu 16.04 setzt Ubuntu auf Systemd (https://www.freedesktop.org/wiki/Software/systemd/) als Init-System, das bis Ubuntu 14.04 genutzte Upstart wurde entfernt und dafür geschriebene Units müssen portiert werden. Systemd bietet eine eingeschränkte Abwärtskompatibilität zu SysV-Init: https://www.freedesktop.org/wiki/Software/systemd/Incompatibilities/
*** systemctl
:PROPERTIES:
:CUSTOM_ID: systemctl
:END:
[[https://www.freedesktop.org/software/systemd/man/systemctl.html][systemctl]] erlaubt es Systemd Units zu steuern. Die wichtigsten Befehle sind:

#+begin_EXAMPLE
# Status einer Unit anzeigen
systemctl status vdr
# Unit starten
systemctl start vdr
# Unit neu starten
systemctl restart vdr
# Unit stoppen
systemctl stop vdr
# Unit deaktivieren (wird nicht mehr automatisch beim Booten gestartet)
systemctl disable vdr
# Unit aktivieren (wird gemäß ihres Install Abschitts automatisch beim Booten gestartet
systemctl enable vdr
# Unit maskieren (kann weder automatisch noch von Hand gestartet werden)
systemctl mask vdr
#+end_EXAMPLE

** Logdateien
:PROPERTIES:
:CUSTOM_ID: logfiles
:END:
Bei Ubuntu 18.04 ist sowohl rsyslog als auch journald vorinstalliert. Die von rsyslog verwalteten Logdateien liegen wie gewohnt in ~/var/log/~.

Zusätzlich kann man journalctl nutzen, um auf das von journald verwaltete Log zuzugreifen, z.B.:
#+begin_src
# Logausgaben der Unit vdr.service beobachten
journalctl -u vdr -fl
# Logausgaben seit dem Booten anzeigen
journalctl -b
# Logausgaben der letzten 10 Minuten anzeigen
journalctl -l --since=-10m
#+end_src

Journald legt in der Vorkonfiguration keine persistenten Logdateien an. Dieses Verhalten kann wie in [[https://wiki.ubuntuusers.de/systemd/journald/#Speichereinstellung-fuer-das-Journal-aendern][Speichereinstellungen für journald]] beschrieben geändert werden.

**** Logeinträge filtern mit rsyslog
:PROPERTIES:
:CUSTOM_ID: rsyslog-filtering
:END:

rsyslog bietet die Möglichkeit Logeinträge nach Ursprung, Priorität oder Inhalt zu filtern.

Um z.B. alle Logmeldungen mit dem String ="dvb_frontend_get_frequency_limits"= zu verwerfen, könnte man eine =/etc/rsyslog.d/10-ignore.conf= mit dem folgenden Inhalt anlegen:
#+begin_src conf
:msg,contains,"dvb_frontend_get_frequency_limits" ~
#+end_src
** Audioausgabe
:PROPERTIES:
:CUSTOM_ID: audio-output
:END:
Standardmäßig erfolgt die Audioausgabe über pulseaudio, um auch die Nutzung von Anwendungen zu ermöglichen, die keine Soundausgabe über Alsa beherrschen. Mit Ausnahmen einiger moderner Formate wie TrueHD or DTS-MA können Bitstream-Formate an den Receiver durchgereicht werden ("Passthrough"), so dass dieser die Dekodierung übernehmen kann.

In [[https://kodi.wiki/view/PulseAudio]] wird u.a. die Konfiguration von Pulseaudio bei Nutzung in Verbindung mit Mehrkanalreceivern beschrieben.

Bei Bedarf kann Pulseaudio vorübergehend oder komplett deaktiviert werden, um die Soundkarte für Programme freizugeben, die direkt mittels Alsa darauf zugreifen sollen.

*** Pulseaudio vorübergehend deaktivieren
Pulseaudio kann mit Hilfe von ~pasuspender~ vorübergehend deaktiviert werden, solange das Zielprogramm läuft - z.B. für KODI:
#+begin_example
pasuspender -- env AE_SINK=ALSA kodi
#+end_example
Da sich der VDR mit softhddevice (oder einem der davon abgeleiteten Plugins, die keine eigenständigen Programme für die Ausgabe bereitstellen) nicht sinnvoll mit dem ~pasuspender~ wrappen lässt, wenn man zwischendurch Pulseaudio-Programme nutzen will, kann in diesem Fall auf ~yavdr-pasuspend~ zurückgegriffen werden:
#+begin_example
yavdr-pasuspend -s # pausiere Pulseaudio
yavdr-pasuspend -r # reaktiviere Pulseaudio
#+end_example
Das yavdr-frontend ermöglicht es pulseaudio automatisch zu pausieren, wenn softhddevice (oder ein davon abgeleitetes Ausgabeplugin) aktiv ist - dazu muss in der ~/etc/yavdr-frontend/config.yml~ beim Eintrag für das jeweilige Frontend (vdr -> frontends) die Option ~use_pasuspend: true~ gesetzt werden.

In dem Fall muss die Audiokonfiguration für das Ausgabeplugin für die gewünschten Alsa-Geräte angepasst werden.

Wichtig: Beim suspend von Pulseaudio frieren Pulseaudio-Clients mit aktiver Soundausgabe ein, bis der Suspend wieder aufgehoben wird.
*** Pulseaudio komplett deaktivieren
:PROPERTIES:
:CUSTOM_ID: pulse-disable-permanently
:END:
Um Pulseaudio komplett zu deaktivieren, kann man in der ~/var/lib/vdr/.config/pulse/daemon.conf~ verhindern, dass der Dienst automatisch gestartet wird:
#+begin_src conf
autospawn = no
#+end_src

Nicht vergessen die Audiokonfiguration für das Ausgabeplugin auf die gewünschten Alsa-Geräte anzupassen!
*** Pulseaudio Nutzung von Alsa-Gerät erzwingen
:PROPERTIES:
:CUSTOM_ID: pulse-force-alsa
:END:
Um die Nutzung von bestimmten Alsa-Geräten durch Pulseaudio zu erzwingen kann wie in https://wiki.archlinux.org/index.php/PulseAudio/Examples#Manually_configuring_PulseAudio_to_detect_the_Nvidia_HDMI beschrieben ein Pulseaudio-Sink mit einem Alsa-Gerät verknüpft werden:
#+begin_src conf
load-module module-alsa-sink device=hw:1,7
#+end_src
* Fernbedienungen
:PROPERTIES:
:CUSTOM_ID: remotes
:END:
yavdr-ansible nutzt [[https://github.com/OpenELEC/eventlircd][eventlircd]], um Signale von Fernbedienungsempfängern an den VDR, KODI, irexec und andere Lirc-Clients weiter zureichen.

~eventlircd~ kann die Tastendrücke von Kernel Input Devices (wie sie für rc-core Geräte, HID-Geräte, virtuelle Eingabegeräte, die mittels uinput usw. angelegt werden) über udev-Regeln identifizieren und exklusiv öffnen. Tastatur-Tastendrücke werden auf einem lircd-kompatiblen Sockel (~/run/lirc/lircd~) ausgegeben, Maustastendrücke auf einem mittels uinput angelegten Virtuellen Kernel Input Device weitergereicht.

Da eventlircd keine Abhängigkeiten zu bereits initialisierter Hardware hat, kann der Dienst frühzeitig gestartet werden, ohne den Bootvorgang zu verzögern - die Empfänger werden dynamisch eingebunden, sobald sie verfügbar sind.

Alle Fernbedienungen sollten das vereinheitlichte Schema für Tastennamen nutzen, damit die von ihnen gesendeten Tastendrücke zur Vorkonfiguration der Fernbedienung für den VDR, KODI und andere Programme passen, wie in der Tabelle [[yavdr-keynames]["Vereinheitlichtes Schema für Tastennamen"]] gezeigt.

