yaVDR07_documentation.html
<div id="outline-container-orgd25d991" class="outline-4">
<h4 id="orgd25d991"><span class="section-number-4">2.4.2.</span> Entfernen ungenutzter Pakete und alter Kernel</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Um nicht mehr benötigte Pakete und Kernel-Versionen zu entfernen, kann dieser Befehl genutzt werden (Ubuntu behält dabei die drei aktuellsten Kernel-Pakete):
</p>
<pre class="example" id="org91242c7">
$ sudo apt autoremove --purge
</pre>
</div>
</div>
</div>
<div id="outline-container-systemd-services" class="outline-3">
<h3 id="systemd-services"><span class="section-number-3">2.5.</span> Dienste</h3>
<div class="outline-text-3" id="text-systemd-services">
<p>
Seit Ubuntu 16.04 setzt Ubuntu auf Systemd (<a href="https://www.freedesktop.org/wiki/Software/systemd/">https://www.freedesktop.org/wiki/Software/systemd/</a>) als Init-System, das bis Ubuntu 14.04 genutzte Upstart wurde entfernt und dafür geschriebene Units müssen portiert werden. Systemd bietet eine eingeschränkte Abwärtskompatibilität zu SysV-Init: <a href="https://www.freedesktop.org/wiki/Software/systemd/Incompatibilities/">https://www.freedesktop.org/wiki/Software/systemd/Incompatibilities/</a>
</p>
</div>
<div id="outline-container-systemctl" class="outline-4">
<h4 id="systemctl"><span class="section-number-4">2.5.1.</span> systemctl</h4>
<div class="outline-text-4" id="text-systemctl">
<p>
<a href="https://www.freedesktop.org/software/systemd/man/systemctl.html">systemctl</a> erlaubt es Systemd Units zu steuern. Die wichtigsten Befehle sind:
</p>

<pre class="example" id="orgb596fdf">
# Status einer Unit anzeigen
systemctl status vdr
# Unit starten
systemctl start vdr
# Unit neu starten
systemctl restart vdr
# Unit stoppen
systemctl stop vdr
# Unit deaktivieren (wird nicht mehr automatisch beim Booten gestartet)
systemctl disable vdr
# Unit aktivieren (wird gemäß ihres Install Abschitts automatisch beim Booten gestartet
systemctl enable vdr
# Unit maskieren (kann weder automatisch noch von Hand gestartet werden)
systemctl mask vdr
</pre>
</div>
</div>
</div>

<div id="outline-container-logfiles" class="outline-3">
<h3 id="logfiles"><span class="section-number-3">2.6.</span> Logdateien</h3>
<div class="outline-text-3" id="text-logfiles">
<p>
Bei Ubuntu 18.04 ist sowohl rsyslog als auch journald vorinstalliert. Die von rsyslog verwalteten Logdateien liegen wie gewohnt in <code>/var/log/</code>.
</p>

<p>
Zusätzlich kann man journalctl nutzen, um auf das von journald verwaltete Log zuzugreifen, z.B.:
</p>
<pre class="example">
# Logausgaben der Unit vdr.service beobachten
journalctl -u vdr -fl
# Logausgaben seit dem Booten anzeigen
journalctl -b
# Logausgaben der letzten 10 Minuten anzeigen
journalctl -l --since=-10m
</pre>

<p>
Journald legt in der Vorkonfiguration keine persistenten Logdateien an. Dieses Verhalten kann wie in <a href="https://wiki.ubuntuusers.de/systemd/journald/#Speichereinstellung-fuer-das-Journal-aendern">Speichereinstellungen für journald</a> beschrieben geändert werden.
</p>
</div>

<ol class="org-ol">
<li><a id="rsyslog-filtering"></a>Logeinträge filtern mit rsyslog<br />
<div class="outline-text-5" id="text-rsyslog-filtering">
<p>
rsyslog bietet die Möglichkeit Logeinträge nach Ursprung, Priorität oder Inhalt zu filtern.
</p>

<p>
Um z.B. alle Logmeldungen mit dem String <code>"dvb_frontend_get_frequency_limits"</code> zu verwerfen, könnte man eine <code>/etc/rsyslog.d/10-ignore.conf</code> mit dem folgenden Inhalt anlegen:
</p>
<div class="org-src-container">
<pre class="src src-conf">:msg,contains,<span class="org-string">"dvb_frontend_get_frequency_limits"</span> ~
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-audio-output" class="outline-3">
<h3 id="audio-output"><span class="section-number-3">2.7.</span> Audioausgabe</h3>
<div class="outline-text-3" id="text-audio-output">
<p>
Standardmäßig erfolgt die Audioausgabe über pulseaudio, um auch die Nutzung von Anwendungen zu ermöglichen, die keine Soundausgabe über Alsa beherrschen. Mit Ausnahmen einiger moderner Formate wie TrueHD or DTS-MA können Bitstream-Formate an den Receiver durchgereicht werden (&bdquo;Passthrough&ldquo;), so dass dieser die Dekodierung übernehmen kann.
</p>

<p>
In <a href="https://kodi.wiki/view/PulseAudio">https://kodi.wiki/view/PulseAudio</a> wird u.a. die Konfiguration von Pulseaudio bei Nutzung in Verbindung mit Mehrkanalreceivern beschrieben.
</p>

<p>
Bei Bedarf kann Pulseaudio vorübergehend oder komplett deaktiviert werden, um die Soundkarte für Programme freizugeben, die direkt mittels Alsa darauf zugreifen sollen.
</p>
</div>

<div id="outline-container-org415ea7f" class="outline-4">
<h4 id="org415ea7f"><span class="section-number-4">2.7.1.</span> Pulseaudio vorübergehend deaktivieren</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Pulseaudio kann mit Hilfe von <code>pasuspender</code> vorübergehend deaktiviert werden, solange das Zielprogramm läuft - z.B. für KODI:
</p>
<pre class="example" id="org401426d">
pasuspender -- env AE_SINK=ALSA kodi
</pre>
<p>
Da sich der VDR mit softhddevice (oder einem der davon abgeleiteten Plugins, die keine eigenständigen Programme für die Ausgabe bereitstellen) nicht sinnvoll mit dem <code>pasuspender</code> wrappen lässt, wenn man zwischendurch Pulseaudio-Programme nutzen will, kann in diesem Fall auf <code>yavdr-pasuspend</code> zurückgegriffen werden:
</p>
<pre class="example" id="org9d5f0e7">
yavdr-pasuspend -s # pausiere Pulseaudio
yavdr-pasuspend -r # reaktiviere Pulseaudio
</pre>
<p>
Das yavdr-frontend ermöglicht es pulseaudio automatisch zu pausieren, wenn softhddevice (oder ein davon abgeleitetes Ausgabeplugin) aktiv ist - dazu muss in der <code>/etc/yavdr-frontend/config.yml</code> beim Eintrag für das jeweilige Frontend (vdr -&gt; frontends) die Option <code>use_pasuspend: true</code> gesetzt werden.
</p>

<p>
In dem Fall muss die Audiokonfiguration für das Ausgabeplugin für die gewünschten Alsa-Geräte angepasst werden.
</p>

<p>
Wichtig: Beim suspend von Pulseaudio frieren Pulseaudio-Clients mit aktiver Soundausgabe ein, bis der Suspend wieder aufgehoben wird.
</p>
</div>
</div>
<div id="outline-container-pulse-disable-permanently" class="outline-4">
<h4 id="pulse-disable-permanently"><span class="section-number-4">2.7.2.</span> Pulseaudio komplett deaktivieren</h4>
<div class="outline-text-4" id="text-pulse-disable-permanently">
<p>
Um Pulseaudio komplett zu deaktivieren, kann man in der <code>/var/lib/vdr/.config/pulse/daemon.conf</code> verhindern, dass der Dienst automatisch gestartet wird:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">autospawn</span> = no
</pre>
</div>

<p>
Nicht vergessen die Audiokonfiguration für das Ausgabeplugin auf die gewünschten Alsa-Geräte anzupassen!
</p>
</div>
</div>
<div id="outline-container-pulse-force-alsa" class="outline-4">
<h4 id="pulse-force-alsa"><span class="section-number-4">2.7.3.</span> Pulseaudio Nutzung von Alsa-Gerät erzwingen</h4>
<div class="outline-text-4" id="text-pulse-force-alsa">
<p>
Um die Nutzung von bestimmten Alsa-Geräten durch Pulseaudio zu erzwingen kann wie in <a href="https://wiki.archlinux.org/index.php/PulseAudio/Examples#Manually_configuring_PulseAudio_to_detect_the_Nvidia_HDMI">https://wiki.archlinux.org/index.php/PulseAudio/Examples#Manually_configuring_PulseAudio_to_detect_the_Nvidia_HDMI</a> beschrieben ein Pulseaudio-Sink mit einem Alsa-Gerät verknüpft werden:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">load-module module-alsa-sink device</span>=hw:1,7
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-remotes" class="outline-2">
<h2 id="remotes"><span class="section-number-2">3.</span> Fernbedienungen</h2>
<div class="outline-text-2" id="text-remotes">
<p>
yavdr-ansible nutzt <a href="https://github.com/OpenELEC/eventlircd">eventlircd</a>, um Signale von Fernbedienungsempfängern an den VDR, KODI, irexec und andere Lirc-Clients weiter zureichen.
</p>

<p>
<code>eventlircd</code> kann die Tastendrücke von Kernel Input Devices (wie sie für rc-core Geräte, HID-Geräte, virtuelle Eingabegeräte, die mittels uinput usw. angelegt werden) über udev-Regeln identifizieren und exklusiv öffnen. Tastatur-Tastendrücke werden auf einem lircd-kompatiblen Sockel (<code>/run/lirc/lircd</code>) ausgegeben, Maustastendrücke auf einem mittels uinput angelegten Virtuellen Kernel Input Device weitergereicht.
</p>

<p>
Da eventlircd keine Abhängigkeiten zu bereits initialisierter Hardware hat, kann der Dienst frühzeitig gestartet werden, ohne den Bootvorgang zu verzögern - die Empfänger werden dynamisch eingebunden, sobald sie verfügbar sind.
</p>

<p>
Alle Fernbedienungen sollten das vereinheitlichte Schema für Tastennamen nutzen, damit die von ihnen gesendeten Tastendrücke zur Vorkonfiguration der Fernbedienung für den VDR, KODI und andere Programme passen, wie in der Tabelle <a href="#org44f9603">&bdquo;Vereinheitlichtes Schema für Tastennamen&ldquo;</a> gezeigt.
</p>
</div>
