yaVDR07_documentation.org
** Vereinheitlichtes Schema für Tastennamen
:PROPERTIES:
:CUSTOM_ID: yavdr-namespace
:END:
#+CAPTION: Vereinheitlichtes Schema für Tastennamen
#+NAME: yavdr-keynames
| Tastenname Eventlircd | remote.conf      | Beschreibung                                         |
|-----------------------+------------------+------------------------------------------------------|
| KEY_UP                | LIRC.Up          | Nach oben                                            |
| KEY_DOWN              | LIRC.Down        | Nach unten                                           |
| KEY_MENU              | LIRC.Menu        | Menü                                                 |
| KEY_OK                | LIRC.Ok          | OK/Eingabe                                           |
| KEY_ESC               | LIRC.Back        | Zurück                                               |
| KEY_LEFT              | LIRC.Left        | Nach links                                           |
| KEY_RIGHT             | LIRC.Right       | Nach rechts                                          |
| KEY_RED               | LIRC.Red         | Rot                                                  |
| KEY_GREEN             | LIRC.Green       | Grün                                                 |
| KEY_YELLOW            | LIRC.Yellow      | Gelb                                                 |
| KEY_BLUE              | LIRC.Blue        | Blau                                                 |
| KEY_0                 | LIRC.0           | Ziffer 0                                             |
| KEY_1                 | LIRC.1           | Ziffer 1                                             |
| KEY_2                 | LIRC.2           | Ziffer 2                                             |
| KEY_3                 | LIRC.3           | Ziffer 3                                             |
| KEY_4                 | LIRC.4           | Ziffer 4                                             |
| KEY_5                 | LIRC.5           | Ziffer 5                                             |
| KEY_6                 | LIRC.6           | Ziffer 6                                             |
| KEY_7                 | LIRC.7           | Ziffer 7                                             |
| KEY_8                 | LIRC.8           | Ziffer 8                                             |
| KEY_9                 | LIRC.9           | Ziffer 9                                             |
| KEY_INFO              | LIRC.Info        | Info zum aktuellen Objekt                            |
| KEY_PLAY              | LIRC.Play        | Play                                                 |
| KEY_PAUSE             | LIRC.Pause       | Pause                                                |
| KEY_PLAYPAUSE         | LIRC.Play/Pause  | Kombinierte Taste für Play und Pause                 |
| KEY_STOP              | LIRC.Stop        | Stop                                                 |
| KEY_RECORD            | LIRC.Record      | Aufnehmen                                            |
| KEY_FASTFORWARD       | LIRC.FastFwd     | Vorspulen                                            |
| KEY_REWIND            | LIRC.FastRew     | Zurückspulen                                         |
| KEY_NEXT              | LIRC.Next        | Vorwärts springen                                    |
| KEY_BACK              | LIRC.Prev        | Rückwärts springen                                   |
| KEY_POWER2            | LIRC.Power       | Ausschalten                                          |
| KEY_CHANNELUP         | LIRC.Channel+    | Kanal hoch                                           |
| KEY_CHANNELDOWN       | LIRC.Channel-    | Kanal runter                                         |
| KEY_PREVIOUS          | LIRC.PrevChannel | zurück zum zuvor gewählten Kanal                     |
| KEY_VOLUMEUP          | LIRC.Volume+     | Lautstärke erhöhen                                   |
| KEY_VOLUMEDOWN        | LIRC.Volume-     | Lautstärke verringern                                |
| KEY_MUTE              | LIRC.Mute        | Stummschalten                                        |
| KEY_SUBTITLE          | LIRC.Subtitles   | Untertitel einblenden                                |
| KEY_EPG               | LIRC.Schedule    | Programmführer                                       |
| KEY_CHANNEL           | LIRC.Channels    | Kanäle                                               |
| KEY_FAVORITES         | LIRC.Commands    | Befehlsauswahl                                       |
| KEY_MODE              | LIRC.Audio       | Tonspur wählen                                       |
| KEY_TIME              | LIRC.Timers      | gesetzte Timer                                       |
| KEY_PVR               | LIRC.Recordings  | Aufnahmen                                            |
| KEY_SETUP             | LIRC.Setup       | Setup-Menü                                           |
| KEY_TEXT              | LIRC.User0       | aktiviert Teletext bei installiertem teletext-plugin |
| KEY_PROG1             | LIRC.User1       | User-Taste, z.B. für Keymakros                       |
| KEY_PROG2             | LIRC.User2       | User-Taste, z.B. für Keymakros                       |
| KEY_PROG3             | LIRC.User3       | User-Taste, z.B. für Keymakros                       |
| KEY_PROG4             | LIRC.User4       | User-Taste, z.B. für Keymakros                       |
| KEY_AUDIO             | LIRC.User5       | User-Taste, z.B. für Keymakros                       |
| KEY_VIDEO             | LIRC.User6       | User-Taste, z.B. für Keymakros                       |
| KEY_IMAGES            | LIRC.User7       | User-Taste, z.B. für Keymakros                       |
| KEY_FN                | LIRC.User8       | User-Taste, z.B. für Keymakros                       |
| KEY_SCREEN            | LIRC.User9       | User-Taste, z.B. für Keymakros                       |
** ir-keytable
:PROPERTIES:
:CUSTOM_ID: ir-keytable
:END:
Das Programm =ir-keytable= kann genutzt werden, um rc-core Geräte zu testen und zu konfigurieren. Damit =ir-keytable= Zugriff auf die Geräte hat, muss [[#eventlircd-specialities][eventlircd zuvor gestoppt werden]].

#+CAPTION: Anzeigen der verfügbaren rc-core Empfänger mit ir-keytable
#+begin_example
$ sudo ir-keytable
/sys/class/rc/rc0/ gefunden (/dev/input/event4) mit:
    Name: Nuvoton w836x7hg Infrared Remote Transceiver
    Treiber: nuvoton-cir, Tabelle: rc-rc6-mce
    Lirc Gerät: /dev/lirc0
    unterstützte Protokolle: lirc rc-5 rc-5-sz jvc sony nec sanyo mce_kbd rc-6 sharp xmp
    Aktivierte Protokolle: lirc rc-6
    bus: 25, Anbieter/Produkt: 1050:00b4, Version: 0x0073
    Wiederholungsverzögerung = 500 ms, Wiederholungsperiode = 125 ms
#+end_example
