yaVDR07_documentation.html

<div id="outline-container-yavdr-namespace" class="outline-3">
<h3 id="yavdr-namespace"><span class="section-number-3">3.1.</span> Vereinheitlichtes Schema für Tastennamen</h3>
<div class="outline-text-3" id="text-yavdr-namespace">
<table id="org44f9603" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabelle 1</span> Vereinheitlichtes Schema für Tastennamen</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tastenname Eventlircd</th>
<th scope="col" class="org-left">remote.conf</th>
<th scope="col" class="org-left">Beschreibung</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">KEY_UP</td>
<td class="org-left">LIRC.Up</td>
<td class="org-left">Nach oben</td>
</tr>

<tr>
<td class="org-left">KEY_DOWN</td>
<td class="org-left">LIRC.Down</td>
<td class="org-left">Nach unten</td>
</tr>

<tr>
<td class="org-left">KEY_MENU</td>
<td class="org-left">LIRC.Menu</td>
<td class="org-left">Menü</td>
</tr>

<tr>
<td class="org-left">KEY_OK</td>
<td class="org-left">LIRC.Ok</td>
<td class="org-left">OK/Eingabe</td>
</tr>

<tr>
<td class="org-left">KEY_ESC</td>
<td class="org-left">LIRC.Back</td>
<td class="org-left">Zurück</td>
</tr>

<tr>
<td class="org-left">KEY_LEFT</td>
<td class="org-left">LIRC.Left</td>
<td class="org-left">Nach links</td>
</tr>

<tr>
<td class="org-left">KEY_RIGHT</td>
<td class="org-left">LIRC.Right</td>
<td class="org-left">Nach rechts</td>
</tr>

<tr>
<td class="org-left">KEY_RED</td>
<td class="org-left">LIRC.Red</td>
<td class="org-left">Rot</td>
</tr>

<tr>
<td class="org-left">KEY_GREEN</td>
<td class="org-left">LIRC.Green</td>
<td class="org-left">Grün</td>
</tr>

<tr>
<td class="org-left">KEY_YELLOW</td>
<td class="org-left">LIRC.Yellow</td>
<td class="org-left">Gelb</td>
</tr>

<tr>
<td class="org-left">KEY_BLUE</td>
<td class="org-left">LIRC.Blue</td>
<td class="org-left">Blau</td>
</tr>

<tr>
<td class="org-left">KEY_0</td>
<td class="org-left">LIRC.0</td>
<td class="org-left">Ziffer 0</td>
</tr>

<tr>
<td class="org-left">KEY_1</td>
<td class="org-left">LIRC.1</td>
<td class="org-left">Ziffer 1</td>
</tr>

<tr>
<td class="org-left">KEY_2</td>
<td class="org-left">LIRC.2</td>
<td class="org-left">Ziffer 2</td>
</tr>

<tr>
<td class="org-left">KEY_3</td>
<td class="org-left">LIRC.3</td>
<td class="org-left">Ziffer 3</td>
</tr>

<tr>
<td class="org-left">KEY_4</td>
<td class="org-left">LIRC.4</td>
<td class="org-left">Ziffer 4</td>
</tr>

<tr>
<td class="org-left">KEY_5</td>
<td class="org-left">LIRC.5</td>
<td class="org-left">Ziffer 5</td>
</tr>

<tr>
<td class="org-left">KEY_6</td>
<td class="org-left">LIRC.6</td>
<td class="org-left">Ziffer 6</td>
</tr>

<tr>
<td class="org-left">KEY_7</td>
<td class="org-left">LIRC.7</td>
<td class="org-left">Ziffer 7</td>
</tr>

<tr>
<td class="org-left">KEY_8</td>
<td class="org-left">LIRC.8</td>
<td class="org-left">Ziffer 8</td>
</tr>

<tr>
<td class="org-left">KEY_9</td>
<td class="org-left">LIRC.9</td>
<td class="org-left">Ziffer 9</td>
</tr>

<tr>
<td class="org-left">KEY_INFO</td>
<td class="org-left">LIRC.Info</td>
<td class="org-left">Info zum aktuellen Objekt</td>
</tr>

<tr>
<td class="org-left">KEY_PLAY</td>
<td class="org-left">LIRC.Play</td>
<td class="org-left">Play</td>
</tr>

<tr>
<td class="org-left">KEY_PAUSE</td>
<td class="org-left">LIRC.Pause</td>
<td class="org-left">Pause</td>
</tr>

<tr>
<td class="org-left">KEY_PLAYPAUSE</td>
<td class="org-left">LIRC.Play/Pause</td>
<td class="org-left">Kombinierte Taste für Play und Pause</td>
</tr>

<tr>
<td class="org-left">KEY_STOP</td>
<td class="org-left">LIRC.Stop</td>
<td class="org-left">Stop</td>
</tr>

<tr>
<td class="org-left">KEY_RECORD</td>
<td class="org-left">LIRC.Record</td>
<td class="org-left">Aufnehmen</td>
</tr>

<tr>
<td class="org-left">KEY_FASTFORWARD</td>
<td class="org-left">LIRC.FastFwd</td>
<td class="org-left">Vorspulen</td>
</tr>

<tr>
<td class="org-left">KEY_REWIND</td>
<td class="org-left">LIRC.FastRew</td>
<td class="org-left">Zurückspulen</td>
</tr>

<tr>
<td class="org-left">KEY_NEXT</td>
<td class="org-left">LIRC.Next</td>
<td class="org-left">Vorwärts springen</td>
</tr>

<tr>
<td class="org-left">KEY_BACK</td>
<td class="org-left">LIRC.Prev</td>
<td class="org-left">Rückwärts springen</td>
</tr>

<tr>
<td class="org-left">KEY_POWER2</td>
<td class="org-left">LIRC.Power</td>
<td class="org-left">Ausschalten</td>
</tr>

<tr>
<td class="org-left">KEY_CHANNELUP</td>
<td class="org-left">LIRC.Channel+</td>
<td class="org-left">Kanal hoch</td>
</tr>

<tr>
<td class="org-left">KEY_CHANNELDOWN</td>
<td class="org-left">LIRC.Channel-</td>
<td class="org-left">Kanal runter</td>
</tr>

<tr>
<td class="org-left">KEY_PREVIOUS</td>
<td class="org-left">LIRC.PrevChannel</td>
<td class="org-left">zurück zum zuvor gewählten Kanal</td>
</tr>

<tr>
<td class="org-left">KEY_VOLUMEUP</td>
<td class="org-left">LIRC.Volume+</td>
<td class="org-left">Lautstärke erhöhen</td>
</tr>

<tr>
<td class="org-left">KEY_VOLUMEDOWN</td>
<td class="org-left">LIRC.Volume-</td>
<td class="org-left">Lautstärke verringern</td>
</tr>

<tr>
<td class="org-left">KEY_MUTE</td>
<td class="org-left">LIRC.Mute</td>
<td class="org-left">Stummschalten</td>
</tr>

<tr>
<td class="org-left">KEY_SUBTITLE</td>
<td class="org-left">LIRC.Subtitles</td>
<td class="org-left">Untertitel einblenden</td>
</tr>

<tr>
<td class="org-left">KEY_EPG</td>
<td class="org-left">LIRC.Schedule</td>
<td class="org-left">Programmführer</td>
</tr>

<tr>
<td class="org-left">KEY_CHANNEL</td>
<td class="org-left">LIRC.Channels</td>
<td class="org-left">Kanäle</td>
</tr>

<tr>
<td class="org-left">KEY_FAVORITES</td>
<td class="org-left">LIRC.Commands</td>
<td class="org-left">Befehlsauswahl</td>
</tr>

<tr>
<td class="org-left">KEY_MODE</td>
<td class="org-left">LIRC.Audio</td>
<td class="org-left">Tonspur wählen</td>
</tr>

<tr>
<td class="org-left">KEY_TIME</td>
<td class="org-left">LIRC.Timers</td>
<td class="org-left">gesetzte Timer</td>
</tr>

<tr>
<td class="org-left">KEY_PVR</td>
<td class="org-left">LIRC.Recordings</td>
<td class="org-left">Aufnahmen</td>
</tr>

<tr>
<td class="org-left">KEY_SETUP</td>
<td class="org-left">LIRC.Setup</td>
<td class="org-left">Setup-Menü</td>
</tr>

<tr>
<td class="org-left">KEY_TEXT</td>
<td class="org-left">LIRC.User0</td>
<td class="org-left">aktiviert Teletext bei installiertem teletext-plugin</td>
</tr>

<tr>
<td class="org-left">KEY_PROG1</td>
<td class="org-left">LIRC.User1</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_PROG2</td>
<td class="org-left">LIRC.User2</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_PROG3</td>
<td class="org-left">LIRC.User3</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_PROG4</td>
<td class="org-left">LIRC.User4</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_AUDIO</td>
<td class="org-left">LIRC.User5</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_VIDEO</td>
<td class="org-left">LIRC.User6</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_IMAGES</td>
<td class="org-left">LIRC.User7</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_FN</td>
<td class="org-left">LIRC.User8</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>

<tr>
<td class="org-left">KEY_SCREEN</td>
<td class="org-left">LIRC.User9</td>
<td class="org-left">User-Taste, z.B. für Keymakros</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-ir-keytable" class="outline-3">
<h3 id="ir-keytable"><span class="section-number-3">3.2.</span> ir-keytable</h3>
<div class="outline-text-3" id="text-ir-keytable">
<p>
Das Programm <code>ir-keytable</code> kann genutzt werden, um rc-core Geräte zu testen und zu konfigurieren. Damit <code>ir-keytable</code> Zugriff auf die Geräte hat, muss <a href="#eventlircd-specialities">eventlircd zuvor gestoppt werden</a>.
</p>

<pre class="example" id="org1cc4a59">
$ sudo ir-keytable
/sys/class/rc/rc0/ gefunden (/dev/input/event4) mit:
    Name: Nuvoton w836x7hg Infrared Remote Transceiver
    Treiber: nuvoton-cir, Tabelle: rc-rc6-mce
    Lirc Gerät: /dev/lirc0
    unterstützte Protokolle: lirc rc-5 rc-5-sz jvc sony nec sanyo mce_kbd rc-6 sharp xmp
    Aktivierte Protokolle: lirc rc-6
    bus: 25, Anbieter/Produkt: 1050:00b4, Version: 0x0073
    Wiederholungsverzögerung = 500 ms, Wiederholungsperiode = 125 ms
</pre>
</div>
