yaVDR07_documentation.org
*** Anpassen der Tastenbelegung für rc-core Empfänger
:PROPERTIES:
:CUSTOM_ID: ir-keytable-customization
:END:
In der =/etc/rc_maps.cfg= können Regeln hinterlegt werden, für welche Kombination aus Treiber und Tabellen-Name welche Keytable geladen werden soll. Es zählt jeweils der erste Eintrag in der Datei für die angegebene Kombination.

#+CAPTION: Regel zum Laden der Keytable für den weiter oben gezeigten CIR-Empfänger
#+begin_src config
# driver	  table				  file
nuvoton-cir rc-rc6-mce          /lib/udev/rc_keymaps/rc-rc6-mce
#+end_src
**** Eigene Keytables erzeugen
:PROPERTIES:
:CUSTOM_ID: ir-keytable-create-keytables
:END:
Möchte man eine Fernbedienung mit einem anderen IR-Protokoll bzw. abweichenden Tastencodes nutzen, kann eine eigene Keytable dafür geladen werden.

Damit uneingeschränkter Zugriff auf den Empfänger möglich ist, sollten die Systemd-Units =eventlircd.socket= und =eventlircd.service= gestoppt sein:
#+begin_src shell
systemctl stop eventlircd.socket eventlircd.service
#+end_src

Um die Keytable erzeugen zu können, benötigt man als erstes das Protokoll, das die Fernbedienung nutzt, um Tastendrücke zu senden. Wenn es nicht bekannt ist, kann man versuchen den Empfänger mit allen unterstützten Protokollen zu betreiben:
#+begin_src shell
ir-keytable -c -p all -t
#+end_src

Aus der Ausgabe 

Mit =ir-keytable -p $PROTOKOL= kann man das gewünschte Protokoll für den Empfänger setzen und danach mit mit =ir-keytable -c= die aktuell geladene Keytable löschen. Mit =sudo ir-keytable -t= kann man sich jetzt die Scancodes für gedrückte Tasten anzeigen lassen und diese in einer Keytable dem gewünschten Tastennamen zuordnen.



***** Neue Syntax
:PROPERTIES:
:CUSTOM_ID: ir-keytable-create-keytables-new-syntax
:END:
ir-keytable hat ein neues Format für Keytables eingeführt - neben der alten Syntax wird jetzt auch das TOML-Format unterstützt - dabei werden wie in der Manpage beschrieben mindestens diese Abschnitte mit Feldern erwartet:
#+begin_src toml
[[protcols]]
name = "rc-rc6-mce"  # yaVDR-Convention: Tabellen-Name laut rc-core, Name darf aber beliebig gewählt werden
protocol = "rc-6"  # Protokoll laut rc-core
[protocols.scancodes]
0xdeadbeef = "KEY_COFFEE"
#+end_src

***** Alte Syntax
:PROPERTIES:
:CUSTOM_ID: ir-keytable-create-keytables-old-syntax
:END:
In der Ersten Zeile der Keytable sollte der vom Treiber vorgegebene Name der Keytable und das - oder falls gewünscht und vom Empfänger unterstützt die - gewünschten Protokolle angegeben werden und in den Folgenden Zeilen werden Scancode und Tastenname durch Whitespace getrennt angegeben - für den weiter oben genutzten CIR-Empfänger wäre das dann also z.B. für eine Fernbedienung mit =RC6= Protokoll:

#+begin_src example
# table rc-rc6-mce, type: RC6
0xdeadbeef KEY_COFFEE
#+end_src


***** Umstellung von lircd auf rc-core
:PROPERTIES:
:CUSTOM_ID: lircd-to-rc-core
:END:
Im Git-Repository der v4l-utils gibt es ein Skript, das dabei helfen kann eine bestehende lircd.conf in eine keymap (im TOML-Format) umzuwandeln: https://git.linuxtv.org/v4l-utils.git/tree/contrib/lircd2toml.py
