yaVDR07_documentation.html
<div id="outline-container-ir-keytable-customization" class="outline-4">
<h4 id="ir-keytable-customization"><span class="section-number-4">3.2.1.</span> Anpassen der Tastenbelegung für rc-core Empfänger</h4>
<div class="outline-text-4" id="text-ir-keytable-customization">
<p>
In der <code>/etc/rc_maps.cfg</code> können Regeln hinterlegt werden, für welche Kombination aus Treiber und Tabellen-Name welche Keytable geladen werden soll. Es zählt jeweils der erste Eintrag in der Datei für die angegebene Kombination.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Programmlisting 1 </span>Regel zum Laden der Keytable für den weiter oben gezeigten CIR-Empfänger</label><pre class="src src-config"># driver	  table				  file
nuvoton-cir rc-rc6-mce          /lib/udev/rc_keymaps/rc-rc6-mce
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="ir-keytable-create-keytables"></a>Eigene Keytables erzeugen<br />
<div class="outline-text-5" id="text-ir-keytable-create-keytables">
<p>
Möchte man eine Fernbedienung mit einem anderen IR-Protokoll bzw. abweichenden Tastencodes nutzen, kann eine eigene Keytable dafür geladen werden.
</p>

<p>
Damit uneingeschränkter Zugriff auf den Empfänger möglich ist, sollten die Systemd-Units <code>eventlircd.socket</code> und <code>eventlircd.service</code> gestoppt sein:
</p>
<div class="org-src-container">
<pre class="src src-shell">systemctl stop eventlircd.socket eventlircd.service
</pre>
</div>

<p>
Um die Keytable erzeugen zu können, benötigt man als erstes das Protokoll, das die Fernbedienung nutzt, um Tastendrücke zu senden. Wenn es nicht bekannt ist, kann man versuchen den Empfänger mit allen unterstützten Protokollen zu betreiben:
</p>
<div class="org-src-container">
<pre class="src src-shell">ir-keytable -c -p all -t
</pre>
</div>

<p>
Aus der Ausgabe 
</p>

<p>
Mit <code>ir-keytable -p $PROTOKOL</code> kann man das gewünschte Protokoll für den Empfänger setzen und danach mit mit <code>ir-keytable -c</code> die aktuell geladene Keytable löschen. Mit <code>sudo ir-keytable -t</code> kann man sich jetzt die Scancodes für gedrückte Tasten anzeigen lassen und diese in einer Keytable dem gewünschten Tastennamen zuordnen.
</p>
</div>



<ol class="org-ol">
<li><a id="ir-keytable-create-keytables-new-syntax"></a>Neue Syntax<br />
<div class="outline-text-6" id="text-ir-keytable-create-keytables-new-syntax">
<p>
ir-keytable hat ein neues Format für Keytables eingeführt - neben der alten Syntax wird jetzt auch das TOML-Format unterstützt - dabei werden wie in der Manpage beschrieben mindestens diese Abschnitte mit Feldern erwartet:
</p>
<div class="org-src-container">
<pre class="src src-toml">[[protcols]]
name = "rc-rc6-mce"  # yaVDR-Convention: Tabellen-Name laut rc-core, Name darf aber beliebig gewählt werden
protocol = "rc-6"  # Protokoll laut rc-core
[protocols.scancodes]
0xdeadbeef = "KEY_COFFEE"
</pre>
</div>
</div>
</li>

<li><a id="ir-keytable-create-keytables-old-syntax"></a>Alte Syntax<br />
<div class="outline-text-6" id="text-ir-keytable-create-keytables-old-syntax">
<p>
In der Ersten Zeile der Keytable sollte der vom Treiber vorgegebene Name der Keytable und das - oder falls gewünscht und vom Empfänger unterstützt die - gewünschten Protokolle angegeben werden und in den Folgenden Zeilen werden Scancode und Tastenname durch Whitespace getrennt angegeben - für den weiter oben genutzten CIR-Empfänger wäre das dann also z.B. für eine Fernbedienung mit <code>RC6</code> Protokoll:
</p>

<div class="org-src-container">
<pre class="src src-example"># table rc-rc6-mce, type: RC6
0xdeadbeef KEY_COFFEE
</pre>
</div>
</div>
</li>


<li><a id="lircd-to-rc-core"></a>Umstellung von lircd auf rc-core<br />
<div class="outline-text-6" id="text-lircd-to-rc-core">
<p>
Im Git-Repository der v4l-utils gibt es ein Skript, das dabei helfen kann eine bestehende lircd.conf in eine keymap (im TOML-Format) umzuwandeln: <a href="https://git.linuxtv.org/v4l-utils.git/tree/contrib/lircd2toml.py">https://git.linuxtv.org/v4l-utils.git/tree/contrib/lircd2toml.py</a>
</p>
</div>
</li>
