yaVDR07_documentation.html
<li><a id="rc-core-learn-keys"></a>Automatisiertes Anlernen von rc-core Empfängern<br />
<div class="outline-text-6" id="text-rc-core-learn-keys">
<p>
Um die Erstellung von Keytables zu vereinfachen, kann das folgende Python-Skript genutzt werden (benötigt das Paket <code>python3-evdev</code>) - die anzulernenden Tasten können in der Liste <code>BUTTONS</code> definiert werden:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> functools
<span class="org-keyword">import</span> contextlib
<span class="org-keyword">import</span> signal
<span class="org-keyword">import</span> sys
<span class="org-keyword">import</span> time
<span class="org-keyword">from</span> argparse <span class="org-keyword">import</span> ArgumentParser
<span class="org-keyword">from</span> pathlib <span class="org-keyword">import</span> Path
<span class="org-keyword">from</span> evdev <span class="org-keyword">import</span> InputDevice, ecodes

<span class="org-variable-name">BUTTONS</span> = [
        <span class="org-string">"KEY_OK"</span>,
        <span class="org-string">"KEY_UP"</span>,
        <span class="org-string">"KEY_DOWN"</span>,
        <span class="org-string">"KEY_LEFT"</span>,
        <span class="org-string">"KEY_RIGHT"</span>,
        ]

<span class="org-variable-name">RC_SYS_DEVICES</span> = Path(<span class="org-string">'/sys/class/rc/'</span>)
<span class="org-variable-name">DEVPATH</span> = Path(<span class="org-string">'/dev'</span>)
<span class="org-variable-name">debug</span> = functools.partial(<span class="org-keyword">print</span>, <span class="org-builtin">file</span>=sys.stderr)


<span class="org-keyword">def</span> <span class="org-function-name">print_keymap</span>(keytable, protocol, keys):
    <span class="org-keyword">print</span>(<span class="org-string">"[[protocols]]"</span>)
    <span class="org-keyword">print</span>(f<span class="org-string">'name = "{keytable}"'</span>)
    <span class="org-keyword">print</span>(f<span class="org-string">'protocol = "{protocol}"'</span>)
    <span class="org-keyword">print</span>(<span class="org-string">'[protocols.scancodes]'</span>)
    <span class="org-keyword">for</span> keyname, scancode <span class="org-keyword">in</span> keys.items():
        <span class="org-keyword">print</span>(f<span class="org-string">'{scancode:#06x} = "{keyname}"'</span>)


<span class="org-keyword">def</span> <span class="org-function-name">read_from_device</span>(dev, keytable, protocol):
    <span class="org-keyword">def</span> <span class="org-function-name">btn_generator</span>():
        <span class="org-keyword">for</span> btn <span class="org-keyword">in</span> BUTTONS:
            <span class="org-keyword">yield</span> btn
        <span class="org-keyword">while</span> <span class="org-constant">True</span>:
            <span class="org-keyword">yield</span> <span class="org-constant">None</span>

    <span class="org-variable-name">btn_gen</span> = btn_generator()

    <span class="org-variable-name">keymap</span> = {}
    <span class="org-variable-name">last_scancode</span> = <span class="org-constant">None</span>
    <span class="org-variable-name">last_ts</span> = <span class="org-builtin">float</span>(<span class="org-string">'inf'</span>)

    <span class="org-variable-name">button</span> = <span class="org-builtin">next</span>(btn_gen)
    <span class="org-variable-name">first_btn</span> = button
    <span class="org-keyword">with</span> contextlib.closing(InputDevice(dev)) <span class="org-keyword">as</span> dev:
        debug(f<span class="org-string">"Please press a button for {button}"</span>)

        <span class="org-keyword">for</span> ev <span class="org-keyword">in</span> dev.read_loop():
            <span class="org-variable-name">advance_button</span> = <span class="org-constant">False</span>
            <span class="org-keyword">if</span> ev.<span class="org-builtin">type</span> == ecodes.EV_MSC:
                <span class="org-variable-name">ts</span> = ev.timestamp()
                <span class="org-keyword">if</span> (
                    ev.value == keymap.get(first_btn)
                    <span class="org-keyword">and</span> last_scancode == keymap.get(first_btn)
                    <span class="org-keyword">and</span> ts - last_ts &gt; .5
                ):

                    <span class="org-comment-delimiter"># </span><span class="org-comment">skip button because user pressed KEY_OK</span>
                    <span class="org-comment-delimiter"># </span><span class="org-comment">and it's not an unwanted repeat</span>
                    <span class="org-variable-name">advance_button</span> = <span class="org-constant">True</span>
                    debug(f<span class="org-string">"skipped learning button {button}"</span>)
                <span class="org-keyword">elif</span> last_scancode == ev.value:
                    <span class="org-comment-delimiter"># </span><span class="org-comment">repeated key</span>
                    <span class="org-keyword">pass</span>
                <span class="org-keyword">elif</span> ev.value != keymap.get(first_btn):
                    debug(f<span class="org-string">"Got scancode {ev.value:#06x} for {button}."</span>)
                    <span class="org-variable-name">advance_button</span> = <span class="org-constant">True</span>
                    <span class="org-variable-name">keymap</span>[button] = ev.value
                    <span class="org-variable-name">last_scancode</span> = ev.value

                <span class="org-variable-name">last_ts</span> = ts
                <span class="org-variable-name">last_scancode</span> = ev.value

            <span class="org-keyword">if</span> advance_button:
                <span class="org-variable-name">button</span> = <span class="org-builtin">next</span>(btn_gen)
                <span class="org-keyword">if</span> button:
                    debug(f<span class="org-string">"Please press a button for {button} (press KEY_OK to skip)"</span>)
                <span class="org-keyword">else</span>:
                    <span class="org-keyword">break</span>
        print_keymap(keytable, protocol, keymap)


<span class="org-keyword">def</span> <span class="org-function-name">list_devices</span>():
    <span class="org-variable-name">devices</span> = []
    <span class="org-keyword">for</span> rc_device <span class="org-keyword">in</span> RC_SYS_DEVICES.glob(<span class="org-string">'rc*'</span>):
        <span class="org-variable-name">device</span> = {}
        <span class="org-variable-name">device</span>[<span class="org-string">"path"</span>] = rc_device
        <span class="org-variable-name">device</span>[<span class="org-string">"sys"</span>] = rc_device.name

        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-builtin">next</span>(rc_device.glob(<span class="org-string">'input*/event*/uevent'</span>))) <span class="org-keyword">as</span> f:
            <span class="org-comment-delimiter"># </span><span class="org-comment">read DEVNAME attribute (and others)</span>
            <span class="org-keyword">for</span> line <span class="org-keyword">in</span> f:
                <span class="org-variable-name">key</span>, <span class="org-variable-name">value</span> = line.rstrip().split(<span class="org-string">'='</span>)
                <span class="org-variable-name">device</span>[key] = value

        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(rc_device.joinpath(<span class="org-string">'uevent'</span>)) <span class="org-keyword">as</span> f:
            <span class="org-keyword">for</span> line <span class="org-keyword">in</span> f:
                <span class="org-variable-name">key</span>, <span class="org-variable-name">value</span> = line.rstrip().split(<span class="org-string">'='</span>)
                <span class="org-variable-name">device</span>[key] = value

        <span class="org-keyword">with</span> <span class="org-builtin">open</span>(rc_device.joinpath(<span class="org-string">'protocols'</span>)) <span class="org-keyword">as</span> f:
            <span class="org-variable-name">protocols</span> = f.read().rstrip().split()
            <span class="org-variable-name">active_protocols</span> = [p[1:-1] <span class="org-keyword">for</span> p <span class="org-keyword">in</span> protocols <span class="org-keyword">if</span> (
                p.startswith(<span class="org-string">'['</span>) <span class="org-keyword">and</span> p != <span class="org-string">"[lirc]"</span>)]
            <span class="org-variable-name">inactive_protocols</span> = [p <span class="org-keyword">for</span> p <span class="org-keyword">in</span> protocols <span class="org-keyword">if</span> <span class="org-keyword">not</span> p.startswith(<span class="org-string">'['</span>)]
            <span class="org-variable-name">device</span>[<span class="org-string">"protocols"</span>] = protocols
            <span class="org-variable-name">device</span>[<span class="org-string">"inactive_protocols"</span>] = inactive_protocols
            <span class="org-variable-name">device</span>[<span class="org-string">"active_protocols"</span>] = active_protocols
            devices.append(device)
    <span class="org-keyword">return</span> devices


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">'__main__'</span>:
    <span class="org-variable-name">parser</span> = ArgumentParser(description=<span class="org-string">"create keymaps for rc-core devices"</span>)
    parser.add_argument(<span class="org-string">'-p'</span>, <span class="org-string">'--protocol'</span>, metavar=<span class="org-string">'PROTOCOL'</span>,
                        <span class="org-builtin">help</span>=<span class="org-string">'set ir-protocol'</span>)
    parser.add_argument(<span class="org-string">'-d'</span>, <span class="org-string">'--device'</span>, metavar=<span class="org-string">'DEVICE'</span>, default=<span class="org-constant">None</span>,
                        <span class="org-builtin">help</span>=<span class="org-string">'ir device (e.g. rc0)'</span>)
    <span class="org-variable-name">args</span> = parser.parse_args()

    <span class="org-variable-name">devices</span> = list_devices()
    <span class="org-keyword">if</span> <span class="org-keyword">not</span> devices:
        sys.<span class="org-constant">exit</span>(<span class="org-string">"No rc-core devices found. Exiting."</span>)
    <span class="org-keyword">elif</span> <span class="org-builtin">len</span>(devices) == 1:
        <span class="org-keyword">print</span>(f<span class="org-string">"Using device {devices[0]['NAME']}"</span>, <span class="org-builtin">file</span>=sys.stderr)
        <span class="org-variable-name">dev</span> = devices[0][<span class="org-string">'path'</span>]
        <span class="org-variable-name">input_dev</span> = devices[0][<span class="org-string">'DEVNAME'</span>]
        <span class="org-variable-name">keytable</span> = devices[0][<span class="org-string">'NAME'</span>]
        <span class="org-variable-name">protocol</span> = <span class="org-string">","</span>.join(devices[0][<span class="org-string">'active_protocols'</span>])
    <span class="org-keyword">else</span>:
        <span class="org-keyword">if</span> args.device:
            <span class="org-keyword">for</span> d <span class="org-keyword">in</span> devices:
                <span class="org-keyword">if</span> (d[<span class="org-string">'sys'</span>] == args.device
                        <span class="org-keyword">or</span> d[<span class="org-string">'path'</span>] == RC_SYS_DEVICES.joinpath(args.device)):
                    <span class="org-variable-name">dev</span> = RC_SYS_DEVICES.joinpath(args.device)
                    <span class="org-variable-name">input_dev</span> = d[<span class="org-string">'DEVNAME'</span>]
                    <span class="org-variable-name">keytable</span> = d[<span class="org-string">'NAME'</span>]
                    <span class="org-variable-name">protocol</span> = <span class="org-string">","</span>.join(d[<span class="org-string">'active_protocols'</span>])
        <span class="org-keyword">else</span>:
            <span class="org-keyword">for</span> i, d <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(devices, start=1):
                <span class="org-keyword">if</span> <span class="org-keyword">not</span> args.protocol:
                    <span class="org-keyword">print</span>(f<span class="org-string">"{i}) {d['DEV_NAME']} ({','.join(d.get('active_protocols'))})"</span>)
                <span class="org-keyword">else</span>:
                    <span class="org-keyword">print</span>(f<span class="org-string">"{i}) {d['DEV_NAME']}"</span>)
            <span class="org-keyword">try</span>:
                <span class="org-variable-name">dev_num</span> = <span class="org-builtin">int</span>(<span class="org-builtin">input</span>(<span class="org-string">"\tUse device numer: "</span>))
                <span class="org-keyword">if</span> dev_num &lt; 0 <span class="org-keyword">or</span> dev_num &gt; <span class="org-builtin">len</span>(devices):
                    <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>
                <span class="org-variable-name">d</span> = devices[dev_num - 1]
            <span class="org-keyword">except</span> (<span class="org-type">ValueError</span>, <span class="org-type">IndexError</span>):
                sys.<span class="org-constant">exit</span>(<span class="org-string">"invalid device number"</span>)
            <span class="org-variable-name">input_dev</span> = d[<span class="org-string">'DEVNAME'</span>]
            <span class="org-variable-name">keytable</span> = d[<span class="org-string">'NAME'</span>]
            <span class="org-variable-name">protocol</span> = <span class="org-string">","</span>.join(d[<span class="org-string">'active_protocols'</span>])
            <span class="org-variable-name">dev</span> = d[<span class="org-string">'path'</span>]

    <span class="org-comment-delimiter"># </span><span class="org-comment">set ir-protocol(s)</span>
    <span class="org-keyword">if</span> args.protocol:
        <span class="org-keyword">try</span>:
            <span class="org-keyword">with</span> <span class="org-builtin">open</span>(dev.joinpath(<span class="org-string">'protocols'</span>), <span class="org-string">'w'</span>) <span class="org-keyword">as</span> f:
                f.write(args.protocol)
        <span class="org-keyword">except</span> <span class="org-type">PermissionError</span> <span class="org-keyword">as</span> e:
            sys.<span class="org-constant">exit</span>(f<span class="org-string">"Error: insifficient permissions to change protocol - are you root?"</span>)
        <span class="org-keyword">except</span> <span class="org-type">IOError</span> <span class="org-keyword">as</span> e:
            sys.<span class="org-constant">exit</span>(f<span class="org-string">"Error: could not set protocol(s) to {args.protocol}: {e}"</span>)
        <span class="org-variable-name">protocol</span> = args.protocol

    <span class="org-variable-name">input_dev</span> = DEVPATH.joinpath(input_dev)
    debug(<span class="org-string">"using device: "</span>, input_dev)

    <span class="org-keyword">def</span> <span class="org-function-name">signal_handler</span>(signum, frame):
        sys.<span class="org-constant">exit</span>()

    <span class="org-keyword">for</span> signame <span class="org-keyword">in</span> {<span class="org-string">'SIGINT'</span>, <span class="org-string">'SIGTERM'</span>}:
        signal.signal(
            <span class="org-builtin">getattr</span>(signal, signame),
            signal_handler)
    <span class="org-keyword">try</span>:
        read_from_device(input_dev, keytable, protocol)
    <span class="org-keyword">except</span> <span class="org-type">PermissionError</span> <span class="org-keyword">as</span> e:
        sys.<span class="org-constant">exit</span>(f<span class="org-string">"Error: can't open {input_dev} - are you root?"</span>)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
