yaVDR07_documentation.org
** lircd2uinput
:PROPERTIES:
:CUSTOM_ID: lircd2uinput
:END:
lircd2uinput kann von einem oder mehreren lircd-kompatiblen Sockeln lesen und diese Tastendrücke über ein virtuelles Eingabegerät mit Hilfe von uinput ausgeben.

Alle Programme, die einen lircd-kompatiblen Sockel bereitstellen (z.B. lircd, ir-server, irmplircd usw.), können über ~lircd2uinput~ an =eventlircd= angebunden werden. Mit dem Programm ~lircd2uinput-add "$SOCKET"~ kann man lircd2uinput anweisen einen Sockel auszulesen und mit ~lircd2uinput-remove "$SOCKET"~ wieder damit aufzuhören. Die vom Ansible Playbook installierten Dienste werden automatisch passend konfiguriert.
** eventlircd
:PROPERTIES:
:CUSTOM_ID: eventlircd
:END:
Eventlircd liest Tastendrücke von allen Kernel Input Devices, die das Udev-Attribut ~ENV{eventlircd_enable}="true"~ tragen. Optional kann über das Attribut ~ENV{eventlircd_evmap}="evmap.evmap"~ eine im Ordner ~/etc/eventlircd.d/~ hinterlegte evmap genutzt werden, die dazu dient Tastendrücke bzw. Tastenkombinationen auf den in der Tabelle [[yavdr-keynames]["Vereinheitlichtes Schema für Tastennamen"]] beschriebenen Namespace umzuformen. evmaps sollten genutzt werden, wenn die Anpassung der Tastennamen nicht früher wie z.B. durch Keymap für rc-core Empfänger, lircd oder andere Wege erfolgen kann.

*** Besonderheiten für eventlircd
:PROPERTIES:
:CUSTOM_ID: eventlircd-specialities
:END:
Dienste mit Socket-Activation wie eventlircd erfordern eine besondere Behandlung, wenn man sie stoppen möchte - da die ~eventlircd.socket~ die ~eventlircd.service~ beim Zugriff auf den Sockel-Pfad ~/run/lirc/lircd~ startet, müssen beide maskiert und gestoppt werden, wenn man z.B. mit ~evtest~ oder ~ir-keytable~ auf die von eventlircd exklusiv geöffneten Kernel Input Devices zugreifen möchte:
#+begin_example
systemctl stop eventlircd.{service,socket}
#+end_example
Um eventlircd wieder zu aktivieren:
#+begin_example
systemctl start eventlircd.{service,socket}
#+end_example
** lircd
:PROPERTIES:
:CUSTOM_ID: lircd
:END:
Die meisten ehemals nur in Verbindung mit lirc nutzbaren Treiber wurden bereits auf rc-core portiert, ~lircd~ ist daher nur noch für ein paar Geräte nötig. Dazu gehören die beiden vom Playbook automatisch eingerichteten IR-Empfänger Atric IrWakeupUSB und die YaUsbIR-Empfänger. Wenn ein solcher Empfänger während der Installation angeschlossen war, muss nur noch eine passende lircd.conf angelernt bzw. eine bereits vorhandene Datei nach ~/etc/lirc/lircd.conf.d/~ kopiert werden.
** Tools zum Debuggen von Tastendrücken
:PROPERTIES:
:CUSTOM_ID: debug-remote
:END:
*** evtest
:PROPERTIES:
:CUSTOM_ID: evtest
:END:
~evtest~ kann die Rohdaten für Tastendrücke von Kernel Input Devices lesen. Ruft man es ohne einen Pfad für ein solches Gerät auf, kann man interaktiv ein Gerät aus einer Liste wählen. Wichtig ist eventlircd vorher zu stoppen ( vgl. [[#eventlircd-specialities][Besonderheiten für eventlircd]]), damit Tastendrücke von Geräten ausgelesen werden können, die der Dienst exklusiv geöffnet hat.
*** ir-keytable
:PROPERTIES:
:CUSTOM_ID: ir-keytable-test
:END:
Bei rc-core Geräten kann ~ir-keytable~ genutzt werden, um mittels ~sudo ir-keytable -t~ ankommende Tastendrücke auszulesen.
Damit =ir-keytable= Zugriff auf die Geräte hat, muss [[#eventlircd-specialities][eventlircd zuvor gestoppt werden]].
*** irw
:PROPERTIES:
:CUSTOM_ID: irw
:END:
~irw~ kann von allen lirc-kompatiblen Sockeln lesen, wird es ohne Argumente aufgerufen, liest es von ~/run/lirc/lircd~, was in der Vorkonfiguration der Sockel von eventlircd ist.
* Netzwerkdienste
:PROPERTIES:
:CUSTOM_ID: network-services
:END:
** Netzwerkfreigaben
:PROPERTIES:
:CUSTOM_ID: network-shares
:END:
In der Vorkonfiguration exportiert yavdr-ansible folgende Verzeichnisfreigaben über NFS und Samba:

#+ATTR_LATEX: :booktabs
| Name       | Verzeichnis    |
|------------+----------------|
| audio      | =/srv/audio=     |
| video      | =/srv/video=     |
| pictures   | =/srv/picture=   |
| files      | =/srv/files=     |
| backups    | =/srv/backups=   |
| recordings | =/srv/vdr/video= |

*** avahi-linker
:PROPERTIES:
:CUSTOM_ID: avahi-linker
:END:
Der =avahi-linker= sucht nach Ankündigungen von NFS-Freigaben mit dem Subtyp =_nfs._tcp= und bindet diese automatisch ein. So können sich Rechner im Netzwerk gegenseitig Dateifreigaben zur Verfügung stellen.

