yaVDR07_documentation.html
<div id="outline-container-lircd2uinput" class="outline-3">
<h3 id="lircd2uinput"><span class="section-number-3">3.3.</span> lircd2uinput</h3>
<div class="outline-text-3" id="text-lircd2uinput">
<p>
lircd2uinput kann von einem oder mehreren lircd-kompatiblen Sockeln lesen und diese Tastendrücke über ein virtuelles Eingabegerät mit Hilfe von uinput ausgeben.
</p>

<p>
Alle Programme, die einen lircd-kompatiblen Sockel bereitstellen (z.B. lircd, ir-server, irmplircd usw.), können über <code>lircd2uinput</code> an <code>eventlircd</code> angebunden werden. Mit dem Programm <code>lircd2uinput-add "$SOCKET"</code> kann man lircd2uinput anweisen einen Sockel auszulesen und mit <code>lircd2uinput-remove "$SOCKET"</code> wieder damit aufzuhören. Die vom Ansible Playbook installierten Dienste werden automatisch passend konfiguriert.
</p>
</div>
</div>
<div id="outline-container-eventlircd" class="outline-3">
<h3 id="eventlircd"><span class="section-number-3">3.4.</span> eventlircd</h3>
<div class="outline-text-3" id="text-eventlircd">
<p>
Eventlircd liest Tastendrücke von allen Kernel Input Devices, die das Udev-Attribut <code>ENV{eventlircd_enable}="true"</code> tragen. Optional kann über das Attribut <code>ENV{eventlircd_evmap}="evmap.evmap"</code> eine im Ordner <code>/etc/eventlircd.d/</code> hinterlegte evmap genutzt werden, die dazu dient Tastendrücke bzw. Tastenkombinationen auf den in der Tabelle <a href="#org44f9603">&bdquo;Vereinheitlichtes Schema für Tastennamen&ldquo;</a> beschriebenen Namespace umzuformen. evmaps sollten genutzt werden, wenn die Anpassung der Tastennamen nicht früher wie z.B. durch Keymap für rc-core Empfänger, lircd oder andere Wege erfolgen kann.
</p>
</div>

<div id="outline-container-eventlircd-specialities" class="outline-4">
<h4 id="eventlircd-specialities"><span class="section-number-4">3.4.1.</span> Besonderheiten für eventlircd</h4>
<div class="outline-text-4" id="text-eventlircd-specialities">
<p>
Dienste mit Socket-Activation wie eventlircd erfordern eine besondere Behandlung, wenn man sie stoppen möchte - da die <code>eventlircd.socket</code> die <code>eventlircd.service</code> beim Zugriff auf den Sockel-Pfad <code>/run/lirc/lircd</code> startet, müssen beide maskiert und gestoppt werden, wenn man z.B. mit <code>evtest</code> oder <code>ir-keytable</code> auf die von eventlircd exklusiv geöffneten Kernel Input Devices zugreifen möchte:
</p>
<pre class="example" id="org273e359">
systemctl stop eventlircd.{service,socket}
</pre>
<p>
Um eventlircd wieder zu aktivieren:
</p>
<pre class="example" id="orgc611dba">
systemctl start eventlircd.{service,socket}
</pre>
</div>
</div>
</div>
<div id="outline-container-lircd" class="outline-3">
<h3 id="lircd"><span class="section-number-3">3.5.</span> lircd</h3>
<div class="outline-text-3" id="text-lircd">
<p>
Die meisten ehemals nur in Verbindung mit lirc nutzbaren Treiber wurden bereits auf rc-core portiert, <code>lircd</code> ist daher nur noch für ein paar Geräte nötig. Dazu gehören die beiden vom Playbook automatisch eingerichteten IR-Empfänger Atric IrWakeupUSB und die YaUsbIR-Empfänger. Wenn ein solcher Empfänger während der Installation angeschlossen war, muss nur noch eine passende lircd.conf angelernt bzw. eine bereits vorhandene Datei nach <code>/etc/lirc/lircd.conf.d/</code> kopiert werden.
</p>
</div>
</div>
<div id="outline-container-debug-remote" class="outline-3">
<h3 id="debug-remote"><span class="section-number-3">3.6.</span> Tools zum Debuggen von Tastendrücken</h3>
<div class="outline-text-3" id="text-debug-remote">
</div>
<div id="outline-container-evtest" class="outline-4">
<h4 id="evtest"><span class="section-number-4">3.6.1.</span> evtest</h4>
<div class="outline-text-4" id="text-evtest">
<p>
<code>evtest</code> kann die Rohdaten für Tastendrücke von Kernel Input Devices lesen. Ruft man es ohne einen Pfad für ein solches Gerät auf, kann man interaktiv ein Gerät aus einer Liste wählen. Wichtig ist eventlircd vorher zu stoppen ( vgl. <a href="#eventlircd-specialities">Besonderheiten für eventlircd</a>), damit Tastendrücke von Geräten ausgelesen werden können, die der Dienst exklusiv geöffnet hat.
</p>
</div>
</div>
<div id="outline-container-ir-keytable-test" class="outline-4">
<h4 id="ir-keytable-test"><span class="section-number-4">3.6.2.</span> ir-keytable</h4>
<div class="outline-text-4" id="text-ir-keytable-test">
<p>
Bei rc-core Geräten kann <code>ir-keytable</code> genutzt werden, um mittels <code>sudo ir-keytable -t</code> ankommende Tastendrücke auszulesen.
Damit <code>ir-keytable</code> Zugriff auf die Geräte hat, muss <a href="#eventlircd-specialities">eventlircd zuvor gestoppt werden</a>.
</p>
</div>
</div>
<div id="outline-container-irw" class="outline-4">
<h4 id="irw"><span class="section-number-4">3.6.3.</span> irw</h4>
<div class="outline-text-4" id="text-irw">
<p>
<code>irw</code> kann von allen lirc-kompatiblen Sockeln lesen, wird es ohne Argumente aufgerufen, liest es von <code>/run/lirc/lircd</code>, was in der Vorkonfiguration der Sockel von eventlircd ist.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-network-services" class="outline-2">
<h2 id="network-services"><span class="section-number-2">4.</span> Netzwerkdienste</h2>
<div class="outline-text-2" id="text-network-services">
</div>
<div id="outline-container-network-shares" class="outline-3">
<h3 id="network-shares"><span class="section-number-3">4.1.</span> Netzwerkfreigaben</h3>
<div class="outline-text-3" id="text-network-shares">
<p>
In der Vorkonfiguration exportiert yavdr-ansible folgende Verzeichnisfreigaben über NFS und Samba:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Verzeichnis</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">audio</td>
<td class="org-left"><code>/srv/audio</code></td>
</tr>

<tr>
<td class="org-left">video</td>
<td class="org-left"><code>/srv/video</code></td>
</tr>

<tr>
<td class="org-left">pictures</td>
<td class="org-left"><code>/srv/picture</code></td>
</tr>

<tr>
<td class="org-left">files</td>
<td class="org-left"><code>/srv/files</code></td>
</tr>

<tr>
<td class="org-left">backups</td>
<td class="org-left"><code>/srv/backups</code></td>
</tr>

<tr>
<td class="org-left">recordings</td>
<td class="org-left"><code>/srv/vdr/video</code></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-avahi-linker" class="outline-4">
<h4 id="avahi-linker"><span class="section-number-4">4.1.1.</span> avahi-linker</h4>
<div class="outline-text-4" id="text-avahi-linker">
<p>
Der <code>avahi-linker</code> sucht nach Ankündigungen von NFS-Freigaben mit dem Subtyp <code>_nfs._tcp</code> und bindet diese automatisch ein. So können sich Rechner im Netzwerk gegenseitig Dateifreigaben zur Verfügung stellen.
</p>
</div>

<ol class="org-ol">
