yaVDR07_documentation.org
**** Freigaben ankündigen
:PROPERTIES:
:CUSTOM_ID: avahi-service-syntax
:END:
Der =avahi-daemon= liest die Dateien in =/etc/avahi/services/= ein und kündigt diese im Netzwerk an. Der Wert für =subtype= beeinflusst an welcher Stelle eine Freigabe von avahi-linker eingebunden wird. ~subtype=vdr~ ist für Freigaben vorgesehen, die VDR-Aufzeichnungen enthalten.

#+CAPTION: Beispiel für die Ankünfigung des VDR-Aufnahmeverzeichnis über Avahi
#+begin_src xml
<?xml version="1.0" standalone='no'?>
<!DOCTYPE service-group SYSTEM "avahi-service.dtd">
<service-group>
  <name replace-wildcards="yes">Recordings on %h</name> <!-- Name der Freigabe, %h entspricht dem Hostname -->
    <service>
      <type>_nfs._tcp</type>
      <port>2049</port>
      <txt-record>path=/srv/vdr/video</txt-record>   <!-- Pfad der NFS-Freigabe -->
      <txt-record>subtype=vdr</txt-record>           <!-- Subtyp -->
    </service>
</service-group>
#+end_src

Über einen ~<txt-record>~ für ~category~ können Unterverzeichnisse abgebildet werden:

#+CAPTION: Beispiel für eine Freigabe mit Filmen für das Videoverzeichnis
#+begin_src xml
<?xml version="1.0" standalone='no'?>
<!DOCTYPE service-group SYSTEM "avahi-service.dtd">
<service-group>
<name replace-wildcards="yes">Movies on %h</name> ## Name
  <service>
    <type>_nfs._tcp</type>
    <port>2049</port>
    <txt-record>path=/srv/video/movies</txt-record> <!-- Pfad der NFS-Freigabe -->
    <txt-record>subtype=video</txt-record> <!-- Subtyp -->
    <txt-record>category=movies</txt-record> <!-- Kategorie -->
  </service>
</service-group>
#+end_src

#+CAPTION: Beispiel für eine Freigabe mit Serien für das Videoverzeichnis
#+begin_src xml
<?xml version="1.0" standalone='no'?>
<!DOCTYPE service-group SYSTEM "avahi-service.dtd">
<service-group>
<name replace-wildcards="yes">Movies on %h</name> ## Name
  <service>
    <type>_nfs._tcp</type>
    <port>2049</port>
    <txt-record>path=/srv/video/tv-series</txt-record> <!-- Pfad der NFS-Freigabe -->
    <txt-record>subtype=video</txt-record> <!-- Subtyp -->
    <txt-record>category=series</txt-record> <!-- Kategorie -->
  </service>
</service-group>
#+end_src
Alle anderen Freigaben werden unter den Namen des Subtyps und falls Vorhanden der Kategorie (die übersetzt werden, falls sie in den Übersetzungsdateien aus dem Paket ~yavdr-i18n~ enthalten sind) unterhalb von ~/media/~ eingebunden.

