yaVDR07_documentation.html
<li><a id="avahi-service-syntax"></a>Freigaben ankündigen<br />
<div class="outline-text-5" id="text-avahi-service-syntax">
<p>
Der <code>avahi-daemon</code> liest die Dateien in <code>/etc/avahi/services/</code> ein und kündigt diese im Netzwerk an. Der Wert für <code>subtype</code> beeinflusst an welcher Stelle eine Freigabe von avahi-linker eingebunden wird. <code>subtype=vdr</code> ist für Freigaben vorgesehen, die VDR-Aufzeichnungen enthalten.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Programmlisting 2 </span>Beispiel für die Ankünfigung des VDR-Aufnahmeverzeichnis über Avahi</label><pre class="src src-xml"><span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version="1.0" standalone='no'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
&lt;!<span class="org-nxml-text">DOCTYPE service-group SYSTEM "avahi-service.dtd"&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">name</span> <span class="org-nxml-attribute-local-name">replace-wildcards</span>=<span class="org-string">"yes"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Recordings on %h</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">name</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Name der Freigabe, %h entspricht dem Hostname </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">_nfs._tcp</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2049</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">path=/srv/vdr/video</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span>   <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Pfad der NFS-Freigabe </span><span class="org-comment-delimiter">--&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">subtype=vdr</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span>           <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Subtyp </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Über einen <code>&lt;txt-record&gt;</code> für <code>category</code> können Unterverzeichnisse abgebildet werden:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Programmlisting 3 </span>Beispiel für eine Freigabe mit Filmen für das Videoverzeichnis</label><pre class="src src-xml"><span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version="1.0" standalone='no'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
&lt;!<span class="org-nxml-text">DOCTYPE service-group SYSTEM "avahi-service.dtd"&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">name</span> <span class="org-nxml-attribute-local-name">replace-wildcards</span>=<span class="org-string">"yes"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Movies on %h</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">name</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> ## Name</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">_nfs._tcp</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2049</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">path=/srv/video/movies</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Pfad der NFS-Freigabe </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">subtype=video</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Subtyp </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">category=movies</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Kategorie </span><span class="org-comment-delimiter">--&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Programmlisting 4 </span>Beispiel für eine Freigabe mit Serien für das Videoverzeichnis</label><pre class="src src-xml"><span class="org-nxml-processing-instruction-delimiter">&lt;?</span><span class="org-nxml-processing-instruction-target">xml</span> <span class="org-nxml-processing-instruction-content">version="1.0" standalone='no'</span><span class="org-nxml-processing-instruction-delimiter">?&gt;</span>
&lt;!<span class="org-nxml-text">DOCTYPE service-group SYSTEM "avahi-service.dtd"&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">name</span> <span class="org-nxml-attribute-local-name">replace-wildcards</span>=<span class="org-string">"yes"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Movies on %h</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">name</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> ## Name</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">_nfs._tcp</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">type</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2049</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">port</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">path=/srv/video/tv-series</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Pfad der NFS-Freigabe </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">subtype=video</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Subtyp </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">category=series</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">txt-record</span><span class="org-nxml-tag-delimiter">&gt;</span> <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Kategorie </span><span class="org-comment-delimiter">--&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">service-group</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<p>
Alle anderen Freigaben werden unter den Namen des Subtyps und falls Vorhanden der Kategorie (die übersetzt werden, falls sie in den Übersetzungsdateien aus dem Paket <code>yavdr-i18n</code> enthalten sind) unterhalb von <code>/media/</code> eingebunden.
</p>
</div>
</li>
</ol>
</div>
</div>
