yaVDR07_documentation.org
** NFS
:PROPERTIES:
:CUSTOM_ID: nfs-server
:END:
Zusätzliche NFS-Freigaben können in der =/etc/exports= bzw. in dem Template für die Datei definiert werden.
** Samba
:PROPERTIES:
:CUSTOM_ID: samba-server
:END:
Zusätzliche Samba-Freigaben können in der Datei =/etc/samba/smb.conf.custom= eingetragen werden.
* Ausgabe mit Xorg
:PROPERTIES:
:CUSTOM_ID: xorg-output
:END:
Während der VDR als System Dienst läuft, werden die vom Nutzer benötigten Dienste und Programme im Rahmen einer Systemd User Session gestartet.

Der Start der Benutzersitzung für den User vdr ist folgendermaßen umgesetzt:
 - Der Systemdienst ~yavdr-xorg.service~ startet die beiden abhängigen Dienste ~x@vt7.service~ und ~xlogin@vdr.service~
 - ~xlogin@vdr.service~ startet über die ~/var/lib/vdr/.xinitrc~ eine ~openbox-session~
 - Openbox ruft das Skript ~/var/lib/vdr/.config/openbox/autostart~ auf
 - Das Autostart Skript bereitet die Sitzung vor und ruft das Systemd-Target ~yavdr-desktop.target~ für die Systemd User Session auf, so dass alle davon abhängigen Dienste gestartet werden

** Zugriff auf die Systemd User Session
Um Dienste in der Systemd-User Session zu steuern gibt es zwei Möglichkeiten:
*** Einzelne Befehl mit passenden Rechten und Umgebungsvariablen absetzen:
:PROPERTIES:
:CUSTOM_ID: systemctl-user-session
:END:
Man kann sich die nötigen Rechte verschaffen, um Dienste in der User Session mit ~systemctl~ zu steuern: - so wird z.B. der Dienst ~osd2web.service~ neu gestartet:
#+begin_src example
sudo -u vdr DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666/bus systemctl --user restart osd2web.service
#+end_src

Für die häufigere Nutzung kann es hilfreich sein, sich einen [[https://wiki.ubuntuusers.de/alias/][alias]] in der =~/.bashrc= zu definieren:
#+begin_src shell
alias sctlu="sudo -u vdr DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666/bus systemctl --user "
#+end_src
Damit reduziert sich der oben gezeigte Befehl auf:
#+begin_src example
sctlu restart osd2web
#+end_src
*** Zugriff mit tmux
:PROPERTIES:
:CUSTOM_ID: tmux-user-session
:END:
Möchte man umfangreichere Anpassungen vornehmen, kann es sich lohnen eine Shell zu öffnen, die Zugriff auf die Systemd User Session des Benutzers ~vdr~ hat - mit Hilfe von [[https://wiki.ubuntuusers.de/tmux][tmux]] kann man sich mit dem von der ~tmux.service~ in der User Session gestarteten Dienst verbinden:
#+begin_src example
sudo tmux -S /tmp/tmux-666/default
#+end_src
Möchte man automatisch die Umgebungsvariablen der Systemd User Session laden, kann man in der ~/var/lib/vdr/.bashrc~ einen der folgenden Einträge nutzen:
#+begin_src shell
source <(systemctl --user show-environment)
# bzw.
export $(systemctl --user show-environment)
#+end_src

** yavdr-frontend
:PROPERTIES:
:CUSTOM_ID: yavdr-frontend
:END:
~yavdr-frontend~ ist ein in Python3 geschriebenes Programm, das das VDR-Frontend und andere Programme steuert.

*** Verhalten beim Start
~yavdr-frontend~ kennt ein primäres und ein sekundäres Frontend, in der Voreinstellungen sind diese mit der VDR Ausgabe und KODI vorbelegt.

Beim Starten prüft ~yavdr-frontend~, ob es Hinweise dafür gibt, dass der VDR für einen Timer, Plugin oder einen vom vdr-addon-acpiwakup gesetzten Aufweckzeitpunkt gestartet wurde. Wenn das nicht der Fall ist, wird das VDR-Frontend gestartet, ansonsten bleibt es inaktiv, bis der Nutzer eine Taste auf der Fernbedienung bzw. ~SUPER + A~ auf der Tastatur drückt oder auf einem anderen Weg den Befehl ~frontend-dbus-send start~ absetzt.

Das Startverhalten lässt sich in der =/etc/yavdr-frontend/config.yml= anpassen. Dazu kann im Abschnitt =vdr= der Wert für =attach_on_startup= angepasst werden. Die möglichen Werte sind:
- =auto= :: VDR-Frontend wird nur attached, wenn der VDR nicht für einen Timer, ein Plugin bzw. acpiwakeup gestartet wurde
- =always= :: VDR-Frontend wird immer attached
- =never= :: VDR-Frontend bleibt beim Start detached und kann durch Benutzeraktivität attached werden

** Programme starten
:PROPERTIES:
:CUSTOM_ID: start-programs
:END:
*** desktop-Plugin
Das desktop-Plugin (Menüpunkt "Applikationen" bei Nutzung von menuorg) bildet die GNOME-Menüstruktur ab - wenn eine Anwendung eine [[https://wiki.ubuntuusers.de/.desktop-Dateien/][.desktop]] Datei mitbringt (oder man eine ~.desktop~ Datei für eine Anwendung hinterlegst), kann man sie darüber "standalone" starten (unter der Voraussetzung, dass der Prozess nicht forkt oder sich sonst der Kontrolle durch die generische Systemd-Unit entzieht). Im Hintergrund wird dann über ~/var/lib/vdr/plugins/desktop/starter~ (was ein symbolischer Link auf ~/usr/bin/start-desktop~ ist) mit dem Pfad der ~.desktop~ Datei aufgerufen. Das yavdr-frontend sieht dann nach, ob es eine Systemd-Unit mit dem Namen gibt (abzüglich einer eventuell vorhandenen ~.desktop~ Endung - das kann man z.B. nutzen, wenn Programme mit speziellen Argumenten gestartet werden müssen oder zum Beenden besondere Befehle nötig sind - vgl. z.B. ~/var/lib/vdr/.config/systemd/user/kodi.service~) , ansonsten fällt es auf ~/usr/lib/systemd/user/app@.service~ zurück und startet eine Instanz mit dem Namen der Anwendung.

Wenn eine ~.desktop~ Datei (keine Systemd-Unit!) parallel zum VDR-Frontend über menuorg gestartet werden soll, kann man das mit dem Programm ~/usr/bin/run-desktop-file~ machen, da für den VDR passende Umgebungsvariablen gesetzt sind, um auf die Session zugreifen zu können.
*** frontend-dbus-send
:PROPERTIES:
:CUSTOM_ID: frontend-dbus-send
:END:
yavdr-frontend bietet außerdem eine DBus-API an, über die man den Wechsel je nach Anwendungszweck schöner steuern kann - für menuorg-Einträge bzw. die ~commands.conf~ des VDR gäbe es ~~frontend-dbus-send start_desktop NAME_DER_DESKTOP_DATEI~ (alternativ kann man auch frontend-dbus-send switchto NAME_DER_DESKTOP_DATEI nutzen, dafür kann man auch die in der Konfigurationsdatei ~/etc/yavdr-frontend/config.yml~ im Abschnitt Applications definierten besonderen Namen wie "vdr", "mediacenter", "browser" usw. nutzen), wenn man mit einer Taste auf der Fernbedienung zwischen einer Anwendung und dem VDR-Frontend hin- und herschalten können will, wäre z.B. =frontend-dbus-send switchbetween vdr NAME_DER_DESKTOP_DATEI= eine Möglichkeit.

Ruft man =frontend-dbus-send= ohne Argumente auf, zeigt es eine XML-Beschreibung der DBUS-API.

