yaVDR07_documentation.html

<div id="outline-container-nfs-server" class="outline-3">
<h3 id="nfs-server"><span class="section-number-3">4.2.</span> NFS</h3>
<div class="outline-text-3" id="text-nfs-server">
<p>
Zusätzliche NFS-Freigaben können in der <code>/etc/exports</code> bzw. in dem Template für die Datei definiert werden.
</p>
</div>
</div>
<div id="outline-container-samba-server" class="outline-3">
<h3 id="samba-server"><span class="section-number-3">4.3.</span> Samba</h3>
<div class="outline-text-3" id="text-samba-server">
<p>
Zusätzliche Samba-Freigaben können in der Datei <code>/etc/samba/smb.conf.custom</code> eingetragen werden.
</p>
</div>
</div>
</div>
<div id="outline-container-xorg-output" class="outline-2">
<h2 id="xorg-output"><span class="section-number-2">5.</span> Ausgabe mit Xorg</h2>
<div class="outline-text-2" id="text-xorg-output">
<p>
Während der VDR als System Dienst läuft, werden die vom Nutzer benötigten Dienste und Programme im Rahmen einer Systemd User Session gestartet.
</p>

<p>
Der Start der Benutzersitzung für den User vdr ist folgendermaßen umgesetzt:
</p>
<ul class="org-ul">
<li>Der Systemdienst <code>yavdr-xorg.service</code> startet die beiden abhängigen Dienste <code>x@vt7.service</code> und <code>xlogin@vdr.service</code></li>
<li><code>xlogin@vdr.service</code> startet über die <code>/var/lib/vdr/.xinitrc</code> eine <code>openbox-session</code></li>
<li>Openbox ruft das Skript <code>/var/lib/vdr/.config/openbox/autostart</code> auf</li>
<li>Das Autostart Skript bereitet die Sitzung vor und ruft das Systemd-Target <code>yavdr-desktop.target</code> für die Systemd User Session auf, so dass alle davon abhängigen Dienste gestartet werden</li>
</ul>
</div>

<div id="outline-container-org436730f" class="outline-3">
<h3 id="org436730f"><span class="section-number-3">5.1.</span> Zugriff auf die Systemd User Session</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Um Dienste in der Systemd-User Session zu steuern gibt es zwei Möglichkeiten:
</p>
</div>
<div id="outline-container-systemctl-user-session" class="outline-4">
<h4 id="systemctl-user-session"><span class="section-number-4">5.1.1.</span> Einzelne Befehl mit passenden Rechten und Umgebungsvariablen absetzen:</h4>
<div class="outline-text-4" id="text-systemctl-user-session">
<p>
Man kann sich die nötigen Rechte verschaffen, um Dienste in der User Session mit <code>systemctl</code> zu steuern: - so wird z.B. der Dienst <code>osd2web.service</code> neu gestartet:
</p>
<div class="org-src-container">
<pre class="src src-example">sudo -u vdr DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666/bus systemctl --user restart osd2web.service
</pre>
</div>

<p>
Für die häufigere Nutzung kann es hilfreich sein, sich einen <a href="https://wiki.ubuntuusers.de/alias/">alias</a> in der <code>~/.bashrc</code> zu definieren:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> <span class="org-variable-name">sctlu</span>=<span class="org-string">"sudo -u vdr DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666/bus systemctl --user "</span>
</pre>
</div>
<p>
Damit reduziert sich der oben gezeigte Befehl auf:
</p>
<div class="org-src-container">
<pre class="src src-example">sctlu restart osd2web
</pre>
</div>
</div>
</div>
<div id="outline-container-tmux-user-session" class="outline-4">
<h4 id="tmux-user-session"><span class="section-number-4">5.1.2.</span> Zugriff mit tmux</h4>
<div class="outline-text-4" id="text-tmux-user-session">
<p>
Möchte man umfangreichere Anpassungen vornehmen, kann es sich lohnen eine Shell zu öffnen, die Zugriff auf die Systemd User Session des Benutzers <code>vdr</code> hat - mit Hilfe von <a href="https://wiki.ubuntuusers.de/tmux">tmux</a> kann man sich mit dem von der <code>tmux.service</code> in der User Session gestarteten Dienst verbinden:
</p>
<div class="org-src-container">
<pre class="src src-example">sudo tmux -S /tmp/tmux-666/default
</pre>
</div>
<p>
Möchte man automatisch die Umgebungsvariablen der Systemd User Session laden, kann man in der <code>/var/lib/vdr/.bashrc</code> einen der folgenden Einträge nutzen:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">source</span> &lt;(systemctl --user show-environment)
<span class="org-comment-delimiter"># </span><span class="org-comment">bzw.</span>
<span class="org-builtin">export</span> $(<span class="org-sh-quoted-exec">systemctl</span> --user show-environment)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-yavdr-frontend" class="outline-3">
<h3 id="yavdr-frontend"><span class="section-number-3">5.2.</span> yavdr-frontend</h3>
<div class="outline-text-3" id="text-yavdr-frontend">
<p>
<code>yavdr-frontend</code> ist ein in Python3 geschriebenes Programm, das das VDR-Frontend und andere Programme steuert.
</p>
</div>

<div id="outline-container-org784507a" class="outline-4">
<h4 id="org784507a"><span class="section-number-4">5.2.1.</span> Verhalten beim Start</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
<code>yavdr-frontend</code> kennt ein primäres und ein sekundäres Frontend, in der Voreinstellungen sind diese mit der VDR Ausgabe und KODI vorbelegt.
</p>

<p>
Beim Starten prüft <code>yavdr-frontend</code>, ob es Hinweise dafür gibt, dass der VDR für einen Timer, Plugin oder einen vom vdr-addon-acpiwakup gesetzten Aufweckzeitpunkt gestartet wurde. Wenn das nicht der Fall ist, wird das VDR-Frontend gestartet, ansonsten bleibt es inaktiv, bis der Nutzer eine Taste auf der Fernbedienung bzw. <code>SUPER + A</code> auf der Tastatur drückt oder auf einem anderen Weg den Befehl <code>frontend-dbus-send start</code> absetzt.
</p>

<p>
Das Startverhalten lässt sich in der <code>/etc/yavdr-frontend/config.yml</code> anpassen. Dazu kann im Abschnitt <code>vdr</code> der Wert für <code>attach_on_startup</code> angepasst werden. Die möglichen Werte sind:
</p>
<dl class="org-dl">
<dt><code>auto</code></dt><dd>VDR-Frontend wird nur attached, wenn der VDR nicht für einen Timer, ein Plugin bzw. acpiwakeup gestartet wurde</dd>
<dt><code>always</code></dt><dd>VDR-Frontend wird immer attached</dd>
<dt><code>never</code></dt><dd>VDR-Frontend bleibt beim Start detached und kann durch Benutzeraktivität attached werden</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-start-programs" class="outline-3">
<h3 id="start-programs"><span class="section-number-3">5.3.</span> Programme starten</h3>
<div class="outline-text-3" id="text-start-programs">
</div>
<div id="outline-container-orgfb5fd36" class="outline-4">
<h4 id="orgfb5fd36"><span class="section-number-4">5.3.1.</span> desktop-Plugin</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Das desktop-Plugin (Menüpunkt &bdquo;Applikationen&ldquo; bei Nutzung von menuorg) bildet die GNOME-Menüstruktur ab - wenn eine Anwendung eine <a href="https://wiki.ubuntuusers.de/.desktop-Dateien/">.desktop</a> Datei mitbringt (oder man eine <code>.desktop</code> Datei für eine Anwendung hinterlegst), kann man sie darüber &bdquo;standalone&ldquo; starten (unter der Voraussetzung, dass der Prozess nicht forkt oder sich sonst der Kontrolle durch die generische Systemd-Unit entzieht). Im Hintergrund wird dann über <code>/var/lib/vdr/plugins/desktop/starter</code> (was ein symbolischer Link auf <code>/usr/bin/start-desktop</code> ist) mit dem Pfad der <code>.desktop</code> Datei aufgerufen. Das yavdr-frontend sieht dann nach, ob es eine Systemd-Unit mit dem Namen gibt (abzüglich einer eventuell vorhandenen <code>.desktop</code> Endung - das kann man z.B. nutzen, wenn Programme mit speziellen Argumenten gestartet werden müssen oder zum Beenden besondere Befehle nötig sind - vgl. z.B. <code>/var/lib/vdr/.config/systemd/user/kodi.service</code>) , ansonsten fällt es auf <code>/usr/lib/systemd/user/app@.service</code> zurück und startet eine Instanz mit dem Namen der Anwendung.
</p>

<p>
Wenn eine <code>.desktop</code> Datei (keine Systemd-Unit!) parallel zum VDR-Frontend über menuorg gestartet werden soll, kann man das mit dem Programm <code>/usr/bin/run-desktop-file</code> machen, da für den VDR passende Umgebungsvariablen gesetzt sind, um auf die Session zugreifen zu können.
</p>
</div>
</div>
<div id="outline-container-frontend-dbus-send" class="outline-4">
<h4 id="frontend-dbus-send"><span class="section-number-4">5.3.2.</span> frontend-dbus-send</h4>
<div class="outline-text-4" id="text-frontend-dbus-send">
<p>
yavdr-frontend bietet außerdem eine DBus-API an, über die man den Wechsel je nach Anwendungszweck schöner steuern kann - für menuorg-Einträge bzw. die <code>commands.conf</code> des VDR gäbe es <code>~frontend-dbus-send start_desktop NAME_DER_DESKTOP_DATEI</code> (alternativ kann man auch frontend-dbus-send switchto NAME_DER_DESKTOP_DATEI nutzen, dafür kann man auch die in der Konfigurationsdatei <code>/etc/yavdr-frontend/config.yml</code> im Abschnitt Applications definierten besonderen Namen wie &bdquo;vdr&ldquo;, &bdquo;mediacenter&ldquo;, &bdquo;browser&ldquo; usw. nutzen), wenn man mit einer Taste auf der Fernbedienung zwischen einer Anwendung und dem VDR-Frontend hin- und herschalten können will, wäre z.B. <code>frontend-dbus-send switchbetween vdr NAME_DER_DESKTOP_DATEI</code> eine Möglichkeit.
</p>

<p>
Ruft man <code>frontend-dbus-send</code> ohne Argumente auf, zeigt es eine XML-Beschreibung der DBUS-API.
</p>
</div>
</div>
</div>
