yaVDR07_documentation.org
** Mehrere Bildschirme
:PROPERTIES:
:CUSTOM_ID: dual-screen
:END:
yavdr-ansible unterstützt die Ausgabe auf zwei Bildschirmen. Der primäre Bildschirm stellt standardmäßig das VDR-Frontend, KODI und andere Programme dar. Ist ein sekundärer Bildschirm erkannt worden, wird dieser standardmäßig für die Darstellung von osd2web genutzt.

Man kann die Ausgabe auf primärem und sekundärem Monitor vertauschen, indem man das Skript ~/var/lib/vdr/bin/switch-displays~ innerhalb der User Session (z.B. über irexec) oder als root mit korrekt gesetzter ~DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666~ aufruft.

*** osd2web auf zweitem Monitor
:PROPERTIES:
:CUSTOM_ID: osd2web-dualscreen
:END:
Wenn ein =DISPLAY= mit der Adresse =:0.1= existiert (das ist vorhanden, wenn das Ansible-Playbook einen zweiten Monitor erkannt und konfiguriert hat), wird auf diesem ein Webbrowser (Voreinstellung: =kiosk-browser=) zur Darstellung der von =osd2web= bereitgestellten Webseite angezeigt.

Die dafür zuständige Systemd-Unit ist =/var/lib/vdr/.config/systemd/user/osd2web.service=. Die in dieser Unit genutzten Vorgabewerte für die Variablen =url= und =browser= können durch das Anlegen der Datei =/var/lib/vdr/.config/osd2web/config= mit den gewünschten Variablenzuweisungen übersteuert werden.

Um z.B. statt dem vorkonfigurierten anthraize-Theme das bluecd-Theme zu nutzen, könnte man die Variable =url= so setzen (~?onlyView=1~ sorgt dafür, dass die Steuerungselemente ausgeblendet werden):
#+begin_src shell
url="http://192.168.1.30:4444/skins/horchiTft/index.html?theme=bluecd?onlyView=1"
#+end_src

Das Plugin ist auf Port =4444= erreichbar, dort werden auch die verfügbaren Themes mit den zugehörigen URLs gelistet.
* VDR
:PROPERTIES:
:CUSTOM_ID: vdr
:END:
** Bedienung des VDR
:PROPERTIES:
:CUSTOM_ID: vdr-controls
:END:
Um die grundlegende Bedienung und die Konfiguration des VDR über das OSD werden im Benutzerhandbuch beschrieben:

 http://vdr-wiki.de/wiki/index.php/Benutzerhandbuch

Die standardmäßig über die ~remote.conf~ des VDR vorkonfigurierte Tastenbelegung für die Tastatur sieht so aus:
#+CAPTION: Tastenbelegung
#+ATTR_LATEX: :environment tabularx :width \textwidth :align llX
| Taste         | Funktion     | Anmerkung                                        |
|---------------+--------------+--------------------------------------------------|
| Pos1/Home/Tab | Menü         |                                                  |
| Backspace     | Exit         | Kehrt zum Übergeordneten Menü zurück             |
| Enter         | Ok           | Außerhalb des OSD-Menüs: kleine Info-Anzeige     |
| Pfeil Auf     | Nach oben    | Außerhalb des OSD-Menüs: Kanal hoch              |
| Pfeil Ab      | Nach unten   | Außerhalb des OSD-Menüs: Kanal runter            |
| Pfeil links   | Nach links   | Außerhalb des OSD-Menüs: Wechsel der Kanalgruppe |
| Pfeil rechts  | nach rechts  | Außerhalb des OSD-Menüs: Wechsel der Kanalgruppe |
| Ende          | Info         | Öffnet die Informationen zu einem Listenelement  |
| Pause         | Power        | VDR herunterfahren                               |
| F1            | Rot          | Belegung wird bei aktivem OSD eingeblendet.      |
| F2            | Grün         | Belegung wird bei aktivem OSD eingeblendet.      |
| F3            | Gelb         | Belegung wird bei aktivem OSD eingeblendet.      |
| F4            | Blau         | Belegung wird bei aktivem OSD eingeblendet.      |
| F5            | Zurückspulen |                                                  |
| F6            | Vorspulen    |                                                  |
| F10           | Mute         | Schaltet den Ton aus oder ein                    |
| F11           | Leiser       |                                                  |
| F12           | Lauter       |                                                  |
| Zifferntasten | Ziffern 0-9  |                                                  |
