yaVDR07_documentation.html

<div id="outline-container-dual-screen" class="outline-3">
<h3 id="dual-screen"><span class="section-number-3">5.4.</span> Mehrere Bildschirme</h3>
<div class="outline-text-3" id="text-dual-screen">
<p>
yavdr-ansible unterstützt die Ausgabe auf zwei Bildschirmen. Der primäre Bildschirm stellt standardmäßig das VDR-Frontend, KODI und andere Programme dar. Ist ein sekundärer Bildschirm erkannt worden, wird dieser standardmäßig für die Darstellung von osd2web genutzt.
</p>

<p>
Man kann die Ausgabe auf primärem und sekundärem Monitor vertauschen, indem man das Skript <code>/var/lib/vdr/bin/switch-displays</code> innerhalb der User Session (z.B. über irexec) oder als root mit korrekt gesetzter <code>DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/666</code> aufruft.
</p>
</div>

<div id="outline-container-osd2web-dualscreen" class="outline-4">
<h4 id="osd2web-dualscreen"><span class="section-number-4">5.4.1.</span> osd2web auf zweitem Monitor</h4>
<div class="outline-text-4" id="text-osd2web-dualscreen">
<p>
Wenn ein <code>DISPLAY</code> mit der Adresse <code>:0.1</code> existiert (das ist vorhanden, wenn das Ansible-Playbook einen zweiten Monitor erkannt und konfiguriert hat), wird auf diesem ein Webbrowser (Voreinstellung: <code>kiosk-browser</code>) zur Darstellung der von <code>osd2web</code> bereitgestellten Webseite angezeigt.
</p>

<p>
Die dafür zuständige Systemd-Unit ist <code>/var/lib/vdr/.config/systemd/user/osd2web.service</code>. Die in dieser Unit genutzten Vorgabewerte für die Variablen <code>url</code> und <code>browser</code> können durch das Anlegen der Datei <code>/var/lib/vdr/.config/osd2web/config</code> mit den gewünschten Variablenzuweisungen übersteuert werden.
</p>

<p>
Um z.B. statt dem vorkonfigurierten anthraize-Theme das bluecd-Theme zu nutzen, könnte man die Variable <code>url</code> so setzen (<code>?onlyView=1</code> sorgt dafür, dass die Steuerungselemente ausgeblendet werden):
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">url</span>=<span class="org-string">"http://192.168.1.30:4444/skins/horchiTft/index.html?theme=bluecd?onlyView=1"</span>
</pre>
</div>

<p>
Das Plugin ist auf Port <code>4444</code> erreichbar, dort werden auch die verfügbaren Themes mit den zugehörigen URLs gelistet.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-vdr" class="outline-2">
<h2 id="vdr"><span class="section-number-2">6.</span> VDR</h2>
<div class="outline-text-2" id="text-vdr">
</div>
<div id="outline-container-vdr-controls" class="outline-3">
<h3 id="vdr-controls"><span class="section-number-3">6.1.</span> Bedienung des VDR</h3>
<div class="outline-text-3" id="text-vdr-controls">
<p>
Um die grundlegende Bedienung und die Konfiguration des VDR über das OSD werden im Benutzerhandbuch beschrieben:
</p>

<p>
<a href="http://vdr-wiki.de/wiki/index.php/Benutzerhandbuch">http://vdr-wiki.de/wiki/index.php/Benutzerhandbuch</a>
</p>

<p>
Die standardmäßig über die <code>remote.conf</code> des VDR vorkonfigurierte Tastenbelegung für die Tastatur sieht so aus:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabelle 2</span> Tastenbelegung</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Taste</th>
<th scope="col" class="org-left">Funktion</th>
<th scope="col" class="org-left">Anmerkung</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Pos1/Home/Tab</td>
<td class="org-left">Menü</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Backspace</td>
<td class="org-left">Exit</td>
<td class="org-left">Kehrt zum Übergeordneten Menü zurück</td>
</tr>

<tr>
<td class="org-left">Enter</td>
<td class="org-left">Ok</td>
<td class="org-left">Außerhalb des OSD-Menüs: kleine Info-Anzeige</td>
</tr>

<tr>
<td class="org-left">Pfeil Auf</td>
<td class="org-left">Nach oben</td>
<td class="org-left">Außerhalb des OSD-Menüs: Kanal hoch</td>
</tr>

<tr>
<td class="org-left">Pfeil Ab</td>
<td class="org-left">Nach unten</td>
<td class="org-left">Außerhalb des OSD-Menüs: Kanal runter</td>
</tr>

<tr>
<td class="org-left">Pfeil links</td>
<td class="org-left">Nach links</td>
<td class="org-left">Außerhalb des OSD-Menüs: Wechsel der Kanalgruppe</td>
</tr>

<tr>
<td class="org-left">Pfeil rechts</td>
<td class="org-left">nach rechts</td>
<td class="org-left">Außerhalb des OSD-Menüs: Wechsel der Kanalgruppe</td>
</tr>

<tr>
<td class="org-left">Ende</td>
<td class="org-left">Info</td>
<td class="org-left">Öffnet die Informationen zu einem Listenelement</td>
</tr>

<tr>
<td class="org-left">Pause</td>
<td class="org-left">Power</td>
<td class="org-left">VDR herunterfahren</td>
</tr>

<tr>
<td class="org-left">F1</td>
<td class="org-left">Rot</td>
<td class="org-left">Belegung wird bei aktivem OSD eingeblendet.</td>
</tr>

<tr>
<td class="org-left">F2</td>
<td class="org-left">Grün</td>
<td class="org-left">Belegung wird bei aktivem OSD eingeblendet.</td>
</tr>

<tr>
<td class="org-left">F3</td>
<td class="org-left">Gelb</td>
<td class="org-left">Belegung wird bei aktivem OSD eingeblendet.</td>
</tr>

<tr>
<td class="org-left">F4</td>
<td class="org-left">Blau</td>
<td class="org-left">Belegung wird bei aktivem OSD eingeblendet.</td>
</tr>

<tr>
<td class="org-left">F5</td>
<td class="org-left">Zurückspulen</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F6</td>
<td class="org-left">Vorspulen</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F10</td>
<td class="org-left">Mute</td>
<td class="org-left">Schaltet den Ton aus oder ein</td>
</tr>

<tr>
<td class="org-left">F11</td>
<td class="org-left">Leiser</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F12</td>
<td class="org-left">Lauter</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Zifferntasten</td>
<td class="org-left">Ziffern 0-9</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
