yaVDR07_documentation.org
** Unterstützte Ausgabeplugins
:PROPERTIES:
:CUSTOM_ID: vdr-output-plugins
:END:
Da das originale softhddevice nicht mehr weiterentwickelt zu werden scheint, gibt es mittlerweile eine Reihe von Ablegern, die je nach Einsatzszenario mehr oder weniger gut geeignet sind.
Aktuell sind die folgenden Pakete für Ausgabeplugins für Ubuntu bionic verfügbar, die vom yavdr-frontend automatisch erkannt werden:

#+LATEX: \small
#+CAPTION: Verfügbare Ausgabeplugins unter Ubuntu 18.04
#+ATTR_LATEX: :environment tabularx :width \textwidth :align XlllrX
| Paketname                                    | VDPAU | Cuvid | VAAPI | HEVC               | ffmpeg | Kommentar                                                                     |
|----------------------------------------------+-------+-------+-------+--------------------+--------+-------------------------------------------------------------------------------|
| vdr-plugin-softhddevice-vpp                  | Ja    | Nein  | Ja    | Ja (Software)      |    3.4 | Fork von softhddevice, unterstützt Ausgabe über VDPAU und VAAPI               |
| vdr-plugin-softhddevice-vdpau-hevc           | Ja    | Nein  | Ja    | Ja (VAAPI, VDPAU) |    3.3 | Wie softhddevice-vpp, aber gegen ffmpeg 3.3 gebaut                            |
| vdr-plugin-softhddevice-openglosd            | Ja    | Nein  | Nein  | Nein               |    3.4 | Fork von softhddevice mit hardwarebeschleunigtem OSD                          |
| vdr-plugin-softhddevice-openglosd-ffmpeg-2.8 | Ja    | Nein  | Nein  | Nein               |    2.8 | wie softhddevice-openglosd, scheint mit ffmpeg 2.8 stabiler zu laufen         |
| vdr-plugin-softhddevice                      | Ja    | Nein  | Ja    | Ja (Software)      |    3.4 | Für neuere ffmpeg-Versionen angepasste Weiterentwicklung von softhddevice-vpp |
| vdr-plugin-softhddevice                      | Ja    | Ja    | Ja    | Ja (CUVID, VAAPI?) |  4.2.1 | mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi |
| vdr-plugin-softhdvaapi                       | Nein  | Nein  | Ja    | Ja (VAAPI)         |  4.2.1 | mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi |
| vdr-plugin-softhddrm                         | Nein  | Nein  | Ja    | Ja (VAAPI)         |  4.2.1 | mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi |
| vdr-plugin-softhdcuvid                       | Nein  | Ja    | Ja    | Ja (CUVID)         |  4.2.1 | [[https://www.vdr-portal.de/forum/index.php?thread/132253-anleitung-f%C3%BCr-softhdcuvid-mit-libplacebo/][Anleitung für softhdcuvid mit libplacebo]]                                      |
| vdr-plugin-softhddevice-ffmpeg-2.8           | Ja    | Nein  | Nein  | Nein               |    2.8 | originale Variante des softhddevice-Plugin, gegen ffmpeg 2.8 gebaut.          |
| vdr-plugin-vaapidevice                       | Nein  | Nein  | Ja    | Ja (Software)      |    3.3 | Auf VAAPI reduzierte Variante von softhddevice-vpp                            |
| vdr-plugin-vaapidevice-hecv                  | Nein  | Nein  | Ja    | Ja (VAAPI, VDPAU) |    3.3 | wie vaapidevice, gegen ffmpeg-3.3 gebaut                                      |
| vdr-plugin-softhdcuvid                       | Ja    | Ja    | Nein  | Ja (CUVID)         |    3.4 | Für Nvidia-Karten mit CUDA/CUVID Decoder (ab GT630 Kepler und höher)          |
| vdr-plugin-xineliboutput                     | Ja    | Nein  | Ja    | Ja (Software)      |    3.4 | Unterstützt VAAPI und VDPAU, läuft auch ohne Hardwarebeschleunigung in VMs    |
#+LATEX: \normalsize

Für Ubuntu Focal sind nur noch Pakete mit Kompatibilität zu ffmpeg 2.8 und ffmpeg 4.2 in den Paketquellen:
#+LATEX: \small
#+CAPTION: Verfügbare Ausgabeplugins unter Ubuntu 20.04
#+ATTR_LATEX: :environment tabularx :width \textwidth :align XlllrX
| Paketname                                    | VDPAU | CUVID | VAAPI | HEVC                     | ffmpeg | Kommentar                                                                       |
|----------------------------------------------+-------+-------+-------+--------------------------+--------+---------------------------------------------------------------------------------|
| vdr-plugin-softhddevice                      | Ja    | Nein  | Ja    | Ja (VDPAU, VAAPI)        |    4.2 |                                                                                 |
| vdr-plugin-softhddevice-cuvid                | Ja    | Ja    | Ja    | Ja (CUVID, VDPAU, VAAPI) |    4.2 | mit cuvid-Unterstützung (muss mit dem Start-Argument ~-v cuvid~ aktiviert werden) |
| vdr-plugin-softhddevice-ffmpeg-2.8           | Ja    | Nein  | Nein  | Nein                     |    2.8 | originale Variante des softhddevice-Plugin, gegen ffmpeg 2.8 gebaut.            |
| vdr-plugin-softhddevice-openglosd-ffmpeg-2.8 | Ja    | Nein  | Nein  | Nein                     |    2.8 | wie softhddevice-openglosd, scheint mit ffmpeg 2.8 stabiler zu laufen           |
| vdr-plugin-softhdvaapi                       | Nein  | Nein  | Ja    | Ja (VAAPI)               |    4.2 |                                                                                 |
| vdr-plugin-softhddrm                         | Nein  | Nein  | Ja    | Ja (VAAPI)               |    4.2 | funktioniert nur ohne X-Session                                                 |
| vdr-plugin-softhdcuvid                       | Ja    | Ja    | Nein  | Ja (CUVID)               |    4.2 | Für Nvidia-Karten mit CUDA/CUVID Decoder (ab GT630 Kepler und höher)            |
| vdr-plugin-vaapidevice                       | Nein  | Nein  | Ja    | Ja (VAAPI)               |    4.2 | Auf VAAPI reduzierte Variante von softhddevice-vpp, seit längerem ungepflegt    |
| vdr-plugin-xineliboutput                     | Ja    | Nein  | Ja    | Ja                       |    4.2 | Unterstützt VAAPI und VDPAU, läuft auch ohne Hardwarebeschleunigung in VMs      |
#+LATEX: \normalsize


HEVC sollte mit Nvidia-GPUs ab der GTX 950/GT 1030 aufwärts und mit Intel IGPs ab der Skylake-Generation (mehr als 8-Bit pro Farbkanal erst ab Kabylake) funktionieren. Die Ausgabe ist bislang auf 8-Bit pro Farbkanal beschränkt.

Die Ausgabe mit 10 Bit pro Farbkanal scheint mit softhddrm in Verbindung mit einem gepatchten Kernel auf geeigneter Hardware grundsätzlich möglich zu sein: [[https://www.vdr-portal.de/forum/index.php?thread/132976-softhdcuvid-jetzt-mit-vaapi-und-hdr-support/&postID=1320674#post1320674][Beschreibung von softhddrm (2019-12-10)]] ff.
