yaVDR07_documentation.html
<div id="outline-container-vdr-output-plugins" class="outline-3">
<h3 id="vdr-output-plugins"><span class="section-number-3">6.2.</span> Unterstützte Ausgabeplugins</h3>
<div class="outline-text-3" id="text-vdr-output-plugins">
<p>
Da das originale softhddevice nicht mehr weiterentwickelt zu werden scheint, gibt es mittlerweile eine Reihe von Ablegern, die je nach Einsatzszenario mehr oder weniger gut geeignet sind.
Aktuell sind die folgenden Pakete für Ausgabeplugins für Ubuntu bionic verfügbar, die vom yavdr-frontend automatisch erkannt werden:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabelle 3</span> Verfügbare Ausgabeplugins unter Ubuntu 18.04</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Paketname</th>
<th scope="col" class="org-left">VDPAU</th>
<th scope="col" class="org-left">Cuvid</th>
<th scope="col" class="org-left">VAAPI</th>
<th scope="col" class="org-left">HEVC</th>
<th scope="col" class="org-right">ffmpeg</th>
<th scope="col" class="org-left">Kommentar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">vdr-plugin-softhddevice-vpp</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (Software)</td>
<td class="org-right">3.4</td>
<td class="org-left">Fork von softhddevice, unterstützt Ausgabe über VDPAU und VAAPI</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-vdpau-hevc</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI, VDPAU)</td>
<td class="org-right">3.3</td>
<td class="org-left">Wie softhddevice-vpp, aber gegen ffmpeg 3.3 gebaut</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-openglosd</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-right">3.4</td>
<td class="org-left">Fork von softhddevice mit hardwarebeschleunigtem OSD</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-openglosd-ffmpeg-2.8</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-right">2.8</td>
<td class="org-left">wie softhddevice-openglosd, scheint mit ffmpeg 2.8 stabiler zu laufen</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (Software)</td>
<td class="org-right">3.4</td>
<td class="org-left">Für neuere ffmpeg-Versionen angepasste Weiterentwicklung von softhddevice-vpp</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (CUVID, VAAPI?)</td>
<td class="org-right">4.2.1</td>
<td class="org-left">mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhdvaapi</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI)</td>
<td class="org-right">4.2.1</td>
<td class="org-left">mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddrm</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI)</td>
<td class="org-right">4.2.1</td>
<td class="org-left">mit ppa:seahawk1986-hotmail/vdr-2.4.1 und ppa:seahawk1986-hotmail/softhdvaapi</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhdcuvid</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (CUVID)</td>
<td class="org-right">4.2.1</td>
<td class="org-left"><a href="https://www.vdr-portal.de/forum/index.php?thread/132253-anleitung-f%C3%BCr-softhdcuvid-mit-libplacebo/">Anleitung für softhdcuvid mit libplacebo</a></td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-ffmpeg-2.8</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-right">2.8</td>
<td class="org-left">originale Variante des softhddevice-Plugin, gegen ffmpeg 2.8 gebaut.</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-vaapidevice</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (Software)</td>
<td class="org-right">3.3</td>
<td class="org-left">Auf VAAPI reduzierte Variante von softhddevice-vpp</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-vaapidevice-hecv</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI, VDPAU)</td>
<td class="org-right">3.3</td>
<td class="org-left">wie vaapidevice, gegen ffmpeg-3.3 gebaut</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhdcuvid</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja (CUVID)</td>
<td class="org-right">3.4</td>
<td class="org-left">Für Nvidia-Karten mit CUDA/CUVID Decoder (ab GT630 Kepler und höher)</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-xineliboutput</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (Software)</td>
<td class="org-right">3.4</td>
<td class="org-left">Unterstützt VAAPI und VDPAU, läuft auch ohne Hardwarebeschleunigung in VMs</td>
</tr>
</tbody>
</table>
<p>
Für Ubuntu Focal sind nur noch Pakete mit Kompatibilität zu ffmpeg 2.8 und ffmpeg 4.2 in den Paketquellen:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabelle 4</span> Verfügbare Ausgabeplugins unter Ubuntu 20.04</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Paketname</th>
<th scope="col" class="org-left">VDPAU</th>
<th scope="col" class="org-left">CUVID</th>
<th scope="col" class="org-left">VAAPI</th>
<th scope="col" class="org-left">HEVC</th>
<th scope="col" class="org-right">ffmpeg</th>
<th scope="col" class="org-left">Kommentar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">vdr-plugin-softhddevice</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VDPAU, VAAPI)</td>
<td class="org-right">4.2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-cuvid</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (CUVID, VDPAU, VAAPI)</td>
<td class="org-right">4.2</td>
<td class="org-left">mit cuvid-Unterstützung (muss mit dem Start-Argument <code>-v cuvid</code> aktiviert werden)</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-ffmpeg-2.8</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-right">2.8</td>
<td class="org-left">originale Variante des softhddevice-Plugin, gegen ffmpeg 2.8 gebaut.</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddevice-openglosd-ffmpeg-2.8</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-right">2.8</td>
<td class="org-left">wie softhddevice-openglosd, scheint mit ffmpeg 2.8 stabiler zu laufen</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhdvaapi</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI)</td>
<td class="org-right">4.2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhddrm</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI)</td>
<td class="org-right">4.2</td>
<td class="org-left">funktioniert nur ohne X-Session</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-softhdcuvid</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja (CUVID)</td>
<td class="org-right">4.2</td>
<td class="org-left">Für Nvidia-Karten mit CUDA/CUVID Decoder (ab GT630 Kepler und höher)</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-vaapidevice</td>
<td class="org-left">Nein</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja (VAAPI)</td>
<td class="org-right">4.2</td>
<td class="org-left">Auf VAAPI reduzierte Variante von softhddevice-vpp, seit längerem ungepflegt</td>
</tr>

<tr>
<td class="org-left">vdr-plugin-xineliboutput</td>
<td class="org-left">Ja</td>
<td class="org-left">Nein</td>
<td class="org-left">Ja</td>
<td class="org-left">Ja</td>
<td class="org-right">4.2</td>
<td class="org-left">Unterstützt VAAPI und VDPAU, läuft auch ohne Hardwarebeschleunigung in VMs</td>
</tr>
</tbody>
</table>
<p>
HEVC sollte mit Nvidia-GPUs ab der GTX 950/GT 1030 aufwärts und mit Intel IGPs ab der Skylake-Generation (mehr als 8-Bit pro Farbkanal erst ab Kabylake) funktionieren. Die Ausgabe ist bislang auf 8-Bit pro Farbkanal beschränkt.
</p>

<p>
Die Ausgabe mit 10 Bit pro Farbkanal scheint mit softhddrm in Verbindung mit einem gepatchten Kernel auf geeigneter Hardware grundsätzlich möglich zu sein: <a href="https://www.vdr-portal.de/forum/index.php?thread/132976-softhdcuvid-jetzt-mit-vaapi-und-hdr-support/&amp;postID=1320674#post1320674">Beschreibung von softhddrm (2019-12-10)</a> ff.
</p>
</div>
