yaVDR07_documentation.org
*** Bekannte Probleme bei den Ausgabeplugins:
- 4k Auflösung :: Darstellungsprobleme beim Skindesigner mit anderen Skins als metrix HD
- softhddrm :: Funktioniert nur ohne X-Server, Umschaltung zu anderen Programmen schwierig ([[https://www.vdr-portal.de/forum/index.php?thread/132976-softhdcuvid-jetzt-mit-vaapi-und-hdr-support/&postID=1321463#post1321463][VDR muss wohl als root laufen, um das DRM-Device freigaben zu können]])
- softhddevice-vpp :: Farbfehldarstellung des OSD mit bestimmten Nvidia-Karten (z.B. GT630 mit Kepler Chipsatz)
- VDPAU mit ffmpeg 3.4/3.3 :: bei SAT-Empfang in Verbindung Crashes auf bestimmten Sendern, in dem Fall eine der Varianten mit ffmpeg 2.8 verwenden.
- VDPAU und VAAPI mit ffmpeg 3.4 :: keine Hardwarebeschleunigung für HEVC-Material, in dem Fall eine Variante mit ffmpeg 3.3 verwenden.
** Konfiguration des VDR
:PROPERTIES:
:CUSTOM_ID: vdr-configuration
:END:
*** Umgebungsvariablen
:PROPERTIES:
:CUSTOM_ID: vdr-environment-variables
:END:
Für den VDR und die von der Systemd-Unit genutzten Hilfsskripte können in der Konfigurationsdatei ~/etc/default/vdr~ Umgebungsvariablen gesetzt werden.
*** Startargumente
:PROPERTIES:
:CUSTOM_ID: vdr-start-arguments
:END:
Wie schon bei yaVDR 0.6 wird weiterhin die ARGSDIR-Konfiguration genutzt. Wenn der VDR ohne Argumente gestartet wird, liest er beim Start alle Dateien mit der Endung ~.conf~ im Verzeichnis ~/etc/vdr/conf.d/~ ein.

Die Konfigurationsdateien nutzen eine vom ~.ini~-Format gewohnte Syntax.
 - Zeilen, die mit einer Raute (~#~) beginnen, werden vom Parser ignoriert.
 - Jeder Abschnitt wird durch einen Begriff in eckigen Klammern eingeleitet, der angibt, wofür die Argumente in den nachfolgenden Zeilen gelten sollen. Um Startargumente für den VDR zu definieren schreibt man also ~[vdr]~ und für Plugins den Pluginnamen, z.B. ~[softhddevice]~ für das Softhddevice-Plugin.
 - In den folgenden Zeilen können dann Start-Argumente für den VDR bzw. das jeweilige Plugin übergeben werden.
 - Falls es mehrere Abschnitte gibt, die mit dem gleichen Begriff in eckigen Klammern eingeleitet werden, werden nur die Abschnitte für ~[vdr]~ zusammengefasst, bei Plugins wird die Konfiguration jeweils einzeln an den VDR übergeben, wodurch Plugins mehrfach mit unterschiedlichen Startargumenten geladen werden können. Plugins wie z.B. xineliboutput vertragen es nicht, wenn mehrere Instanzen geladen werden.

Um ein Plugin vom VDR laden zu lassen, genügt es seinen Namen in eckigen Klammern in einer Konfigurationsdatei abzulegen. Will man den Start verhindern, muss man dafür sorgen, dass der VDR den Eintrag nicht mehr einliest. Ein bequemes Werkzeug um Plugins zu (de-)aktivieren oder die Start-Argumente zu bearbeiten ist [[vdrctl][vdrctl]].

Die Datei ~/etc/vdr/conf.d/00_vdr.conf~ enthält die vom Distributor vorgegebenen Start-Argumente für den VDR. Da alle Dateien in ~/etc/~, die aus Paketen stammen, vom Paket-System als Konfigurationsdateien angesehen werden, können diese nach Wunsch verändert werden. Falls ein Paket beim Update eine davon abweichende Version mitbringt, erhält man eine Rückfrage, welche Version man übernehmen möchte.

Die Plugin-Pakete werden mit vorgefertigten Konfigurationsdateien ausgeliefert, die nach ~/etc/vdr/conf.avail/<plugin_name>.conf~ installiert und (falls der Distributor vorgibt, dass das Plugin automatisch nach der Installation aktiviert werden soll, wie es bei yaVDR der Fall ist) nach ~/etc/vdr/conf.d/<priorität>-<plugin_name>.conf~ verlinkt werden. Die standardmäßig gesetzte Priorität ist 50, ein abweichender Wert kann vom Distributor vorgegeben werden.

Alle Konfigurationsdateien in /etc/vdr/conf.d/ werden nach Dateinamen sortiert interpretiert und somit die Plugins in der Reihenfolge der gesetzten Priorität geladen. Das Plugin mit der niedrigsten numerischen Priorität wird zuerst geladen und das Plugin mit der höchsten numerischen Priorität als letztes.

Mit dem folgenden Befehl kann man sich die vom VDR eingelesenen Startargumente anzeigen lassen:
#+begin_example
$ vdr --showargs
#+end_example
**** vdrctl
:PROPERTIES:
:CUSTOM_ID: vdrctl
:END:
vdrctl ist ein Hilfsprogramm, das die Verwaltung der Konfigurationsdateien für den VDR vereinfacht. Es kann die nötigen Symlinks anlegen bzw. entfernen und Konfigurationsdateien mit einem Editor öffnen.

Hier ein paar Beispiele zur Verwendung:
#+begin_example
# Hilfe zu vdrctl anzeigen.
vdrctl -h

# Status aller verfügbaren Plugins und statischen Konfigurationdateien
$ vdrctl status

# Aktivierung eines Plugins.
$ sudo vdrctl enable streamdev-client

# Ein Plugin unter Angabe der Priorität aktivieren.
$ sudo vdrctl enable dynamite -p 90

# Aktivierung mehrerer Plugins.
$ sudo vdrctl enable streamdev-client vnsiserver

# Ein Plugin deaktivieren.
$ sudo vdrctl disable iptv

# Mehrerere Plugins deaktivieren.
$ sudo vdrctl disable streamdev-client streamdev-server iptv

# Bearbeiten der Konfiguration für ein Plugin.
$ sudo vdrctl edit imonlcd

# Bearbeiten der Konfiguration mit einem Wunsch-Editor (hier vim):
$ EDITOR=vim sudo vdrctl edit imonlcd
#+end_example
*** Shutdown
:PROPERTIES:
:CUSTOM_ID: vdr-shutdown
:END:
**** Shutdown-Hooks
:PROPERTIES:
:CUSTOM_ID: vdr-shutdown-hooks
:END:
Zusätzlich zu den im VDR verankerten Mechanismen um einen Shutdown zu verhindern (Benutzeraktivität, anstehender Timer, Plugins verhindern den Shutdown während gewisser Operationen) gibt es die Möglichkeit den Shutdown-Versuch durch Hook-Skripte in ~/etc/vdr/shutdown-hooks/~ (bzw. von Paketen abgelegte Skripte in ~/usr/share/vdr/shutdown-hooks/~) abzubrechen, die über den ~vdr-shutdown-wrapper~ und das Skript ~/usr/lib/vdr/vdr-shutdown~ aufgerufen werden.
***** vdr-addon-acpiwakeup
Das Addon setzt über ~/sys/class/rtc/rtc0/wakealarm~ bzw. über einen anderen über die Umgebungsvariable ~WAKEALARM~ in ~/etc/default/vdr~ bzw. ~/etc/vdr/vdr-addon-acpiwakeup.conf~~ angegebenen RTC-kompatiblen Node die Aufweckzeit.
Einstellungen wie das regelmäßige Aufwecken des Rechners, wenn kein Timer definiert wurde können über die Konfigurationsdatei ~/etc/vdr/vdr-addon-acpiwakeup.conf~ vorgenommen werden.
***** vdr-addon-lifeguard-ng
Das lifeguard-ng Addon verhindert den Shutdown für konfigurierbare Shutdown-Hindernisse wie bestehende SSH-, NFS- und Samba-Verbindungen von Clients. Darüber hinaus lassen im Netzwerk aktive Hosts bzw. pingbare IP-Addressen sowie angemeldete Nutzer und bestehende TC/IP-Verbindungen als Abbruchkriterien für den Shutdown konfigurieren. Die Konfiguration erfolgt über die ~/etc/lifeguard.conf~.

**** Shutdown durch den VDR verhindern
:PROPERTIES:
:CUSTOM_ID: vdr-prevent-shutdown
:END:
***** automatischen Shutdown bei Inaktivität verhindern
Um zu verhindern, dass der VDR bei Inaktivität den Rechner herunter fährt, kann man die Option "VDR ausschalten bei Inaktivität (min)" auf den Wert ~0~ setzen. Alternativ bei gestopptem VDR in der ~/var/lib/vdr/setup.conf~ die Variable ~MinUserInactivity = 0~ setzen.
