yaVDR07_documentation.html
<div id="outline-container-org1491957" class="outline-4">
<h4 id="org1491957"><span class="section-number-4">6.2.1.</span> Bekannte Probleme bei den Ausgabeplugins:</h4>
<div class="outline-text-4" id="text-6-2-1">
<dl class="org-dl">
<dt>4k Auflösung</dt><dd>Darstellungsprobleme beim Skindesigner mit anderen Skins als metrix HD</dd>
<dt>softhddrm</dt><dd>Funktioniert nur ohne X-Server, Umschaltung zu anderen Programmen schwierig (<a href="https://www.vdr-portal.de/forum/index.php?thread/132976-softhdcuvid-jetzt-mit-vaapi-und-hdr-support/&amp;postID=1321463#post1321463">VDR muss wohl als root laufen, um das DRM-Device freigaben zu können</a>)</dd>
<dt>softhddevice-vpp</dt><dd>Farbfehldarstellung des OSD mit bestimmten Nvidia-Karten (z.B. GT630 mit Kepler Chipsatz)</dd>
<dt>VDPAU mit ffmpeg 3.4/3.3</dt><dd>bei SAT-Empfang in Verbindung Crashes auf bestimmten Sendern, in dem Fall eine der Varianten mit ffmpeg 2.8 verwenden.</dd>
<dt>VDPAU und VAAPI mit ffmpeg 3.4</dt><dd>keine Hardwarebeschleunigung für HEVC-Material, in dem Fall eine Variante mit ffmpeg 3.3 verwenden.</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-vdr-configuration" class="outline-3">
<h3 id="vdr-configuration"><span class="section-number-3">6.3.</span> Konfiguration des VDR</h3>
<div class="outline-text-3" id="text-vdr-configuration">
</div>
<div id="outline-container-vdr-environment-variables" class="outline-4">
<h4 id="vdr-environment-variables"><span class="section-number-4">6.3.1.</span> Umgebungsvariablen</h4>
<div class="outline-text-4" id="text-vdr-environment-variables">
<p>
Für den VDR und die von der Systemd-Unit genutzten Hilfsskripte können in der Konfigurationsdatei <code>/etc/default/vdr</code> Umgebungsvariablen gesetzt werden.
</p>
</div>
</div>
<div id="outline-container-vdr-start-arguments" class="outline-4">
<h4 id="vdr-start-arguments"><span class="section-number-4">6.3.2.</span> Startargumente</h4>
<div class="outline-text-4" id="text-vdr-start-arguments">
<p>
Wie schon bei yaVDR 0.6 wird weiterhin die ARGSDIR-Konfiguration genutzt. Wenn der VDR ohne Argumente gestartet wird, liest er beim Start alle Dateien mit der Endung <code>.conf</code> im Verzeichnis <code>/etc/vdr/conf.d/</code> ein.
</p>

<p>
Die Konfigurationsdateien nutzen eine vom <code>.ini</code>-Format gewohnte Syntax.
</p>
<ul class="org-ul">
<li>Zeilen, die mit einer Raute (<code>#</code>) beginnen, werden vom Parser ignoriert.</li>
<li>Jeder Abschnitt wird durch einen Begriff in eckigen Klammern eingeleitet, der angibt, wofür die Argumente in den nachfolgenden Zeilen gelten sollen. Um Startargumente für den VDR zu definieren schreibt man also <code>[vdr]</code> und für Plugins den Pluginnamen, z.B. <code>[softhddevice]</code> für das Softhddevice-Plugin.</li>
<li>In den folgenden Zeilen können dann Start-Argumente für den VDR bzw. das jeweilige Plugin übergeben werden.</li>
<li>Falls es mehrere Abschnitte gibt, die mit dem gleichen Begriff in eckigen Klammern eingeleitet werden, werden nur die Abschnitte für <code>[vdr]</code> zusammengefasst, bei Plugins wird die Konfiguration jeweils einzeln an den VDR übergeben, wodurch Plugins mehrfach mit unterschiedlichen Startargumenten geladen werden können. Plugins wie z.B. xineliboutput vertragen es nicht, wenn mehrere Instanzen geladen werden.</li>
</ul>

<p>
Um ein Plugin vom VDR laden zu lassen, genügt es seinen Namen in eckigen Klammern in einer Konfigurationsdatei abzulegen. Will man den Start verhindern, muss man dafür sorgen, dass der VDR den Eintrag nicht mehr einliest. Ein bequemes Werkzeug um Plugins zu (de-)aktivieren oder die Start-Argumente zu bearbeiten ist <a href="#vdrctl">vdrctl</a>.
</p>

<p>
Die Datei <code>/etc/vdr/conf.d/00_vdr.conf</code> enthält die vom Distributor vorgegebenen Start-Argumente für den VDR. Da alle Dateien in <code>/etc/</code>, die aus Paketen stammen, vom Paket-System als Konfigurationsdateien angesehen werden, können diese nach Wunsch verändert werden. Falls ein Paket beim Update eine davon abweichende Version mitbringt, erhält man eine Rückfrage, welche Version man übernehmen möchte.
</p>

<p>
Die Plugin-Pakete werden mit vorgefertigten Konfigurationsdateien ausgeliefert, die nach <code>/etc/vdr/conf.avail/&lt;plugin_name&gt;.conf</code> installiert und (falls der Distributor vorgibt, dass das Plugin automatisch nach der Installation aktiviert werden soll, wie es bei yaVDR der Fall ist) nach <code>/etc/vdr/conf.d/&lt;priorität&gt;-&lt;plugin_name&gt;.conf</code> verlinkt werden. Die standardmäßig gesetzte Priorität ist 50, ein abweichender Wert kann vom Distributor vorgegeben werden.
</p>

<p>
Alle Konfigurationsdateien in <i>etc/vdr/conf.d</i> werden nach Dateinamen sortiert interpretiert und somit die Plugins in der Reihenfolge der gesetzten Priorität geladen. Das Plugin mit der niedrigsten numerischen Priorität wird zuerst geladen und das Plugin mit der höchsten numerischen Priorität als letztes.
</p>

<p>
Mit dem folgenden Befehl kann man sich die vom VDR eingelesenen Startargumente anzeigen lassen:
</p>
<pre class="example" id="orgab42314">
$ vdr --showargs
</pre>
</div>
<ol class="org-ol">
<li><a id="vdrctl"></a>vdrctl<br />
<div class="outline-text-5" id="text-vdrctl">
<p>
vdrctl ist ein Hilfsprogramm, das die Verwaltung der Konfigurationsdateien für den VDR vereinfacht. Es kann die nötigen Symlinks anlegen bzw. entfernen und Konfigurationsdateien mit einem Editor öffnen.
</p>

<p>
Hier ein paar Beispiele zur Verwendung:
</p>
<pre class="example" id="org22d5338">
# Hilfe zu vdrctl anzeigen.
vdrctl -h

# Status aller verfügbaren Plugins und statischen Konfigurationdateien
$ vdrctl status

# Aktivierung eines Plugins.
$ sudo vdrctl enable streamdev-client

# Ein Plugin unter Angabe der Priorität aktivieren.
$ sudo vdrctl enable dynamite -p 90

# Aktivierung mehrerer Plugins.
$ sudo vdrctl enable streamdev-client vnsiserver

# Ein Plugin deaktivieren.
$ sudo vdrctl disable iptv

# Mehrerere Plugins deaktivieren.
$ sudo vdrctl disable streamdev-client streamdev-server iptv

# Bearbeiten der Konfiguration für ein Plugin.
$ sudo vdrctl edit imonlcd

# Bearbeiten der Konfiguration mit einem Wunsch-Editor (hier vim):
$ EDITOR=vim sudo vdrctl edit imonlcd
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-vdr-shutdown" class="outline-4">
<h4 id="vdr-shutdown"><span class="section-number-4">6.3.3.</span> Shutdown</h4>
<div class="outline-text-4" id="text-vdr-shutdown">
</div>
<ol class="org-ol">
<li><a id="vdr-shutdown-hooks"></a>Shutdown-Hooks<br />
<div class="outline-text-5" id="text-vdr-shutdown-hooks">
<p>
Zusätzlich zu den im VDR verankerten Mechanismen um einen Shutdown zu verhindern (Benutzeraktivität, anstehender Timer, Plugins verhindern den Shutdown während gewisser Operationen) gibt es die Möglichkeit den Shutdown-Versuch durch Hook-Skripte in <code>/etc/vdr/shutdown-hooks/</code> (bzw. von Paketen abgelegte Skripte in <code>/usr/share/vdr/shutdown-hooks/</code>) abzubrechen, die über den <code>vdr-shutdown-wrapper</code> und das Skript <code>/usr/lib/vdr/vdr-shutdown</code> aufgerufen werden.
</p>
</div>
<ol class="org-ol">
<li><a id="org6752622"></a>vdr-addon-acpiwakeup<br />
<div class="outline-text-6" id="text-6-3-3-1-1">
<p>
Das Addon setzt über <code>/sys/class/rtc/rtc0/wakealarm</code> bzw. über einen anderen über die Umgebungsvariable <code>WAKEALARM</code> in <code>/etc/default/vdr</code> bzw. <code>/etc/vdr/vdr-addon-acpiwakeup.conf~</code> angegebenen RTC-kompatiblen Node die Aufweckzeit.
Einstellungen wie das regelmäßige Aufwecken des Rechners, wenn kein Timer definiert wurde können über die Konfigurationsdatei <code>/etc/vdr/vdr-addon-acpiwakeup.conf</code> vorgenommen werden.
</p>
</div>
</li>
<li><a id="orgf9c6b1d"></a>vdr-addon-lifeguard-ng<br />
<div class="outline-text-6" id="text-6-3-3-1-2">
<p>
Das lifeguard-ng Addon verhindert den Shutdown für konfigurierbare Shutdown-Hindernisse wie bestehende SSH-, NFS- und Samba-Verbindungen von Clients. Darüber hinaus lassen im Netzwerk aktive Hosts bzw. pingbare IP-Addressen sowie angemeldete Nutzer und bestehende TC/IP-Verbindungen als Abbruchkriterien für den Shutdown konfigurieren. Die Konfiguration erfolgt über die <code>/etc/lifeguard.conf</code>.
</p>
</div>
</li>
</ol>
</li>

<li><a id="vdr-prevent-shutdown"></a>Shutdown durch den VDR verhindern<br />
<div class="outline-text-5" id="text-vdr-prevent-shutdown">
</div>
<ol class="org-ol">
<li><a id="org95de543"></a>automatischen Shutdown bei Inaktivität verhindern<br />
<div class="outline-text-6" id="text-6-3-3-2-1">
<p>
Um zu verhindern, dass der VDR bei Inaktivität den Rechner herunter fährt, kann man die Option &bdquo;VDR ausschalten bei Inaktivität (min)&ldquo; auf den Wert <code>0</code> setzen. Alternativ bei gestopptem VDR in der <code>/var/lib/vdr/setup.conf</code> die Variable <code>MinUserInactivity = 0</code> setzen.
</p>
</div>
</li>
