yaVDR07_documentation.org
***** Shutdown-Befehl entfernen
Will man den Shutdown durch den VDR generell unterbinden, kann man in der Datei ~/etc/vdr/conf.d/00-vdr.conf~ die Zeile mit dem Argument für den Shutdown-Befehl auskommentieren bzw. entfernen:
#+begin_src conf
#--shutdown=/usr/lib/vdr/vdr-shutdown-wrapper
#+end_src
*** Häufige Problemstellungen
:PROPERTIES:
:CUSTOM_ID: vdr-common-problems
:END:
**** VDR startet, bevor die DVB-Karten initialisiert wurden
:PROPERTIES:
:CUSTOM_ID: await-dvb
:END:
Es gibt mehrere Ansätze das Problem in yaVDR anzugehen:
****** Start des VDR verzögern
:PROPERTIES:
:CUSTOM_ID: wait-for-dvb
:END:
Die mitgelieferte Systemd-Unit *wait-for-dvb@.service* erlaubt es den VDR erst starten zu lassen, wenn die vorgegeben Tuner verfügbar sind.
Nach einem Timeout von 90 Sekunden startet der VDR trotzdem, wenn ein Tuner dann immer noch nicht aufgetaucht ist.

Wichtiger Hinweis für focal: Hier wird ~wait-for-dvb@.service~ vom Playbook (über die Rolle ~vdr~) verwaltet. In der Variablen ~wait_for_dvb_devices~ kann eine Liste von Tunern angegeben werden, für die eine Instanz der Unit aktiviert werden soll. Für alle nicht in der Liste aufgeführten Adapter von 0 - ~max_num_dvb_devices~ (Vorgabewert: ~16~) werden ggf. bereits aktivierte Instanzen der Unit deaktiviert.

Die Aktivierung der Unit muss für jeden gewünschten Tuner erfolgen - um z.B. auf ~/dev/dvb/adapter0~ zu warten:
#+BEGIN_EXAMPLE
$ sudo systemctl enable wait-for-dvb@0.service
#+END_EXAMPLE
Bei Systemen mit vielen Tunern kann man auch eine Shell Parameter Expansion nutzen, um die Unit für mehrere Tuner auf einmal zu aktivieren (hier z.B. für 8 Tuner):
#+BEGIN_EXAMPLE
$ sudo systemctl enable wait-for-dvb@{0..7}.service
#+END_EXAMPLE

Wenn Tuner ausgebaut/abgesteckt werden, sollte der dazugehörige Service wieder deaktiviert werden - hier z.B. für das Gerät ~/dev/dvb/adapter7~:
#+BEGIN_EXAMPLE
$ sudo systemctl disable wait-for-dvb@7.service
#+END_EXAMPLE
Wichtig: das funktioniert nur für Tuner, für die udev-Events ausgelöst werden, für Sundtek-Empfänger bitte das Vorgehen in [[Sundtek Treiber][Sundtek Treiber]] beachten!
****** dynamite-Plugin
:PROPERTIES:
:CUSTOM_ID: vdr-plugin-dynamite
:END:
Das dynamite-Plugin bindet DVB-Karten nachträglich automatisch ein, sobald sie verfügbar sind (leider gibt es Inkompatibilitäten mit anderen Plugins wie z.B. pvrinput)
**** VDR startet nicht
:PROPERTIES:
:CUSTOM_ID: vdr-does-not-start
:END:
Zu den häufigsten Problemursachen (ein Blick in die Logdateien hilft, um die Ursache zu erkennen) gehören:
- das Aufnahmeverzeichnis existiert nicht
- der User vdr hat keinen vollen Zugriff auf das Aufnahmeverzeichnis (Lese-, Schreib- und Ausführungsrechte nötig)
- Es wurde ein Plugin von Hand gebaut, das nach einem Update nicht mehr zur ABI-Version des VDR passt oder dessen Symbole nicht erfolgreich gelinkt werden konnten
* KODI
*** Fernsehen mit VNSI
Pakete ~vdr-plugin-vnsiserver~ und ~kodi-pvr-vdr-vnsi~ installieren, dann in KODI in den Addon-Einstellungen das PVR-Addon VNSI aktivieren.
* vdr-epg-daemon
:PROPERTIES:
:CUSTOM_ID: epgd
:END:
** Häufige Probleme
*** epgd startet nicht
**** Fehlende Locale
Die UDF (user-defined function) ~epglv~ für MariaDB benötigt die Locale ~de_DE.UTF-8~ - wenn diese fehlt, gibt es eine Fehlermeldung wie diese im Log:
#+begin_EXAMPLE
May  2 11:19:01 hdvdr epgd: SQL-Error in 'select epglv('123', '123')' - Can't initialize function 'epglv'; EPGLV() failed to change locale (1123)
May  2 11:19:01 hdvdr epgd: SQL-Error in 'select epglvr('123', '123')' - Can't initialize function 'epglvr'; EPGLV() failed to change locale (1123)
#+end_EXAMPLE

Abhilfe schaft es mittels ~sudo dpkg-reconfigure locales~ dafür zu sorgen, dass die Locales für ~de_DE.UTF-8~ erzeugt werden.

Nach einer "normalen" Ubuntu Server Installation mit deutscher Sprache sehen die für debconf gesetzten Einstellungen so aus:
#+begin_EXAMPLE
$ sudo debconf-show locales
 * locales/locales_to_be_generated: de_DE.UTF-8 UTF-8, en_US.UTF-8 UTF-8
 * locales/default_environment_locale: de_DE.UTF-8
#+end_EXAMPLE
Nach Änderungen an den Locale-Einstellungen sollte der Rechner neu gestartet werden, damit garantiert ist, dass alle Prozesse die Änderungen mitbekommen.
* Sundtek Treiber
:PROPERTIES:
:CUSTOM_ID: sundtek-drivers
:END:
Für die Nutzung von Sundtek DVB-Tunern muss das Paket ~dvb-driver-sundtek~ installiert werden. Die Ansible-Rolle [[install-sundtek][install-sundtek]] kann einem die hier beschriebene Konfigurationsschritte abnehmen.

~LD_PRELOAD=/opt/lib/libmediaclient.so~ muss für alle Programme als Umgebungsvariable gesetzt werden, die die Sundtek-Geräte nutzen sollen (wie z.B. ~w_scan~).

Damit der VDR die vom Sundtek mediasrv erstellten Devices nutzen kann, muss die Unit ~vdr.service~ mit dem folgendem Snippet erweitert werden:
#+begin_src systemd
# /etc/systemd/system/vdr.service.d/sundtek.conf
[Service]
Environment=LD_PRELOAD=/opt/lib/libmediaclient.so
#+end_src


Prinzpiell gibt es zwei Möglichkeiten die Tuner mit dem VDR zu nutzen, die in den folgenden Abschnitten genauer erläutert werden:
 - [[#sundtek-delay-vdr-start][Start des VDR verzögern, bis alle Tuner intialisiert wurden]]
 - [[#sundtek-dynamic-includes][Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen]]

