yaVDR07_documentation.html
<li><a id="org8ad4895"></a>Shutdown-Befehl entfernen<br />
<div class="outline-text-6" id="text-6-3-3-2-2">
<p>
Will man den Shutdown durch den VDR generell unterbinden, kann man in der Datei <code>/etc/vdr/conf.d/00-vdr.conf</code> die Zeile mit dem Argument für den Shutdown-Befehl auskommentieren bzw. entfernen:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter">#</span><span class="org-comment">--shutdown=/usr/lib/vdr/vdr-shutdown-wrapper</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-vdr-common-problems" class="outline-4">
<h4 id="vdr-common-problems"><span class="section-number-4">6.3.4.</span> Häufige Problemstellungen</h4>
<div class="outline-text-4" id="text-vdr-common-problems">
</div>
<ol class="org-ol">
<li><a id="await-dvb"></a>VDR startet, bevor die DVB-Karten initialisiert wurden<br />
<div class="outline-text-5" id="text-await-dvb">
<p>
Es gibt mehrere Ansätze das Problem in yaVDR anzugehen:
</p>
</div>
<ol class="org-ol">
<li><a id="wait-for-dvb"></a>Start des VDR verzögern<br />
<div class="outline-text-7" id="text-wait-for-dvb">
<p>
Die mitgelieferte Systemd-Unit <b>wait-for-dvb@.service</b> erlaubt es den VDR erst starten zu lassen, wenn die vorgegeben Tuner verfügbar sind.
Nach einem Timeout von 90 Sekunden startet der VDR trotzdem, wenn ein Tuner dann immer noch nicht aufgetaucht ist.
</p>

<p>
Wichtiger Hinweis für focal: Hier wird <code>wait-for-dvb@.service</code> vom Playbook (über die Rolle <code>vdr</code>) verwaltet. In der Variablen <code>wait_for_dvb_devices</code> kann eine Liste von Tunern angegeben werden, für die eine Instanz der Unit aktiviert werden soll. Für alle nicht in der Liste aufgeführten Adapter von 0 - <code>max_num_dvb_devices</code> (Vorgabewert: <code>16</code>) werden ggf. bereits aktivierte Instanzen der Unit deaktiviert.
</p>

<p>
Die Aktivierung der Unit muss für jeden gewünschten Tuner erfolgen - um z.B. auf <code>/dev/dvb/adapter0</code> zu warten:
</p>
<pre class="example" id="org0b6d8f9">
$ sudo systemctl enable wait-for-dvb@0.service
</pre>
<p>
Bei Systemen mit vielen Tunern kann man auch eine Shell Parameter Expansion nutzen, um die Unit für mehrere Tuner auf einmal zu aktivieren (hier z.B. für 8 Tuner):
</p>
<pre class="example" id="org89bbe07">
$ sudo systemctl enable wait-for-dvb@{0..7}.service
</pre>

<p>
Wenn Tuner ausgebaut/abgesteckt werden, sollte der dazugehörige Service wieder deaktiviert werden - hier z.B. für das Gerät <code>/dev/dvb/adapter7</code>:
</p>
<pre class="example" id="orgb181b1f">
$ sudo systemctl disable wait-for-dvb@7.service
</pre>
<p>
Wichtig: das funktioniert nur für Tuner, für die udev-Events ausgelöst werden, für Sundtek-Empfänger bitte das Vorgehen in <a href="#sundtek-drivers">Sundtek Treiber</a> beachten!
</p>
</div>
</li>
<li><a id="vdr-plugin-dynamite"></a>dynamite-Plugin<br />
<div class="outline-text-7" id="text-vdr-plugin-dynamite">
<p>
Das dynamite-Plugin bindet DVB-Karten nachträglich automatisch ein, sobald sie verfügbar sind (leider gibt es Inkompatibilitäten mit anderen Plugins wie z.B. pvrinput)
</p>
</div>
</li>
</ol>
</li>
<li><a id="vdr-does-not-start"></a>VDR startet nicht<br />
<div class="outline-text-5" id="text-vdr-does-not-start">
<p>
Zu den häufigsten Problemursachen (ein Blick in die Logdateien hilft, um die Ursache zu erkennen) gehören:
</p>
<ul class="org-ul">
<li>das Aufnahmeverzeichnis existiert nicht</li>
<li>der User vdr hat keinen vollen Zugriff auf das Aufnahmeverzeichnis (Lese-, Schreib- und Ausführungsrechte nötig)</li>
<li>Es wurde ein Plugin von Hand gebaut, das nach einem Update nicht mehr zur ABI-Version des VDR passt oder dessen Symbole nicht erfolgreich gelinkt werden konnten</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbd4f108" class="outline-2">
<h2 id="orgbd4f108"><span class="section-number-2">7.</span> KODI</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd353696" class="outline-4">
<h4 id="orgd353696"><span class="section-number-4">7.0.1.</span> Fernsehen mit VNSI</h4>
<div class="outline-text-4" id="text-7-0-1">
<p>
Pakete <code>vdr-plugin-vnsiserver</code> und <code>kodi-pvr-vdr-vnsi</code> installieren, dann in KODI in den Addon-Einstellungen das PVR-Addon VNSI aktivieren.
</p>
</div>
</div>
</div>
<div id="outline-container-epgd" class="outline-2">
<h2 id="epgd"><span class="section-number-2">8.</span> vdr-epg-daemon</h2>
<div class="outline-text-2" id="text-epgd">
</div>
<div id="outline-container-org69d52ee" class="outline-3">
<h3 id="org69d52ee"><span class="section-number-3">8.1.</span> Häufige Probleme</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org087c8e5" class="outline-4">
<h4 id="org087c8e5"><span class="section-number-4">8.1.1.</span> epgd startet nicht</h4>
<div class="outline-text-4" id="text-8-1-1">
</div>
<ol class="org-ol">
<li><a id="org790c38a"></a>Fehlende Locale<br />
<div class="outline-text-5" id="text-8-1-1-1">
<p>
Die UDF (user-defined function) <code>epglv</code> für MariaDB benötigt die Locale <code>de_DE.UTF-8</code> - wenn diese fehlt, gibt es eine Fehlermeldung wie diese im Log:
</p>
<pre class="example" id="org52ec7aa">
May  2 11:19:01 hdvdr epgd: SQL-Error in 'select epglv('123', '123')' - Can't initialize function 'epglv'; EPGLV() failed to change locale (1123)
May  2 11:19:01 hdvdr epgd: SQL-Error in 'select epglvr('123', '123')' - Can't initialize function 'epglvr'; EPGLV() failed to change locale (1123)
</pre>

<p>
Abhilfe schaft es mittels <code>sudo dpkg-reconfigure locales</code> dafür zu sorgen, dass die Locales für <code>de_DE.UTF-8</code> erzeugt werden.
</p>

<p>
Nach einer &bdquo;normalen&ldquo; Ubuntu Server Installation mit deutscher Sprache sehen die für debconf gesetzten Einstellungen so aus:
</p>
<pre class="example" id="orgdfb7e8a">
$ sudo debconf-show locales
 * locales/locales_to_be_generated: de_DE.UTF-8 UTF-8, en_US.UTF-8 UTF-8
 * locales/default_environment_locale: de_DE.UTF-8
</pre>
<p>
Nach Änderungen an den Locale-Einstellungen sollte der Rechner neu gestartet werden, damit garantiert ist, dass alle Prozesse die Änderungen mitbekommen.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sundtek-drivers" class="outline-2">
<h2 id="sundtek-drivers"><span class="section-number-2">9.</span> Sundtek Treiber</h2>
<div class="outline-text-2" id="text-sundtek-drivers">
<p>
Für die Nutzung von Sundtek DVB-Tunern muss das Paket <code>dvb-driver-sundtek</code> installiert werden. Die Ansible-Rolle <a href="#install-sundtek-role">install-sundtek</a> kann einem die hier beschriebene Konfigurationsschritte abnehmen.
</p>

<p>
<code>LD_PRELOAD=/opt/lib/libmediaclient.so</code> muss für alle Programme als Umgebungsvariable gesetzt werden, die die Sundtek-Geräte nutzen sollen (wie z.B. <code>w_scan</code>).
</p>

<p>
Damit der VDR die vom Sundtek mediasrv erstellten Devices nutzen kann, muss die Unit <code>vdr.service</code> mit dem folgendem Snippet erweitert werden:
</p>
<div class="org-src-container">
<pre class="src src-systemd"><span class="org-comment-delimiter"># </span><span class="org-comment">/etc/systemd/system/vdr.service.d/sundtek.conf</span>
<span class="org-type">[Service]</span>
<span class="org-keyword">Environment</span>=LD_PRELOAD=/opt/lib/libmediaclient.so
</pre>
</div>


<p>
Prinzpiell gibt es zwei Möglichkeiten die Tuner mit dem VDR zu nutzen, die in den folgenden Abschnitten genauer erläutert werden:
</p>
<ul class="org-ul">
<li><a href="#sundtek-delay-vdr-start">Start des VDR verzögern, bis alle Tuner intialisiert wurden</a></li>
<li><a href="#sundtek-dynamic-includes">Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen</a></li>
</ul>
</div>
