yaVDR07_documentation.org
** Start des VDR verzögern, bis alle Tuner initialisiert wurden
:PROPERTIES:
:CUSTOM_ID: sundtek-delay-vdr-start
:END:
# TODO: in Paket yavdr-hardware-sundtek packen!
#+begin_src systemd
# /etc/systemd/system/sundtek.service
[Unit]
Description=Sundtek mediasrv
#After=network-online.target
Before=vdr.service

[Service]
Type=forking
ExecStart=/opt/bin/mediasrv -d --pluginpath=/opt/bin --wait-for-devices
ExecStop=/opt/bin/mediaclient --shutdown
Restart=on-failure

[Install]
WantedBy=multi-user.target
#+end_src

Die Unit kann dann mit dem folgenden Befehl aktiviert werden, damit sie beim Systemstart automatisch ausgeführt wird:
#+begin_EXAMPLE
systemctl enable sundtek.service
#+end_EXAMPLE

Falls man Netzwerktuner über die ~/etc/sundtek.conf~ einbinden will, muss die Zeile ~After=network-online.service~ einkommentiert werden und außerdem muss sichergestellt sein, dass der Server dauerhaft erreichbar ist.

Nachteil dieser Variante ist, dass man Sundtek-Tuner zur Laufzeit des VDR nicht hinzufügen bzw. entfernen kann, dafür funktionieren Plugins, die voraussetzen, dass bestimmte Geräteknoten für die DVB-Geräte existieren.

** Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen
:PROPERTIES:
:CUSTOM_ID: sundtek-dynamic-includes
:END:
Um lokal angeschlossene Tuner automatisch ein- bzw. aushängen zu lassen müssen die Pakete ~vdr-plugin-dynamite~ und ~vdr-plugin-sundtek~ installiert werden.

Das ~vdr-plugin-sundtek~ reagiert auf Meldungen des mediasrv für neu hinzugefügte bzw. abgesteckte Sundtek-Tuner und bindet diese über das ~vdr-plugin-dynamite~ ein bzw. hängt sie aus.

Das automatische Einbinden von über Avahi angekündigten Sundtek-Tunern im Netzwerk ist aktuell noch nicht möglich, da der von früheren yaVDR-Versionen bekannte ~avahi-sundtek-mounter~ erst noch angepasst werden muss.
