yaVDR07_documentation.html

<div id="outline-container-sundtek-delay-vdr-start" class="outline-3">
<h3 id="sundtek-delay-vdr-start"><span class="section-number-3">9.1.</span> Start des VDR verzögern, bis alle Tuner initialisiert wurden</h3>
<div class="outline-text-3" id="text-sundtek-delay-vdr-start">
<div class="org-src-container">
<pre class="src src-systemd"><span class="org-comment-delimiter"># </span><span class="org-comment">/etc/systemd/system/sundtek.service</span>
<span class="org-type">[Unit]</span>
<span class="org-keyword">Description</span>=Sundtek mediasrv
<span class="org-comment-delimiter">#</span><span class="org-comment">After=network-online.target</span>
<span class="org-keyword">Before</span>=vdr.service

<span class="org-type">[Service]</span>
<span class="org-keyword">Type</span>=<span class="org-builtin">forking</span>
<span class="org-keyword">ExecStart</span>=/opt/bin/mediasrv -d --pluginpath=/opt/bin --wait-for-devices
<span class="org-keyword">ExecStop</span>=/opt/bin/mediaclient --shutdown
<span class="org-keyword">Restart</span>=<span class="org-builtin">on-failure</span>

<span class="org-type">[Install]</span>
<span class="org-keyword">WantedBy</span>=multi-user.target
</pre>
</div>

<p>
Die Unit kann dann mit dem folgenden Befehl aktiviert werden, damit sie beim Systemstart automatisch ausgeführt wird:
</p>
<pre class="example" id="org950cb95">
systemctl enable sundtek.service
</pre>

<p>
Falls man Netzwerktuner über die <code>/etc/sundtek.conf</code> einbinden will, muss die Zeile <code>After=network-online.service</code> einkommentiert werden und außerdem muss sichergestellt sein, dass der Server dauerhaft erreichbar ist.
</p>

<p>
Nachteil dieser Variante ist, dass man Sundtek-Tuner zur Laufzeit des VDR nicht hinzufügen bzw. entfernen kann, dafür funktionieren Plugins, die voraussetzen, dass bestimmte Geräteknoten für die DVB-Geräte existieren.
</p>
</div>
</div>

<div id="outline-container-sundtek-dynamic-includes" class="outline-3">
<h3 id="sundtek-dynamic-includes"><span class="section-number-3">9.2.</span> Sundtek-Tuner automatisch zur Laufzeit des VDR einbinden lassen</h3>
<div class="outline-text-3" id="text-sundtek-dynamic-includes">
<p>
Um lokal angeschlossene Tuner automatisch ein- bzw. aushängen zu lassen müssen die Pakete <code>vdr-plugin-dynamite</code> und <code>vdr-plugin-sundtek</code> installiert werden.
</p>

<p>
Das <code>vdr-plugin-sundtek</code> reagiert auf Meldungen des mediasrv für neu hinzugefügte bzw. abgesteckte Sundtek-Tuner und bindet diese über das <code>vdr-plugin-dynamite</code> ein bzw. hängt sie aus.
</p>

<p>
Das automatische Einbinden von über Avahi angekündigten Sundtek-Tunern im Netzwerk ist aktuell noch nicht möglich, da der von früheren yaVDR-Versionen bekannte <code>avahi-sundtek-mounter</code> erst noch angepasst werden muss.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alexander Grothe (seahawk1986)</p>
<p class="date">Created: 2021-10-01 Fr 18:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
